{"Functions": {"getStartDelay(android.view.ViewGroup,android.transition.Transition,android.transition.TransitionValues,android.transition.TransitionValues)": {"Returns": [["long", "A start delay to use with the Animator created by transition. The delay will be offset by the minimum delay of all TransitionPropagations used in the Transition so that the smallest delay will be 0. Returned values may be negative."]], "Parameters": [["@B_android#view#ViewGroup_E@", "ViewGroup: The root of the View hierarchy running the transition."], ["@B_android#transition#Transition_E@", "Transition: The transition that created the Animator"], ["@B_android#transition#TransitionValues_E@", "TransitionValues: The values for a specific target in the start scene."], ["@B_android#transition#TransitionValues_E@", "TransitionValues: The values for the target in the end scene."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Called by Transition to alter the Animator start delay. All start delays will be adjusted such that the minimum becomes zero.", "history": "Added in API level 21", "FullName": "public long getStartDelay (ViewGroup sceneRoot, Transition transition, TransitionValues startValues, TransitionValues endValues)"}, "setPropagationSpeed(float)": {"Returns": [], "Parameters": [["float", "float: The speed at which propagation occurs, relative to the duration of the transition. A speed of 4 means it works 4 times as fast as the duration of the transition. May not be 0."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Sets the speed at which transition propagation happens, relative to the duration of the Transition. A propagationSpeed of 1 means that a View centered farthest from the epicenter and View centered at the epicenter will have a difference in start delay of approximately the duration of the Transition. A speed of 2 means the start delay difference will be approximately half of the duration of the transition. A value of 0 is illegal, but negative values will invert the propagation.", "history": "Added in API level 21", "FullName": "public void setPropagationSpeed (float propagationSpeed)"}, "CircularPropagation()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "", "history": "added in API level 21", "FullName": "public CircularPropagation ()"}}, "Inheritance": ["@B_android#transition#TransitionPropagation_E@", "@B_android#transition#VisibilityPropagation_E@"], "ClassName": "android.transition.CircularPropagation", "ClassDesc": "A propagation that varies with the distance to the epicenter of the Transition or center of the scene if no epicenter exists. When a View is visible in the start of the transition, Views farther from the epicenter will transition sooner than Views closer to the epicenter. When a View is not in the start of the transition or is not visible at the start of the transition, it will transition sooner when closer to the epicenter and later when farther from the epicenter. This is the default TransitionPropagation used with @B_android#transition#Explode_E@."}