{"Functions": {"PatternPathMotion()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Constructs a PatternPathMotion with a straight-line pattern.", "history": "added in version 26.0.0-beta1", "FullName": "PatternPathMotion ()"}, "getPatternPath()": {"Returns": [["@B_android#graphics#Path_E@", "the Path defining a pattern of motion between two coordinates."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the Path defining a pattern of motion between two coordinates. The pattern will be translated, rotated, and scaled to fit between the start and end points. The pattern must not be empty and must have the end point differ from the start point.", "history": "added in version 26.0.0-beta1", "FullName": "Path getPatternPath ()"}, "setPatternPath(android.graphics.Path)": {"Returns": [], "Parameters": [["@B_android#graphics#Path_E@", "Path: A Path to be used as a pattern for two-dimensional motion."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Sets the Path defining a pattern of motion between two coordinates. The pattern will be translated, rotated, and scaled to fit between the start and end points. The pattern must not be empty and must have the end point differ from the start point.", "history": "added in version 26.0.0-beta1", "FullName": "void setPatternPath (Path patternPath)"}, "getPath(float, float, float, float)": {"Returns": [["@B_android#graphics#Path_E@", "A Path along which the points should be interpolated. The returned Path must start at point (startX, startY), typically using @B_android#graphics#Path#moveTo_E@ and end at (endX, endY)."]], "Parameters": [["float", "float: The x coordinate of the starting point."], ["float", "float: The y coordinate of the starting point."], ["float", "float: The x coordinate of the ending point."], ["float", "float: The y coordinate of the ending point."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Provide a Path to interpolate between two points (startX, startY) and (endX, endY). This allows controlled curved motion along two dimensions.", "history": "added in version 26.0.0-beta1", "FullName": "Path getPath (float startX, float startY, float endX, float endY)"}, "PatternPathMotion(android.graphics.Path)": {"Returns": [], "Parameters": [["@B_android#graphics#Path_E@", "Path: A Path to be used as a pattern for two-dimensional motion."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Creates a PatternPathMotion with the Path defining a pattern of motion between two coordinates. The pattern will be translated, rotated, and scaled to fit between the start and end points. The pattern must not be empty and must have the end point differ from the start point.", "history": "added in version 26.0.0-beta1", "FullName": "PatternPathMotion (Path patternPath)"}}, "Inheritance": ["java.lang.Object", "@B_android#support#transition#PathMotion_E@"], "ClassName": "android.support.transition.PatternPathMotion", "ClassDesc": "A PathMotion that takes a Path pattern and applies it to the separation between two points. The starting point of the Path will be moved to the origin and the end point will be scaled and rotated so that it matches with the target end point. This may be used in XML as an element inside a transition."}