{"Functions": {"toString()": {"Returns": [["@B_java#lang#String_E@", "a string representation of the object."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a string representation of the object. In general, the toString method returns a string that \"textually represents\" this object. The result should be a concise but informative representation that is easy for a person to read. It is recommended that all subclasses override this method. The toString method for class Object returns a string consisting of the name of the class of which the object is an instance, the at-sign character `@', and the unsigned hexadecimal representation of the hash code of the object. In other words, this method returns a string equal to the value of:", "history": "Added in API level 5", "FullName": "public String toString ()"}, "writeToParcel(android.os.Parcel, int)": {"Returns": [], "Parameters": [["@B_android#os#Parcel_E@", "Parcel: The Parcel in which the object should be written."], ["int", "int: Additional flags about how the object should be written. May be 0 or @B_android#os#Parcelable#PARCELABLE_WRITE_RETURN_VALUE_E@."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Flatten this object in to a Parcel.", "history": "added in API level 5", "FullName": "public void writeToParcel (Parcel out, int flags)"}, "hasService(int)": {"Returns": [["boolean", "true if the service class is supported"]], "Parameters": [["int", "int: valid service class"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Return true if the specified service class is supported by this @B_android#bluetooth#BluetoothClass_E@. Valid service classes are the public constants in @B_android#bluetooth#BluetoothClass#Service_E@. For example, @B_android#bluetooth#BluetoothClass#Service#AUDIO_E@.", "history": "Added in API level 5", "FullName": "public boolean hasService (int service)"}, "equals(java.lang.Object)": {"Returns": [["boolean", "true if this object is the same as the obj argument; false otherwise."]], "Parameters": [["@B_java#lang#Object_E@", "Object: the reference object with which to compare."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Indicates whether some other object is \"equal to\" this one. The equals method implements an equivalence relation on non-null object references: It is x, x.equals(x) should return true. It is x and y, x.equals(y) should return true if and only if y.equals(x) returns true. It is x, y, and z, if x.equals(y) returns true and y.equals(z) returns true, then x.equals(z) should return true. It is x and y, multiple invocations of x.equals(y) consistently return true or consistently return false, provided no information used in equals comparisons on the objects is modified. For any non-null reference value x, x.equals(null) should return false. The equals method for class Object implements the most discriminating possible equivalence relation on objects; that is, for any non-null reference values x and y, this method returns true if and only if x and y refer to the same object (x == y has the value true). Note that it is generally necessary to override the hashCode method whenever this method is overridden, so as to maintain the general contract for the hashCode method, which states that equal objects must have equal hash codes.", "history": "Added in API level 5", "FullName": "public boolean equals (Object o)"}, "writeToParcel(android.os.Parcel,int)": {"Returns": [], "Parameters": [["@B_android#os#Parcel_E@", "Parcel: The Parcel in which the object should be written."], ["int", "int: Additional flags about how the object should be written. May be 0 or @B_android#os#Parcelable#PARCELABLE_WRITE_RETURN_VALUE_E@. Value is either 0 or a combination of @B_android#os#Parcelable#PARCELABLE_WRITE_RETURN_VALUE_E@, and android.os.Parcelable.PARCELABLE_ELIDE_DUPLICATES"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Flatten this object in to a Parcel.", "history": "Added in API level 5", "FullName": "public void writeToParcel (Parcel out, int flags)"}, "hashCode()": {"Returns": [["int", "a hash code value for this object."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a hash code value for the object. This method is supported for the benefit of hash tables such as those provided by @B_java#util#HashMap_E@. The general contract of hashCode is: Whenever it is invoked on the same object more than once during an execution of a Java application, the hashCode method must consistently return the same integer, provided no information used in equals comparisons on the object is modified. This integer need not remain consistent from one execution of an application to another execution of the same application. If two objects are equal according to the equals(Object) method, then calling the hashCode method on each of the two objects must produce the same integer result. It is not required that if two objects are unequal according to the @B_java#lang#Object#equals_E@ method, then calling the hashCode method on each of the two objects must produce distinct integer results. However, the programmer should be aware that producing distinct integer results for unequal objects may improve the performance of hash tables. As much as is reasonably practical, the hashCode method defined by class Object does return distinct integers for distinct objects. (This is typically implemented by converting the internal address of the object into an integer, but this implementation technique is not required by the Java™ programming language.)", "history": "Added in API level 5", "FullName": "public int hashCode ()"}, "describeContents()": {"Returns": [["int", "a bitmask indicating the set of special object types marshaled by this Parcelable object instance. Value is either 0 or @B_android#os#Parcelable#CONTENTS_FILE_DESCRIPTOR_E@"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Describe the kinds of special objects contained in this Parcelable instance's marshaled representation. For example, if the object will include a file descriptor in the output of @B_android#os#Parcelable#writeToParcel_E@, the return value of this method must include the @B_android#os#Parcelable#CONTENTS_FILE_DESCRIPTOR_E@ bit.", "history": "Added in API level 5", "FullName": "public int describeContents ()"}, "getDeviceClass()": {"Returns": [["int", "device class component"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Return the (major and minor) device class component of this @B_android#bluetooth#BluetoothClass_E@. Values returned from this function can be compared with the public constants in @B_android#bluetooth#BluetoothClass#Device_E@ to determine which device class is encoded in this Bluetooth class.", "history": "Added in API level 5", "FullName": "public int getDeviceClass ()"}, "getMajorDeviceClass()": {"Returns": [["int", "major device class component"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Return the major device class component of this @B_android#bluetooth#BluetoothClass_E@. Values returned from this function can be compared with the public constants in @B_android#bluetooth#BluetoothClass#Device#Major_E@ to determine which major class is encoded in this Bluetooth class.", "history": "Added in API level 5", "FullName": "public int getMajorDeviceClass ()"}}, "Inheritance": [], "ClassName": "android.bluetooth.BluetoothClass", "ClassDesc": "Represents a Bluetooth class, which describes general characteristics and capabilities of a device. For example, a Bluetooth class will specify the general device type such as a phone, a computer, or headset, and whether it's capable of services such as audio or telephony. Every Bluetooth class is composed of zero or more service classes, and exactly one device class. The device class is further broken down into major and minor device class components. @B_android#bluetooth#BluetoothClass_E@ is useful as a hint to roughly describe a device (for example to show an icon in the UI), but does not reliably describe which Bluetooth profiles or services are actually supported by a device. Accurate service discovery is done through SDP requests, which are automatically performed when creating an RFCOMM socket with @B_android#bluetooth#BluetoothDevice#createRfcommSocketToServiceRecord_E@ and @B_android#bluetooth#BluetoothAdapter#listenUsingRfcommWithServiceRecord_E@ Use @B_android#bluetooth#BluetoothDevice#getBluetoothClass_E@ to retrieve the class for a remote device."}