{"Functions": {"onTimeShiftCurrentPositionChanged(java.lang.String,long)": {"Returns": [], "Parameters": [["@B_java#lang#String_E@", "String: The ID of the TV input bound to this view."], ["long", "long: The current position for time shifting, in milliseconds since the epoch."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "This is called when the current position for time shifting has changed. The current position for time shifting is the same as the current position of playback. During playback, the current position changes continuously. When paused, it does not change. Note that timeMs is wall-clock time.", "history": "Added in API level 23", "FullName": "public void onTimeShiftCurrentPositionChanged (String inputId, long timeMs)"}, "TvView.TimeShiftPositionCallback()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "", "history": "added in API level 23", "FullName": "public TvView.TimeShiftPositionCallback ()"}, "onTimeShiftStartPositionChanged(java.lang.String,long)": {"Returns": [], "Parameters": [["@B_java#lang#String_E@", "String: The ID of the TV input bound to this view."], ["long", "long: The start position for time shifting, in milliseconds since the epoch."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "This is called when the start position for time shifting has changed. The start position for time shifting indicates the earliest possible time the user can seek to. Initially this is equivalent to the time when the underlying TV input starts recording. Later it may be adjusted because there is insufficient space or the duration of recording is limited. The application must not allow the user to seek to a position earlier than the start position. For playback of a recorded program initiated by @B_android#media#tv#TvView#timeShiftPlay_E@, the start position is the time when playback starts. It does not change.", "history": "Added in API level 23", "FullName": "public void onTimeShiftStartPositionChanged (String inputId, long timeMs)"}}, "Inheritance": [], "ClassName": "android.media.tv.TvView.TimeShiftPositionCallback", "ClassDesc": "Callback used to receive time shift position changes."}