{"Functions": {"startViewCalendarEventInManagedProfile(android.content.Context,long,long,long,boolean,int)": {"Returns": [["boolean", "true if the activity is started successfully. false otherwise."]], "Parameters": [["@B_android#content#Context_E@", "Context: the context. This value must never be null."], ["long", "long: the id of the event to be viewed. Will be put into @B_android#provider#CalendarContract#EXTRA_EVENT_ID_E@ field of the intent."], ["long", "long: the start time of the event in milliseconds since epoch. Will be put into @B_android#provider#CalendarContract#EXTRA_EVENT_BEGIN_TIME_E@ field of the intent."], ["long", "long: the end time of the event in milliseconds since epoch. Will be put into @B_android#provider#CalendarContract#EXTRA_EVENT_END_TIME_E@ field of the intent."], ["boolean", "boolean: if the event is an all-day event. Will be put into @B_android#provider#CalendarContract#EXTRA_EVENT_ALL_DAY_E@ field of the intent."], ["int", "int: flags to be set on the intent via @B_android#content#Intent#setFlags_E@"]], "Throws": [], "SeeAlso": ["@B_android#provider#CalendarContract_E@"], "Permissions": [], "Description": "Starts an activity to view calendar events in the managed profile. When this API is called, the system will attempt to start an activity in the managed profile with an intent targeting the same caller package. The intent will have its action set to @B_android#provider#CalendarContract#ACTION_VIEW_MANAGED_PROFILE_CALENDAR_EVENT_E@ and contain extras corresponding to the API's arguments. A calendar app intending to support cross-profile events viewing should handle this intent, parse the arguments and show the appropriate UI.", "history": "Added in API level 29", "FullName": "public static boolean startViewCalendarEventInManagedProfile (Context context, long eventId, long startMs, long endMs, boolean allDay, int flags)"}}, "Inheritance": [], "ClassName": "android.provider.CalendarContract", "ClassDesc": "The contract between the calendar provider and applications. Contains definitions for the supported URIs and data columns. CalendarContract defines the data model of calendar and event related information. This data is stored in a number of tables: The @B_android#provider#CalendarContract#Calendars_E@ table holds the calendar specific information. Each row in this table contains the details for a single calendar, such as the name, color, sync info, etc. The @B_android#provider#CalendarContract#Events_E@ table holds the event specific information. Each row in this table has the info for a single event. It contains information such as event title, location, start time, end time, etc. The event can occur one-time or can recur multiple times. Attendees, reminders, and extended properties are stored on separate tables and reference the @B_android#provider#BaseColumns#_ID_E@ to link them with the event. The @B_android#provider#CalendarContract#Instances_E@ table holds the start and end time for occurrences of an event. Each row in this table represents a single occurrence. For one-time events there will be a 1:1 mapping of instances to events. For recurring events, multiple rows will automatically be generated which correspond to multiple occurrences of that event. The @B_android#provider#CalendarContract#Attendees_E@ table holds the event attendee or guest information. Each row represents a single guest of an event. It specifies the type of guest they are and their attendance response for the event. The @B_android#provider#CalendarContract#Reminders_E@ table holds the alert/notification data. Each row represents a single alert for an event. An event can have multiple reminders. The number of reminders per event is specified in @B_android#provider#CalendarContract#CalendarColumns#MAX_REMINDERS_E@ which is set by the Sync Adapter that owns the given calendar. Reminders are specified in minutes before the event and have a type. The @B_android#provider#CalendarContract#ExtendedProperties_E@ table holds opaque data fields used by the sync adapter. The provider takes no action with items in this table except to delete them when their related events are deleted. Other tables include: @B_android#provider#CalendarContract#SyncState_E@, which contains free-form data maintained by the sync adapters"}