{"Functions": {"onServiceDisconnected(android.content.ComponentName)": {"Returns": [], "Parameters": [["@B_android#content#ComponentName_E@", "ComponentName: The concrete component name of the service whose connection has been lost."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Called when a connection to the Service has been lost. This typically happens when the process hosting the service has crashed or been killed. This does not remove the ServiceConnection itself -- this binding to the service will remain active, and you will receive a call to @B_android#content#ServiceConnection#onServiceConnected_E@ when the Service is next running.", "history": "Added in API level 1", "FullName": "public abstract void onServiceDisconnected (ComponentName name)"}, "onServiceConnected(android.content.ComponentName,android.os.IBinder)": {"Returns": [], "Parameters": [["@B_android#content#ComponentName_E@", "ComponentName: The concrete component name of the service that has been connected."], ["@B_android#os#IBinder_E@", "IBinder: The IBinder of the Service's communication channel, which you can now make calls on."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Called when a connection to the Service has been established, with the @B_android#os#IBinder_E@ of the communication channel to the Service.", "history": "Added in API level 1", "FullName": "public abstract void onServiceConnected (ComponentName name, IBinder service)"}, "onNullBinding(android.content.ComponentName)": {"Returns": [], "Parameters": [["@B_android#content#ComponentName_E@", "ComponentName: The concrete component name of the service whose binding has been rejected by the Service implementation."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Called when the service being bound has returned null from its @B_android#app#Service#onBind_E@ method. This indicates that the attempting service binding represented by this ServiceConnection will never become usable. The app which requested the binding must still call @B_android#content#Context#unbindService_E@ to release the tracking resources associated with this ServiceConnection even if this callback was invoked following @B_android#content#Context#bindService_E@.", "history": "Added in API level 28", "FullName": "public void onNullBinding (ComponentName name)"}, "onBindingDied(android.content.ComponentName)": {"Returns": [], "Parameters": [["@B_android#content#ComponentName_E@", "ComponentName: The concrete component name of the service whose connection is dead."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Called when the binding to this connection is dead. This means the interface will never receive another connection. The application will need to unbind and rebind the connection to activate it again. This may happen, for example, if the application hosting the service it is bound to has been updated.", "history": "Added in API level 26", "FullName": "public void onBindingDied (ComponentName name)"}}, "Inheritance": [], "ClassName": "android.content.ServiceConnection", "ClassDesc": "Interface for monitoring the state of an application service. See @B_android#app#Service_E@ and @B_android#content#Context#bindService_E@ for more information. Like many callbacks from the system, the methods on this class are called from the main thread of your process."}