{"Functions": {"endSection()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Writes a trace message to indicate that a given section of code has ended. This call must be preceeded by a corresponding call to @B_android#support#v4#os#TraceCompat#beginSection_E@. Calling this method will mark the end of the most recently begun section of code, so care must be taken to ensure that beginSection / endSection pairs are properly nested and called from the same thread.", "history": "added in version 22.1.0", "FullName": "void endSection ()"}, "beginSection(java.lang.String)": {"Returns": [], "Parameters": [["@B_java#lang#String_E@", "String: The name of the code section to appear in the trace. This may be at most 127 Unicode code units long."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Writes a trace message to indicate that a given section of code has begun. This call must be followed by a corresponding call to @B_android#support#v4#os#TraceCompat#endSection_E@ on the same thread. At this time the vertical bar character '|', newline character '\\n', and null character '\\0' are used internally by the tracing mechanism. If sectionName contains these characters they will be replaced with a space character in the trace.", "history": "added in version 22.1.0", "FullName": "void beginSection (String sectionName)"}, "TraceCompat()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "", "history": "", "FullName": "public TraceCompat ()"}}, "Inheritance": ["java.lang.Object"], "ClassName": "android.support.v4.os.TraceCompat", "ClassDesc": "Writes trace events to the system trace buffer. These trace events can be collected and visualized using the Systrace tool. This tracing mechanism is independent of the method tracing mechanism offered by https:##developer#android#com@B_android#os#Debug#startMethodTracing_E@. In particular, it enables tracing of events that occur across multiple processes. For information about using the Systrace tool, read"}