{"Functions": {"getPixelStride()": {"Returns": [["int", "no returns description in source"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "The distance between adjacent pixel samples, in bytes. This is the distance between two consecutive pixel values in a row of pixels. It may be larger than the size of a single pixel to account for interleaved image data or padded formats. Note that pixel stride is undefined for some formats such as @B_android#graphics#ImageFormat#RAW_PRIVATE_E@, and calling getPixelStride on images of these formats will cause an UnsupportedOperationException being thrown. For formats where pixel stride is well defined, the pixel stride is always greater than 0.", "history": "Added in API level 19", "FullName": "public abstract int getPixelStride ()"}, "getBuffer()": {"Returns": [["@B_java#nio#ByteBuffer_E@", "the byte buffer containing the image data for this plane."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Get a direct @B_java#nio#ByteBuffer_E@ containing the frame data. In particular, the buffer returned will always have @B_java#nio#ByteBuffer#isDirect_E@ return true, so the underlying data could be mapped as a pointer in JNI without doing any copies with GetDirectBufferAddress. For raw formats, each plane is only guaranteed to contain data up to the last pixel in the last row. In other words, the stride after the last row may not be mapped into the buffer. This is a necessary requirement for any interleaved format.", "history": "Added in API level 19", "FullName": "public abstract ByteBuffer getBuffer ()"}, "getRowStride()": {"Returns": [["int", "no returns description in source"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "The row stride for this color plane, in bytes. This is the distance between the start of two consecutive rows of pixels in the image. Note that row stride is undefined for some formats such as @B_android#graphics#ImageFormat#RAW_PRIVATE_E@, and calling getRowStride on images of these formats will cause an UnsupportedOperationException being thrown. For formats where row stride is well defined, the row stride is always greater than 0.", "history": "Added in API level 19", "FullName": "public abstract int getRowStride ()"}}, "Inheritance": [], "ClassName": "android.media.Image.Plane", "ClassDesc": "A single color plane of image data. The number and meaning of the planes in an Image are determined by the format of the Image. Once the Image has been closed, any access to the the plane's ByteBuffer will fail."}