{"Functions": {"getPositionForSection(int)": {"Returns": [["int", "the starting position of that section within the adapter, constrained to fall within the adapter bounds"]], "Parameters": [["int", "int: the index of the section within the array of section objects"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Given the index of a section within the array of section objects, returns the starting position of that section within the adapter. If the section's starting position is outside of the adapter bounds, the position must be clipped to fall within the size of the adapter.", "history": "Added in API level 3", "FullName": "public abstract int getPositionForSection (int sectionIndex)"}, "getSectionForPosition(int)": {"Returns": [["int", "the index of the corresponding section within the array of section objects, constrained to fall within the array bounds"]], "Parameters": [["int", "int: the position within the adapter for which to return the corresponding section index"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Given a position within the adapter, returns the index of the corresponding section within the array of section objects. If the section index is outside of the section array bounds, the index must be clipped to fall within the size of the section array. For example, consider an indexer where the section at array index 0 starts at adapter position 100. Calling this method with position 10, which is before the first section, must return index 0.", "history": "Added in API level 3", "FullName": "public abstract int getSectionForPosition (int position)"}, "getSections()": {"Returns": [["@B_java#lang#Object_E@", "the array of section objects"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns an array of objects representing sections of the list. The returned array and its contents should be non-null. The list view will call toString() on the objects to get the preview text to display while scrolling. For example, an adapter may return an array of Strings representing letters of the alphabet. Or, it may return an array of objects whose toString() methods return their section titles.", "history": "Added in API level 3", "FullName": "public abstract Object[] getSections ()"}}, "Inheritance": [], "ClassName": "android.widget.SectionIndexer", "ClassDesc": "Interface that may implemented on @B_android#widget#Adapter_E@s to enable fast scrolling between sections of an @B_android#widget#AbsListView_E@. A section is a group of list items that have something in common. For example, they may begin with the same letter or they may be songs from the same artist. @B_android#widget#ExpandableListAdapter_E@s that consider groups and sections as synonymous should account for collapsed groups and return an appropriate section/position."}