{"Functions": {"newSpellCheckerSession(android.os.Bundle,java.util.Locale,android.view.textservice.SpellCheckerSession.SpellCheckerSessionListener,boolean)": {"Returns": [["@B_android#view#textservice#SpellCheckerSession_E@", "the spell checker session of the spell checker"]], "Parameters": [["@B_android#os#Bundle_E@", "Bundle no parameter comment"], ["@B_java#util#Locale_E@", "Locale: the locale for the spell checker. If locale is null and referToSpellCheckerLanguageSettings is true, the locale specified in Settings will be returned. If locale is not null and referToSpellCheckerLanguageSettings is true, the locale specified in Settings will be returned only when it is same as locale. Exceptionally, when referToSpellCheckerLanguageSettings is true and locale is only language (e.g. \"en\"), the specified locale in Settings (e.g. \"en_US\") will be selected."], ["@B_android#view#textservice#SpellCheckerSession#SpellCheckerSessionListener_E@", "SpellCheckerSession.SpellCheckerSessionListener: a spell checker session lister for getting results from a spell checker."], ["boolean", "boolean: if true, the session for one of enabled languages in settings will be returned."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Get a spell checker session for the specified spell checker", "history": "Added in API level 14", "FullName": "public SpellCheckerSession newSpellCheckerSession (Bundle bundle, Locale locale, SpellCheckerSession.SpellCheckerSessionListener listener, boolean referToSpellCheckerLanguageSettings)"}}, "Inheritance": [], "ClassName": "android.view.textservice.TextServicesManager", "ClassDesc": "System API to the overall text services, which arbitrates interaction between applications and text services. The user can change the current text services in Settings. And also applications can specify the target text services. There are three primary parties involved in the text services framework (TSF) architecture: The A Multiple The @B_android#view#textservice#SpellCheckerSession_E@"}