{"Functions": {"onRestore(android.app.backup.BackupDataInput,int,android.os.ParcelFileDescriptor)": {"Returns": [], "Parameters": [["@B_android#app#backup#BackupDataInput_E@", "BackupDataInput: A structured wrapper around an open, read-only file descriptor pointing to a full snapshot of the application's data. The application should consume every entity represented in this data stream."], ["int", "int: The value of the android:versionCode manifest attribute, from the application that backed up this particular data set. This makes it possible for an application's agent to distinguish among any possible older data versions when asked to perform the restore operation."], ["@B_android#os#ParcelFileDescriptor_E@", "ParcelFileDescriptor: An open, read/write ParcelFileDescriptor pointing to an empty file. The application should record the final backup state here after restoring its data from the data stream. When a full-backup dataset is being restored, this will be null."]], "Throws": [["@B_java#io#IOException_E@", ""]], "SeeAlso": [], "Permissions": [], "Description": "Run the restore process on each of the configured handlers.", "history": "Added in API level 8", "FullName": "public void onRestore (BackupDataInput data, int appVersionCode, ParcelFileDescriptor newState)"}, "addHelper(java.lang.String,android.app.backup.BackupHelper)": {"Returns": [], "Parameters": [["@B_java#lang#String_E@", "String: A string used to disambiguate the various helpers within this agent"], ["@B_android#app#backup#BackupHelper_E@", "BackupHelper: A backup/restore helper object to be invoked during backup and restore operations."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Add a helper for a given data subset to the agent's configuration. Each helper must have a prefix string that is unique within this backup agent's set of helpers.", "history": "Added in API level 8", "FullName": "public void addHelper (String keyPrefix, BackupHelper helper)"}, "onBackup(android.os.ParcelFileDescriptor,android.app.backup.BackupDataOutput,android.os.ParcelFileDescriptor)": {"Returns": [], "Parameters": [["@B_android#os#ParcelFileDescriptor_E@", "ParcelFileDescriptor: An open, read-only ParcelFileDescriptor pointing to the last backup state provided by the application. May be null, in which case no prior state is being provided and the application should perform a full backup."], ["@B_android#app#backup#BackupDataOutput_E@", "BackupDataOutput: A structured wrapper around an open, read/write file descriptor pointing to the backup data destination. Typically the application will use backup helper classes to write to this file."], ["@B_android#os#ParcelFileDescriptor_E@", "ParcelFileDescriptor: An open, read/write ParcelFileDescriptor pointing to an empty file. The application should record the final backup state here after writing the requested data to the data output stream."]], "Throws": [["@B_java#io#IOException_E@", ""]], "SeeAlso": [], "Permissions": [], "Description": "Run the backup process on each of the configured handlers.", "history": "Added in API level 8", "FullName": "public void onBackup (ParcelFileDescriptor oldState, BackupDataOutput data, ParcelFileDescriptor newState)"}, "BackupAgentHelper()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "", "history": "added in API level 8", "FullName": "public BackupAgentHelper ()"}}, "Inheritance": ["@B_android#content#Context_E@", "@B_android#content#ContextWrapper_E@", "@B_android#app#backup#BackupAgent_E@"], "ClassName": "android.app.backup.BackupAgentHelper", "ClassDesc": "A convenient @B_android#app#backup#BackupAgent_E@ wrapper class that automatically manages heterogeneous data sets within the backup data, each identified by a unique key prefix. When processing a backup or restore operation, the BackupAgentHelper dispatches to one or more installed @B_android#app#backup#BackupHelper_E@ objects, each of which is responsible for a defined subset of the data being processed. An application will typically extend this class in its own backup agent. Then, within the agent's @B_android#app#backup#BackupAgent#onCreate_E@ method, it will call @B_android#app#backup#BackupAgentHelper#addHelper_E@ one or more times to install the handlers for each kind of data it wishes to manage within its backups. The Android framework currently provides two predefined @B_android#app#backup#BackupHelper_E@ classes: @B_android#app#backup#FileBackupHelper_E@ - Manages the backup and restore of entire files within an application's data directory hierarchy. @B_android#app#backup#SharedPreferencesBackupHelper_E@ - Manages the backup and restore of an application's @B_android#content#SharedPreferences_E@ data. An application can also implement its own helper classes to work within the @B_android#app#backup#BackupAgentHelper_E@ framework. See the @B_android#app#backup#BackupHelper_E@ interface documentation for details."}