{"Functions": {"getSessionStartTime()": {"Returns": [["@B_java#util#Date_E@", "no returns description in source"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "The start time indicating when this service will be available.", "history": "Added in API level 28", "FullName": "public Date getSessionStartTime ()"}, "getNameForLocale(java.util.Locale)": {"Returns": [["@B_java#lang#CharSequence_E@", "The @B_java#lang#CharSequence_E@ providing the name of the service in the given @B_java#util#Locale_E@ This value will never be null."]], "Parameters": [["@B_java#util#Locale_E@", "Locale: The @B_java#util#Locale_E@ in which you want the name of the service. This must be a value from the set returned by @B_android#telephony#mbms#ServiceInfo#getNamedContentLocales_E@ -- an @B_java#util#NoSuchElementException_E@ may be thrown otherwise. This value must never be null."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Get the user-displayable name for this cell-broadcast service corresponding to the provided @B_java#util#Locale_E@.", "history": "Added in API level 28", "FullName": "public CharSequence getNameForLocale (Locale locale)"}, "getNamedContentLocales()": {"Returns": [["@B_java#util#Set_E@", "An unmodifiable set of @B_java#util#Locale_E@ objects corresponding to a user-displayable content name in that locale. This value will never be null."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Return an unmodifiable set of the current @B_java#util#Locale_E@s that have a user-displayable name associated with them. The user-displayable name associated with any @B_java#util#Locale_E@ in this set can be retrieved with @B_android#telephony#mbms#ServiceInfo#getNameForLocale_E@.", "history": "Added in API level 28", "FullName": "public Set<Locale> getNamedContentLocales ()"}, "getServiceId()": {"Returns": [["@B_java#lang#String_E@", "no returns description in source"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "The carrier's identifier for the service.", "history": "Added in API level 28", "FullName": "public String getServiceId ()"}, "equals(java.lang.Object)": {"Returns": [["boolean", "true if this object is the same as the obj argument; false otherwise."]], "Parameters": [["@B_java#lang#Object_E@", "Object: the reference object with which to compare."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Indicates whether some other object is \"equal to\" this one. The equals method implements an equivalence relation on non-null object references: It is x, x.equals(x) should return true. It is x and y, x.equals(y) should return true if and only if y.equals(x) returns true. It is x, y, and z, if x.equals(y) returns true and y.equals(z) returns true, then x.equals(z) should return true. It is x and y, multiple invocations of x.equals(y) consistently return true or consistently return false, provided no information used in equals comparisons on the objects is modified. For any non-null reference value x, x.equals(null) should return false. The equals method for class Object implements the most discriminating possible equivalence relation on objects; that is, for any non-null reference values x and y, this method returns true if and only if x and y refer to the same object (x == y has the value true). Note that it is generally necessary to override the hashCode method whenever this method is overridden, so as to maintain the general contract for the hashCode method, which states that equal objects must have equal hash codes.", "history": "Added in API level 28", "FullName": "public boolean equals (Object o)"}, "getServiceClassName()": {"Returns": [["@B_java#lang#String_E@", "no returns description in source"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "The class name for this service - used to categorize and filter", "history": "Added in API level 28", "FullName": "public String getServiceClassName ()"}, "getLocales()": {"Returns": [["@B_java#util#List_E@", "no returns description in source"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "The languages available for this service content", "history": "Added in API level 28", "FullName": "public List<Locale> getLocales ()"}, "getSessionEndTime()": {"Returns": [["@B_java#util#Date_E@", "no returns description in source"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "The end time indicating when this session stops being available.", "history": "Added in API level 28", "FullName": "public Date getSessionEndTime ()"}, "hashCode()": {"Returns": [["int", "a hash code value for this object."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a hash code value for the object. This method is supported for the benefit of hash tables such as those provided by @B_java#util#HashMap_E@. The general contract of hashCode is: Whenever it is invoked on the same object more than once during an execution of a Java application, the hashCode method must consistently return the same integer, provided no information used in equals comparisons on the object is modified. This integer need not remain consistent from one execution of an application to another execution of the same application. If two objects are equal according to the equals(Object) method, then calling the hashCode method on each of the two objects must produce the same integer result. It is not required that if two objects are unequal according to the @B_java#lang#Object#equals_E@ method, then calling the hashCode method on each of the two objects must produce distinct integer results. However, the programmer should be aware that producing distinct integer results for unequal objects may improve the performance of hash tables. As much as is reasonably practical, the hashCode method defined by class Object does return distinct integers for distinct objects. (This is typically implemented by converting the internal address of the object into an integer, but this implementation technique is not required by the Java™ programming language.)", "history": "Added in API level 28", "FullName": "public int hashCode ()"}}, "Inheritance": [], "ClassName": "android.telephony.mbms.ServiceInfo", "ClassDesc": "Describes a cell-broadcast service. This class should not be instantiated directly -- use @B_android#telephony#mbms#StreamingServiceInfo_E@ or @B_android#telephony#mbms#FileServiceInfo_E@"}