{"Functions": {"isAtLeastNMR1()": {"Returns": [["boolean", "true if N MR1 APIs are available for use"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Android N MR1 is a finalized release and this method is no longer necessary. It will be removed in a future release of the Support Library. Instead, use Build.SDK_INT >= Build.VERSION_CODES#N_MR1. Checks if the device is running on the Android N MR1 release or newer.", "history": "added in version 24.2.0", "FullName": "boolean isAtLeastNMR1 ()"}, "isAtLeastP()": {"Returns": [["boolean", "true if P APIs are available for use, false otherwise"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Checks if the device is running on a pre-release version of Android P or newer. false on devices running release versions of Android. When Android P is finalized for release, this method will be deprecated and all calls should be replaced with Build.SDK_INT >= Build.VERSION_CODES#P.", "history": "added in version 26.0.0-beta1", "FullName": "boolean isAtLeastP ()"}, "isAtLeastO()": {"Returns": [["boolean", "true if O APIs are available for use, false otherwise"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Android O is a finalized release and this method is no longer necessary. It will be removed in a future release of the Support Library. Instead use Build.SDK_INT >= Build.VERSION_CODES#O. Checks if the device is running on a pre-release version of Android O or newer.", "history": "added in version 25.1.0", "FullName": "boolean isAtLeastO ()"}, "isAtLeastOMR1()": {"Returns": [["boolean", "true if O MR1 APIs are available for use, false otherwise"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Checks if the device is running on a pre-release version of Android O MR1 or newer. false on devices running release versions of Android. When Android O MR1 is finalized for release, this method will be deprecated and all calls should be replaced with Build.SDK_INT >= Build.VERSION_CODES#O_MR1.", "history": "added in version 26.0.0-beta1", "FullName": "boolean isAtLeastOMR1 ()"}, "isAtLeastN()": {"Returns": [["boolean", "true if N APIs are available for use"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Android N is a finalized release and this method is no longer necessary. It will be removed in a future release of the Support Library. Instead, use Build.SDK_INT >= Build.VERSION_CODES#N. Checks if the device is running on the Android N release or newer.", "history": "added in version 24.0.0", "FullName": "boolean isAtLeastN ()"}}, "Inheritance": ["java.lang.Object"], "ClassName": "android.support.v4.os.BuildCompat", "ClassDesc": "This class contains additional platform version checking methods for targeting pre-release versions of Android."}