{"Functions": {"enter()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Enters this scene, which entails changing all values that are specified by this scene. These may be values associated with a layout view group or layout resource file which will now be added to the scene root, or it may be values changed by an @B_android#support#transition#Scene#setEnterAction_E@ enter action}, or a combination of the these. No transition will be run when the scene is entered. To get transition behavior in scene changes, use one of the methods in @B_android#support#transition#TransitionManager_E@ instead.", "history": "added in version 24.2.0", "FullName": "void enter ()"}, "setExitAction(java.lang.Runnable)": {"Returns": [], "Parameters": [["@B_java#lang#Runnable_E@", "Runnable no parameter comment"]], "Throws": [], "SeeAlso": ["@B_android#support#transition#Scene#setEnterAction_E@", "_E@"], "Permissions": [], "Description": "Scenes that are not defined with layout resources or hierarchies, or which need to perform additional steps after those hierarchies are changed to, should set an enter action, and possibly an exit action as well. An exit action will cause Scene to call back into application code to do anything the application needs to do after applicable transitions have captured pre-change values, but before any other scene changes have been applied, such as the new layout (if any) being added to the view hierarchy. After this method is called, the next scene will be entered, including a call to @B_android#support#transition#Scene#setEnterAction_E@ if an enter action is set.", "history": "added in version 24.2.0", "FullName": "void setExitAction (Runnable action)"}, "setEnterAction(java.lang.Runnable)": {"Returns": [], "Parameters": [["@B_java#lang#Runnable_E@", "Runnable: The runnable whose @B_java#lang#Runnable#run_E@ method will be called when this scene is entered"]], "Throws": [], "SeeAlso": ["@B_android#support#transition#Scene#setExitAction_E@", "_E@"], "Permissions": [], "Description": "Scenes that are not defined with layout resources or hierarchies, or which need to perform additional steps after those hierarchies are changed to, should set an enter action, and possibly an exit action as well. An enter action will cause Scene to call back into application code to do anything else the application needs after transitions have captured pre-change values and after any other scene changes have been applied, such as the layout (if any) being added to the view hierarchy. After this method is called, Transitions will be played.", "history": "added in version 24.2.0", "FullName": "void setEnterAction (Runnable action)"}, "Scene(android.view.ViewGroup)": {"Returns": [], "Parameters": [["@B_android#view#ViewGroup_E@", "ViewGroup: The root of the hierarchy in which scene changes and transitions will take place."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Constructs a Scene with no information about how values will change when this scene is applied. This constructor might be used when a Scene is created with the intention of being dynamically configured, through setting @B_android#support#transition#Scene#setEnterAction_E@ and possibly @B_android#support#transition#Scene#setExitAction_E@.", "history": "added in version 24.2.0", "FullName": "Scene (ViewGroup sceneRoot)"}, "Scene(android.view.ViewGroup, android.view.View)": {"Returns": [], "Parameters": [["@B_android#view#ViewGroup_E@", "ViewGroup: The root of the hierarchy in which scene changes and transitions will take place."], ["@B_android#view#View_E@", "View: The view hierarchy of this scene, added as a child of sceneRoot when this scene is entered."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Constructs a Scene which, when entered, will remove any children from the sceneRoot container and add the layout object as a new child of that container.", "history": "added in version 24.2.0", "FullName": "Scene (ViewGroup sceneRoot, View layout)"}, "exit()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Exits this scene, if it is the current scene on the scene's @B_android#support#transition#Scene#getSceneRoot_E@. The current scene is set when @B_android#support#transition#Scene#enter_E@ a scene. Exiting a scene runs the @B_android#support#transition#Scene#setExitAction_E@ if there is one.", "history": "added in version 24.2.0", "FullName": "void exit ()"}, "getSceneRoot()": {"Returns": [["@B_android#view#ViewGroup_E@", "The root of the view hierarchy affected by this scene."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Gets the root of the scene, which is the root of the view hierarchy affected by changes due to this scene, and which will be animated when this scene is entered.", "history": "added in version 24.2.0", "FullName": "ViewGroup getSceneRoot ()"}}, "Inheritance": ["java.lang.Object"], "ClassName": "android.support.transition.Scene", "ClassDesc": "A scene represents the collection of values that various properties in the View hierarchy will have when the scene is applied. A Scene can be configured to automatically run a Transition when it is applied, which will animate the various property changes that take place during the scene change."}