{"Functions": {"flattenToString()": {"Returns": [["@B_java#lang#String_E@", "a string containing the rating information, which can later be stored in the database."]], "Parameters": [], "Throws": [], "SeeAlso": ["@B_android#media#tv#TvContentRating#unflattenFromString_E@"], "Permissions": [], "Description": "Returns a string that unambiguously describes the rating information contained in a TvContentRating object. One can later recover the object from this string through @B_android#media#tv#TvContentRating#unflattenFromString_E@.", "history": "Added in API level 21", "FullName": "public String flattenToString ()"}, "unflattenFromString(java.lang.String)": {"Returns": [["@B_android#media#tv#TvContentRating_E@", "the TvContentRating object containing the domain, rating system, rating and sub-ratings information encoded in ratingString."]], "Parameters": [["@B_java#lang#String_E@", "String: The string returned by @B_android#media#tv#TvContentRating#flattenToString_E@."]], "Throws": [], "SeeAlso": ["@B_android#media#tv#TvContentRating#flattenToString_E@"], "Permissions": [], "Description": "Recovers a TvContentRating object from the string that was previously created from @B_android#media#tv#TvContentRating#flattenToString_E@.", "history": "Added in API level 21", "FullName": "public static TvContentRating unflattenFromString (String ratingString)"}, "getMainRating()": {"Returns": [["@B_java#lang#String_E@", "no returns description in source"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the main rating of this TvContentRating object.", "history": "Added in API level 21", "FullName": "public String getMainRating ()"}, "equals(java.lang.Object)": {"Returns": [["boolean", "true if this object is the same as the obj argument; false otherwise."]], "Parameters": [["@B_java#lang#Object_E@", "Object: the reference object with which to compare."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Indicates whether some other object is \"equal to\" this one. The equals method implements an equivalence relation on non-null object references: It is x, x.equals(x) should return true. It is x and y, x.equals(y) should return true if and only if y.equals(x) returns true. It is x, y, and z, if x.equals(y) returns true and y.equals(z) returns true, then x.equals(z) should return true. It is x and y, multiple invocations of x.equals(y) consistently return true or consistently return false, provided no information used in equals comparisons on the objects is modified. For any non-null reference value x, x.equals(null) should return false. The equals method for class Object implements the most discriminating possible equivalence relation on objects; that is, for any non-null reference values x and y, this method returns true if and only if x and y refer to the same object (x == y has the value true). Note that it is generally necessary to override the hashCode method whenever this method is overridden, so as to maintain the general contract for the hashCode method, which states that equal objects must have equal hash codes.", "history": "Added in API level 21", "FullName": "public boolean equals (Object obj)"}, "getRatingSystem()": {"Returns": [["@B_java#lang#String_E@", "no returns description in source"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the rating system of this TvContentRating object.", "history": "Added in API level 21", "FullName": "public String getRatingSystem ()"}, "getDomain()": {"Returns": [["@B_java#lang#String_E@", "no returns description in source"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the domain of this TvContentRating object.", "history": "Added in API level 21", "FullName": "public String getDomain ()"}, "getSubRatings()": {"Returns": [["@B_java#util#List_E@", "no returns description in source"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the unmodifiable sub-rating string @B_java#util#List_E@ of this TvContentRating object.", "history": "Added in API level 21", "FullName": "public List<String> getSubRatings ()"}, "contains(android.media.tv.TvContentRating)": {"Returns": [["boolean", "true if this object contains rating, false otherwise."]], "Parameters": [["@B_android#media#tv#TvContentRating_E@", "TvContentRating: The @B_android#media#tv#TvContentRating_E@ to check. This value must never be null."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns true if this rating has the same main rating as the specified rating and when this rating's sub-ratings contain the other's. For example, a TvContentRating object that represents TV-PG with S(Sexual content) and V(Violence) contains TV-PG, TV-PG/S, TV-PG/V and itself.", "history": "Added in API level 24", "FullName": "public boolean contains (TvContentRating rating)"}, "createRating(java.lang.String,java.lang.String,java.lang.String,java.lang.String...)": {"Returns": [["@B_android#media#tv#TvContentRating_E@", "A TvContentRating object."]], "Parameters": [["@B_java#lang#String_E@", "String: The domain string. For example, \"com.android.tv\"."], ["@B_java#lang#String_E@", "String: The rating system string. For example, \"US_TV\"."], ["@B_java#lang#String_E@", "String: The content rating string. For example, \"US_TV_PG\"."], ["@B_java#lang#String_E@", "String: The sub-rating strings. For example, \"US_TV_D\" and \"US_TV_L\"."]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "If domain, ratingSystem or rating is null."]], "SeeAlso": [], "Permissions": [], "Description": "Creates a TvContentRating object with predefined content rating strings.", "history": "Added in API level 21", "FullName": "public static TvContentRating createRating (String domain, String ratingSystem, String rating, String... subRatings)"}, "hashCode()": {"Returns": [["int", "a hash code value for this object."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a hash code value for the object. This method is supported for the benefit of hash tables such as those provided by @B_java#util#HashMap_E@. The general contract of hashCode is: Whenever it is invoked on the same object more than once during an execution of a Java application, the hashCode method must consistently return the same integer, provided no information used in equals comparisons on the object is modified. This integer need not remain consistent from one execution of an application to another execution of the same application. If two objects are equal according to the equals(Object) method, then calling the hashCode method on each of the two objects must produce the same integer result. It is not required that if two objects are unequal according to the @B_java#lang#Object#equals_E@ method, then calling the hashCode method on each of the two objects must produce distinct integer results. However, the programmer should be aware that producing distinct integer results for unequal objects may improve the performance of hash tables. As much as is reasonably practical, the hashCode method defined by class Object does return distinct integers for distinct objects. (This is typically implemented by converting the internal address of the object into an integer, but this implementation technique is not required by the Java™ programming language.)", "history": "Added in API level 21", "FullName": "public int hashCode ()"}}, "Inheritance": [], "ClassName": "android.media.tv.TvContentRating", "ClassDesc": "A class representing a TV content rating. When a TV input service inserts the content rating information on a program into the database, this class can be used to generate the formatted string for @B_android#media#tv#TvContract#Programs#COLUMN_CONTENT_RATING_E@. To create a TvContentRating object, use the @B_android#media#tv#TvContentRating#createRating_E@ method with valid rating system string constants. It is possible for an application to define its own content rating system by supplying a content rating system definition XML resource (see example below) and declaring a broadcast receiver that filters @B_android#media#tv#TvInputManager#ACTION_QUERY_CONTENT_RATING_SYSTEMS_E@ in its manifest. TvContentRating objects. For example, to create an object that represents TV-PG rating with suggestive dialogue and coarse language from the TV Parental Guidelines in the United States, one can use the following code snippet:"}