{"Functions": {"query(android.content.ContentResolver,java.lang.String[],long,long)": {"Returns": [["@B_android#database#Cursor_E@", "A Cursor containing all instances in the given range"]], "Parameters": [["@B_android#content#ContentResolver_E@", "ContentResolver: The ContentResolver to use for the query"], ["@B_java#lang#String_E@", "String: The columns to return"], ["long", "long: The start of the time range to query in UTC millis since epoch"], ["long", "long: The end of the time range to query in UTC millis since epoch"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Performs a query to return all visible instances in the given range. This is a blocking function and should not be done on the UI thread. This will cause an expansion of recurring events to fill this time range if they are not already expanded and will slow down for larger time ranges with many recurring events.", "history": "Added in API level 14", "FullName": "public static Cursor query (ContentResolver cr, String[] projection, long begin, long end)"}, "query(android.content.ContentResolver,java.lang.String[],long,long,java.lang.String)": {"Returns": [["@B_android#database#Cursor_E@", "A Cursor of instances matching the search terms in the given time range"]], "Parameters": [["@B_android#content#ContentResolver_E@", "ContentResolver: The ContentResolver to use for the query"], ["@B_java#lang#String_E@", "String: The columns to return"], ["long", "long: The start of the time range to query in UTC millis since epoch"], ["long", "long: The end of the time range to query in UTC millis since epoch"], ["@B_java#lang#String_E@", "String: A string of space separated search terms. Segments enclosed by double quotes will be treated as a single term."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Performs a query to return all visible instances in the given range that match the given query. This is a blocking function and should not be done on the UI thread. This will cause an expansion of recurring events to fill this time range if they are not already expanded and will slow down for larger time ranges with many recurring events.", "history": "Added in API level 14", "FullName": "public static Cursor query (ContentResolver cr, String[] projection, long begin, long end, String searchQuery)"}}, "Inheritance": [], "ClassName": "android.provider.CalendarContract.Instances", "ClassDesc": "Fields and helpers for interacting with Instances. An instance is a single occurrence of an event including time zone specific start and end days and minutes. The instances table is not writable and only provides a way to query event occurrences."}