{"Functions": {"setStartVelocity(float)": {"Returns": [["@B_android#support#animation#FlingAnimation_E@", "the Animation whose start velocity is being set"]], "Parameters": [["float", "float: start velocity of the animation in pixel/second"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Start velocity of the animation. Default velocity is 0. Unit: pixel/second A @B_android#support#animation#FlingAnimation#setStartVelocity_E@, the start velocity defaults to 0. In that case, the fling animation will consider itself done in the next frame. Note when using a fixed value as the start velocity (as opposed to getting the velocity through touch events), it is recommended to define such a value in dp/second and convert it to pixel/second based on the density of the screen to achieve a consistent look across different screens. To convert from dp/second to pixel/second:", "history": "added in version 25.4.0", "FullName": "FlingAnimation setStartVelocity (float startVelocity)"}, "setMaxValue(float)": {"Returns": [["@B_android#support#animation#FlingAnimation_E@", "the Animation whose max value is being set"]], "Parameters": [["float", "float: maximum value of the property to be animated"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Sets the max value of the animation. When a fling animation reaches the max value, the animation will end immediately. Animations will not animate beyond the max value.", "history": "added in version 25.4.0", "FullName": "FlingAnimation setMaxValue (float maxValue)"}, "getFriction()": {"Returns": [["float", "friction being used in the animation"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the friction being set on the animation via @B_android#support#animation#FlingAnimation#setFriction_E@. If the friction has not been set, the default friction of 1 will be returned.", "history": "added in version 25.4.0", "FullName": "float getFriction ()"}, "setMinValue(float)": {"Returns": [["@B_android#support#animation#FlingAnimation_E@", "the Animation whose min value is being set"]], "Parameters": [["float", "float: minimum value of the property to be animated"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Sets the min value of the animation. When a fling animation reaches the min value, the animation will end immediately. Animations will not animate beyond the min value.", "history": "added in version 25.4.0", "FullName": "FlingAnimation setMinValue (float minValue)"}, "setFriction(float)": {"Returns": [["@B_android#support#animation#FlingAnimation_E@", "the animation whose friction will be scaled"]], "Parameters": [["float", "float: the friction used in the animationValue is 0.0 or greater."]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if the input friction is not positive"]], "SeeAlso": [], "Permissions": [], "Description": "Sets the friction for the fling animation. The greater the friction is, the sooner the animation will slow down. When not set, the friction defaults to 1.", "history": "added in version 25.4.0", "FullName": "FlingAnimation setFriction (float friction)"}}, "Inheritance": ["java.lang.Object", "@B_android#support#animation#DynamicAnimation_E@"], "ClassName": "android.support.animation.FlingAnimation", "ClassDesc": "Fling animation is an animation that continues an initial momentum (most often from gesture velocity) and gradually slows down. The fling animation will come to a stop when the velocity of the animation is below the threshold derived from @B_android#support#animation#DynamicAnimation#setMinimumVisibleChange_E@, or when the value of the animation has gone beyond the min or max value defined via @B_android#support#animation#DynamicAnimation#setMinValue_E@ or @B_android#support#animation#DynamicAnimation#setMaxValue_E@. It is recommended to restrict the fling animation with min and/or max value, such that the animation can end when it goes beyond screen bounds, thus preserving CPU cycles and resources. For example, you can create a fling animation that animates the translationX of a view:"}