{"Functions": {"surfaceRedrawNeeded(android.view.SurfaceHolder)": {"Returns": [], "Parameters": [["@B_android#view#SurfaceHolder_E@", "SurfaceHolder: The SurfaceHolder whose surface has changed."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Called when the application needs to redraw the content of its surface, after it is resized or for some other reason. By not returning from here until the redraw is complete, you can ensure that the user will not see your surface in a bad state (at its new size before it has been correctly drawn that way). This will typically be preceeded by a call to @B_android#view#SurfaceHolder#Callback#surfaceChanged_E@. As of O, @B_android#view#SurfaceHolder#Callback2#surfaceRedrawNeededAsync_E@ may be implemented to provide a non-blocking implementation. If @B_android#view#SurfaceHolder#Callback2#surfaceRedrawNeededAsync_E@ is not implemented, then this will be called instead.", "history": "Added in API level 9", "FullName": "public abstract void surfaceRedrawNeeded (SurfaceHolder holder)"}, "surfaceRedrawNeededAsync(android.view.SurfaceHolder,java.lang.Runnable)": {"Returns": [], "Parameters": [["@B_android#view#SurfaceHolder_E@", "SurfaceHolder: The SurfaceHolder which needs redrawing."], ["@B_java#lang#Runnable_E@", "Runnable: A runnable to signal completion. This may be invoked from any thread."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "An alternative to surfaceRedrawNeeded where it is not required to block until the redraw is complete. You should initiate the redraw, and return, later invoking drawingFinished when your redraw is complete. This can be useful to avoid blocking your main application thread on rendering. As of O, if this is implemented @B_android#view#SurfaceHolder#Callback2#surfaceRedrawNeeded_E@ will not be called. However it is still recommended to implement @B_android#view#SurfaceHolder#Callback2#surfaceRedrawNeeded_E@ for compatibility with older versions of the platform.", "history": "Added in API level 26", "FullName": "public void surfaceRedrawNeededAsync (SurfaceHolder holder, Runnable drawingFinished)"}}, "Inheritance": [], "ClassName": "android.view.SurfaceHolder.Callback2", "ClassDesc": "Additional callbacks that can be received for @B_android#view#SurfaceHolder#Callback_E@."}