{"Functions": {"performBackup(android.os.ParcelFileDescriptor,android.app.backup.BackupDataOutput,android.os.ParcelFileDescriptor)": {"Returns": [], "Parameters": [["@B_android#os#ParcelFileDescriptor_E@", "ParcelFileDescriptor: An open, read-only @B_android#os#ParcelFileDescriptor_E@ pointing to the last backup state provided by the application. May be null, in which case no prior state is being provided and the application should perform a full backup."], ["@B_android#app#backup#BackupDataOutput_E@", "BackupDataOutput: An open, read/write @B_android#app#backup#BackupDataOutput_E@ pointing to the backup data destination. Typically the application will use backup helper classes to write to this file."], ["@B_android#os#ParcelFileDescriptor_E@", "ParcelFileDescriptor: An open, read/write @B_android#os#ParcelFileDescriptor_E@ pointing to an empty file. The application should record the final backup state here after writing the requested data to the data output stream."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Backs up the configured @B_android#content#SharedPreferences_E@ groups.", "history": "Added in API level 8", "FullName": "public void performBackup (ParcelFileDescriptor oldState, BackupDataOutput data, ParcelFileDescriptor newState)"}, "SharedPreferencesBackupHelper(android.content.Context,java.lang.String...)": {"Returns": [], "Parameters": [["@B_android#content#Context_E@", "Context: The application @B_android#content#Context_E@"], ["@B_java#lang#String_E@", "String: The names of each @B_android#content#SharedPreferences_E@ file to back up"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Construct a helper for backing up and restoring the @B_android#content#SharedPreferences_E@ under the given names.", "history": "Added in API level 8", "FullName": "public SharedPreferencesBackupHelper (Context context, String... prefGroups)"}, "restoreEntity(android.app.backup.BackupDataInputStream)": {"Returns": [], "Parameters": [["@B_android#app#backup#BackupDataInputStream_E@", "BackupDataInputStream: An open @B_android#app#backup#BackupDataInputStream_E@ from which the backup data can be read."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Restores one entity from the restore data stream to its proper shared preferences file store.", "history": "Added in API level 8", "FullName": "public void restoreEntity (BackupDataInputStream data)"}, "finalize()": {"Returns": [], "Parameters": [], "Throws": [["@B_java#lang#Throwable_E@", ""]], "SeeAlso": [], "Permissions": [], "Description": "Called by the garbage collector on an object when garbage collection determines that there are no more references to the object. A subclass overrides the finalize method to dispose of system resources or to perform other cleanup. The general contract of finalize is that it is invoked if and when the Java™ virtual machine has determined that there is no longer any means by which this object can be accessed by any thread that has not yet died, except as a result of an action taken by the finalization of some other object or class which is ready to be finalized. The finalize method may take any action, including making this object available again to other threads; the usual purpose of finalize, however, is to perform cleanup actions before the object is irrevocably discarded. For example, the finalize method for an object that represents an input/output connection might perform explicit I/O transactions to break the connection before the object is permanently discarded. The finalize method of class Object performs no special action; it simply returns normally. Subclasses of Object may override this definition. The Java programming language does not guarantee which thread will invoke the finalize method for any given object. It is guaranteed, however, that the thread that invokes finalize will not be holding any user-visible synchronization locks when finalize is invoked. If an uncaught exception is thrown by the finalize method, the exception is ignored and finalization of that object terminates. After the finalize method has been invoked for an object, no further action is taken until the Java virtual machine has again determined that there is no longer any means by which this object can be accessed by any thread that has not yet died, including possible actions by other objects or classes which are ready to be finalized, at which point the object may be discarded. The finalize method is never invoked more than once by a Java virtual machine for any given object. Any exception thrown by the finalize method causes the finalization of this object to be halted, but is otherwise ignored.", "history": "added in API level 8", "FullName": "protected void finalize ()"}}, "Inheritance": [], "ClassName": "android.app.backup.SharedPreferencesBackupHelper", "ClassDesc": "A helper class that can be used in conjunction with @B_android#app#backup#BackupAgentHelper_E@ to manage the backup of @B_android#content#SharedPreferences_E@. Whenever a backup is performed, it will back up all named shared preferences that have changed since the last backup operation. To use this class, the application's backup agent class should extend @B_android#app#backup#BackupAgentHelper_E@. Then, in the agent's @B_android#app#backup#BackupAgent#onCreate_E@ method, an instance of this class should be allocated and installed as a backup/restore handler within the BackupAgentHelper framework. For example, an agent supporting backup and restore for an application with two groups of @B_android#content#SharedPreferences_E@ data might look something like this: No further implementation is needed; the @B_android#app#backup#BackupAgentHelper_E@ mechanism automatically dispatches the @B_android#app#backup#BackupAgent#onBackup_E@ and @B_android#app#backup#BackupAgent#onRestore_E@ callbacks to the SharedPreferencesBackupHelper as appropriate."}