{"Functions": {"SidePropagation()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "", "history": "added in version 26.0.0-beta1", "FullName": "SidePropagation ()"}, "setPropagationSpeed(float)": {"Returns": [], "Parameters": [["float", "float: The speed at which propagation occurs, relative to the duration of the transition. A speed of 4 means it works 4 times as fast as the duration of the transition. May not be 0."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Sets the speed at which transition propagation happens, relative to the duration of the Transition. A propagationSpeed of 1 means that a View centered at the side set in @B_android#support#transition#SidePropagation#setSide_E@ and View centered at the opposite edge will have a difference in start delay of approximately the duration of the Transition. A speed of 2 means the start delay difference will be approximately half of the duration of the transition. A value of 0 is illegal, but negative values will invert the propagation.", "history": "added in version 26.0.0-beta1", "FullName": "void setPropagationSpeed (float propagationSpeed)"}, "setSide(int)": {"Returns": [], "Parameters": [["int", "int: The side that is used to calculate the transition propagation. Must be one of @B_android#view#Gravity#LEFT_E@, @B_android#view#Gravity#TOP_E@, @B_android#view#Gravity#RIGHT_E@, @B_android#view#Gravity#BOTTOM_E@, @B_android#view#Gravity#START_E@, or @B_android#view#Gravity#END_E@."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Sets the side that is used to calculate the transition propagation. If the transitioning View is visible in the start of the transition, then it will transition sooner when closer to the side and later when farther. If the view is not visible in the start of the transition, then it will transition later when closer to the side and sooner when farther from the edge. The default is @B_android#view#Gravity#BOTTOM_E@.", "history": "added in version 26.0.0-beta1", "FullName": "void setSide (int side)"}}, "Inheritance": ["java.lang.Object", "@B_android#support#transition#TransitionPropagation_E@", "@B_android#support#transition#VisibilityPropagation_E@"], "ClassName": "android.support.transition.SidePropagation", "ClassDesc": "A TransitionPropagation that propagates based on the distance to the side and, orthogonally, the distance to epicenter. If the transitioning View is visible in the start of the transition, then it will transition sooner when closer to the side and later when farther. If the view is not visible in the start of the transition, then it will transition later when closer to the side and sooner when farther from the edge. This is the default TransitionPropagation used with https:##developer#android#com@B_android#transition#Slide_E@."}