{"Functions": {"getCallingPackage(android.app.Activity)": {"Returns": [["@B_java#lang#String_E@", "Name of the calling package"]], "Parameters": [["@B_android#app#Activity_E@", "Activity: Current activity that was launched to share content"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Retrieve the name of the package that launched calledActivity from a share intent. Apps that provide social sharing functionality can use this to provide attribution for the app that shared the content. Note: This data may have been provided voluntarily by the calling application. As such it should not be trusted for accuracy in the context of security or verification.", "history": "added in version 22.0.0", "FullName": "String getCallingPackage (Activity calledActivity)"}, "ShareCompat()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "", "history": "", "FullName": "public ShareCompat ()"}, "getCallingActivity(android.app.Activity)": {"Returns": [["@B_android#content#ComponentName_E@", "ComponentName of the calling activity"]], "Parameters": [["@B_android#app#Activity_E@", "Activity: Current activity that was launched to share content"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Retrieve the ComponentName of the activity that launched calledActivity from a share intent. Apps that provide social sharing functionality can use this to provide attribution for the app that shared the content. Note: This data may have been provided voluntarily by the calling application. As such it should not be trusted for accuracy in the context of security or verification.", "history": "added in version 22.0.0", "FullName": "ComponentName getCallingActivity (Activity calledActivity)"}}, "Inheritance": ["java.lang.Object"], "ClassName": "android.support.v4.app.ShareCompat", "ClassDesc": "Extra helper functionality for sharing data between activities. ShareCompat provides functionality to extend the https:##developer#android#com@B_android#content#Intent#ACTION_SEND_E@/ https:##developer#android#com@B_android#content#Intent#ACTION_SEND_MULTIPLE_E@ protocol and support retrieving more info about the activity that invoked a social sharing action. @B_android#support#v4#app#ShareCompat#IntentBuilder_E@ provides helper functions for constructing a sharing intent that always includes data about the calling activity and app. This lets the called activity provide attribution for the app that shared content. Constructing an intent this way can be done in a method-chaining style. To obtain an IntentBuilder with info about your calling activity, use the static method @B_android#support#v4#app#ShareCompat#IntentBuilder#from_E@. @B_android#support#v4#app#ShareCompat#IntentReader_E@ provides helper functions for parsing the defined extras within an https:##developer#android#com@B_android#content#Intent#ACTION_SEND_E@ or https:##developer#android#com@B_android#content#Intent#ACTION_SEND_MULTIPLE_E@ intent used to launch an activity. You can also obtain a Drawable for the caller's application icon and the application's localized label (the app's human-readable name). Social apps that enable sharing content are encouraged to use this information to call out the app that the content was shared from."}