{"Functions": {"getReaders()": {"Returns": [["@B_android#se#omapi#Reader_E@", "An array of Readers. If there are no readers the returned array is of length 0. This value will never be null."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns an array of available Secure Element readers. There must be no duplicated objects in the returned list. All available readers shall be listed even if no card is inserted.", "history": "Added in API level 28", "FullName": "public Reader[] getReaders ()"}, "shutdown()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Releases all Secure Elements resources allocated by this SEService (including any binding to an underlying service). As a result isConnected() will return false after shutdown() was called. After this method call, the SEService object is not connected. This method should be called when connection to the Secure Element is not needed or in the termination method of the calling application (or part of this application) which is bound to this SEService.", "history": "Added in API level 28", "FullName": "public void shutdown ()"}, "SEService(android.content.Context,java.util.concurrent.Executor,android.se.omapi.SEService.OnConnectedListener)": {"Returns": [], "Parameters": [["@B_android#content#Context_E@", "Context: the context of the calling application. Cannot be null. This value must never be null."], ["@B_java#util#concurrent#Executor_E@", "Executor: an Executor which will be used when invoking the callback. This value must never be null."], ["@B_android#se#omapi#SEService#OnConnectedListener_E@", "SEService.OnConnectedListener: a OnConnectedListener object. This value must never be null."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Establishes a new connection that can be used to connect to all the Secure Elements available in the system. The connection process can be quite long, so it happens in an asynchronous way. It is usable only if the specified listener is called or if isConnected() returns true. The call-back object passed as a parameter will have its onConnected() method called when the connection actually happen.", "history": "Added in API level 28", "FullName": "public SEService (Context context, Executor executor, SEService.OnConnectedListener listener)"}, "getVersion()": {"Returns": [["@B_java#lang#String_E@", "String containing the OpenMobile API version (e.g. \"3.0\"). This value will never be null."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the version of the OpenMobile API specification this implementation is based on.", "history": "Added in API level 28", "FullName": "public String getVersion ()"}, "isConnected()": {"Returns": [["boolean", "true if the service is connected."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Tells whether or not the service is connected.", "history": "Added in API level 28", "FullName": "public boolean isConnected ()"}}, "Inheritance": [], "ClassName": "android.se.omapi.SEService", "ClassDesc": "The SEService realises the communication to available Secure Elements on the device. This is the entry point of this API. It is used to connect to the infrastructure and get access to a list of Secure Element Readers."}