{"Functions": {"showInterstitial()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Shows the interstitial. This may be called any time after a call to @B_com#google#android#gms#ads#mediation#MediationInterstitialListener#onAdLoaded_E@.", "history": "", "FullName": "public abstract void showInterstitial ()"}, "requestInterstitialAd(android.content.Context, com.google.android.gms.ads.mediation.MediationInterstitialListener, android.os.Bundle, com.google.android.gms.ads.mediation.MediationAdRequest, android.os.Bundle)": {"Returns": [], "Parameters": [["Context", "The @B_android#content#Context_E@ of the AdView which will contain the banner View. The @B_android#app#Activity_E@ is preferred."], ["@B_com#google#android#gms#ads#mediation#MediationInterstitialListener_E@", "Listener to adapter with callbacks for various events"], ["Bundle", "Additional parameters defined by the publisher on the mediation server side"], ["@B_com#google#android#gms#ads#mediation#MediationAdRequest_E@", "Generic parameters for this publisher to use when making his ad request"], ["Bundle", "Additional parameters set by the publisher on a per-request basis"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Called by the mediation library to request an ad from the adapter. If the request is successful, the @B_com#google#android#gms#ads#mediation#MediationInterstitialListener#onAdLoaded_E@ method should be called. The interstitial should *NOT* be automatically shown at this point. The mediation library will call the @B_com#google#android#gms#ads#mediation#MediationInterstitialAdapter#showInterstitial_E@ method when the interstitial should be shown. If the request is unsuccessful, the @B_com#google#android#gms#ads#mediation#MediationInterstitialListener#onAdFailedToLoad_E@ method should be called on the listener with an appropriate error cause. Note that this method is called on the UI thread, so all the general precautions of writing code on that thread apply. In particular, the code should not call any blocking methods.", "history": "", "FullName": "public abstract void requestInterstitialAd (Context context, MediationInterstitialListener listener, Bundle serverParameters, MediationAdRequest mediationAdRequest, Bundle mediationExtras)"}}, "Inheritance": [], "ClassName": "com.google.android.gms.ads.mediation.MediationInterstitialAdapter", "ClassDesc": "Adapter for third party ad networks that support interstitial ads. The typical life-cycle for an adapter is to have @B_com#google#android#gms#ads#mediation#MediationInterstitialAdapter#requestInterstitialAd_E@ called once. At this point the adapter should request an ad from the ad network and report to the listener either @B_com#google#android#gms#ads#mediation#MediationInterstitialListener#onAdLoaded_E@ or @B_com#google#android#gms#ads#mediation#MediationInterstitialListener#onAdFailedToLoad_E@. Subsequent requests will be made with a new instance of the adapter. At the end of the life cycle, a best effort is made to call @B_com#google#android#gms#ads#mediation#MediationAdapter#onDestroy_E@, though this is not guaranteed. Note that @B_com#google#android#gms#ads#mediation#MediationInterstitialAdapter#requestInterstitialAd_E@ is called on the UI thread so all the standard precautions of writing code on that thread apply. In particular, the code should not call any blocking methods. The adapter is expected to forward events via the @B_com#google#android#gms#ads#mediation#MediationInterstitialListener_E@ passed in the @B_com#google#android#gms#ads#mediation#MediationInterstitialAdapter#requestInterstitialAd_E@ call. All parameters necessary to make an ad request should be passed in the serverParameters, @B_com#google#android#gms#ads#mediation#MediationAdRequest_E@, and mediationExtras parameters. Adapters should make an effort to disable automatic ad refreshing on the client side. Ads that are refreshed may be ignored, not displayed, and counted incorrectly."}