{"Functions": {"getCurrentPlace(com.google.android.gms.common.api.GoogleApiClient, com.google.android.gms.location.places.PlaceFilter)": {"Returns": [["", "the PlaceLikelihoodBuffer, which may be empty if the place or location is not known or does not match the filtering criteria"]], "Parameters": [["@B_com#google#android#gms#location#places#PlaceFilter_E@", "filtering criteria for the results. If the filter is null, then default filtering parameters are used (see @B_com#google#android#gms#location#places#PlaceFilter_E@)"]], "Throws": [], "SeeAlso": [], "Permissions": ["@B_android#Manifest#permission#ACCESS_FINE_LOCATION_E@"], "Description": "Returns an estimate of the place where the device is currently known to be located. Generates a PlaceLikelihoodBuffer based on the device's last estimated location. Only places which match the given filter will be returned. If the filter requests only coarse place types, results may be obtained at lower latency and power cost, especially over repeated calls. The returned values may be obtained by means of a network lookup. The results are a best guess and are not guaranteed to be meaningful or correct. This API requires the calling application to have the @B_android#Manifest#permission#ACCESS_FINE_LOCATION_E@ permission. Access to this method is subject to quota restrictions.", "history": "", "FullName": "public abstract PendingResult<PlaceLikelihoodBuffer> getCurrentPlace (GoogleApiClient client, PlaceFilter filter)"}, "reportDeviceAtPlace(com.google.android.gms.common.api.GoogleApiClient, com.google.android.gms.location.places.PlaceReport)": {"Returns": [], "Parameters": [["@B_com#google#android#gms#location#places#PlaceReport_E@", "to be uploaded to the server."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Report that the device is currently at a particular place.", "history": "", "FullName": "public abstract PendingResult<Status> reportDeviceAtPlace (GoogleApiClient client, PlaceReport report)"}}, "Inheritance": [], "ClassName": "com.google.android.gms.location.places.PlaceDetectionApi", "ClassDesc": "Main entry point for the Google Place Detection API. The Place Detection API provides quick access to the device's current place, and offers the opportunity to report the location of the device at a particular place (like a check in). Some methods of the PlaceDetectionAPI are subject to a quota limit, as mentioned in the description of the methods concerned. See @B_com#google#android#gms#location#places#PlacesStatusCodes_E@ for detailed information about the error codes."}