{"Functions": {"addPlace(com.google.android.gms.common.api.GoogleApiClient, com.google.android.gms.location.places.AddPlaceRequest)": {"Returns": [["", "a buffer containing the added place."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Add a place to Google's Places database. By adding a place, you can supplement the data in the Google's database with data from your application. This allows you to:", "history": "", "FullName": "public abstract PendingResult<PlaceBuffer> addPlace (GoogleApiClient client, AddPlaceRequest addPlaceRequest)"}, "getPlaceById(com.google.android.gms.common.api.GoogleApiClient, java.lang.String...)": {"Returns": [["", "a buffer containing the requested places."]], "Parameters": [["String...", "the IDs to look up. At least one ID should be provided."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the places for the given placeIds. Note that the ID for given place, once returned by some Places API call, should always be valid for passing to this method. However, place IDs can change over time, so the returned Places may have a different IDs than the ones used for looking it up. This method might return fewer places than requested if some of the places could not be resolved.", "history": "", "FullName": "public abstract PendingResult<PlaceBuffer> getPlaceById (GoogleApiClient client, String... placeIds)"}, "getAutocompletePredictions(com.google.android.gms.common.api.GoogleApiClient, java.lang.String, com.google.android.gms.maps.model.LatLngBounds, com.google.android.gms.location.places.AutocompleteFilter)": {"Returns": [["", "a PendingResult containing the list of predictions for the query which match the filter criteria, or an empty list if none match."]], "Parameters": [["String", "for which the autocomplete predictions are to be fetched."], ["@B_com#google#android#gms#maps#model#LatLngBounds_E@", "for geographically biasing the autocomplete predictions."], ["@B_com#google#android#gms#location#places#AutocompleteFilter_E@", "criteria for customizing the autocomplete predictions."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Get autocomplete predictions for a query, based on the name or address of a place. Access to this method is subject to quota restrictions.", "history": "", "FullName": "public abstract PendingResult<AutocompletePredictionBuffer> getAutocompletePredictions (GoogleApiClient client, String query, LatLngBounds bounds, AutocompleteFilter filter)"}}, "Inheritance": [], "ClassName": "com.google.android.gms.location.places.GeoDataApi", "ClassDesc": "Main entry point for the Google Geo Data API. The Geo Data API provides access to Google's database of local place and business information. A place, generally, is defined as a particular physical space that has a name. The GeoDataApi provides access to getting places by ID, autocompleting a user's search query by name or address, and adding places to Google's Places database. Most API methods may involve a round-trip to a Google server. Some methods of the GeoDataApi API are subject to a quota limit, as mentioned in the description of the methods concerned. See @B_com#google#android#gms#location#places#PlacesStatusCodes_E@ for detailed information about the error codes."}