{"Functions": {"getFileUploadPreferences(com.google.android.gms.common.api.GoogleApiClient)": {"Returns": [["", "A PendingResult which can be used to retrieve @B_com#google#android#gms#drive#FileUploadPreferences_E@."]], "Parameters": [["@B_com#google#android#gms#common#api#GoogleApiClient_E@", "The @B_com#google#android#gms#common#api#GoogleApiClient_E@ to service the call."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Retrieves the file upload preferences for the file uploads performed by the calling application. These preferences control how the files that are created or edited by the calling application are uploaded to the server from the current device. If the calling application regularly uploads large files in the user's Drive, it is advisable to use these preferences to control when the files should be uploaded to the server (based on network connectivity or battery usage, etc.). See @B_com#google#android#gms#drive#FileUploadPreferences_E@ for more details.", "history": "", "FullName": "public abstract PendingResult<DrivePreferencesApi.FileUploadPreferencesResult> getFileUploadPreferences (GoogleApiClient apiClient)"}, "setFileUploadPreferences(com.google.android.gms.common.api.GoogleApiClient, com.google.android.gms.drive.FileUploadPreferences)": {"Returns": [["", "A PendingResult which can be used to retrieve @B_com#google#android#gms#drive#FileUploadPreferences_E@."]], "Parameters": [["@B_com#google#android#gms#common#api#GoogleApiClient_E@", "The @B_com#google#android#gms#common#api#GoogleApiClient_E@ to service the call. The client must be connected before invoking this call."], ["@B_com#google#android#gms#drive#FileUploadPreferences_E@", "The preferences to set for file upload operations."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Sets the file upload preferences for the file uploads performed by the calling application. These preferences control how the files that are created or edited by the calling application are uploaded to the server from the current device. If the calling application regularly uploads large files in the user's Drive, it is advisable to use these preferences to control when the files should be uploaded to the server (based on network connectivity or battery usage, etc.). See @B_com#google#android#gms#drive#FileUploadPreferences_E@ for more details. Note that the preferences will be applied to both future and pending file uploads performed by the application. For example, if the application sets the preferences to upload only on WiFi, and then uploads a file while the device is on mobile data, the file will not be uploaded at that point. However, if later on the application changes the preferences to upload on WiFi or mobile data, then the file becomes eligible to be uploaded.", "history": "", "FullName": "public abstract PendingResult<Status> setFileUploadPreferences (GoogleApiClient apiClient, FileUploadPreferences fileUploadPreferences)"}}, "Inheritance": [], "ClassName": "com.google.android.gms.drive.DrivePreferencesApi", "ClassDesc": "The entry point for retrieving and updating Drive preferences. The preferences set by these APIs are applied only to the current user account and the calling application."}