{"Functions": {"getRating()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the place's rating, from 1.0 to 5.0, based on aggregated user reviews. If no rating is known, a negative value is returned.", "history": "", "FullName": "public abstract float getRating ()"}, "getPhoneNumber()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the place's phone number in international format. Returns null if no phone number is known, or the place has no phone number. International format includes the country code, and is prefixed with the plus (+) sign. For example, the international phone number for Google's Mountain View, USA office is +1 650-253-0000.", "history": "", "FullName": "public abstract CharSequence getPhoneNumber ()"}, "getWebsiteUri()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the URI of the website of this Place. Returns null if no website is known. This is the URI of the website maintained by the Place, if available. Note this is a third-party website not affiliated with the Places API.", "history": "", "FullName": "public abstract Uri getWebsiteUri ()"}, "getViewport()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a viewport for displaying this Place. May return null if the size of the place is not known. This returns a viewport of a size that is suitable for displaying this Place. For example, a Place representing a store may have a relatively small viewport, while a Place representing a country may have a very large viewport.", "history": "", "FullName": "public abstract LatLngBounds getViewport ()"}, "getLatLng()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the location of this Place. The location is not necessarily the center of the Place, or any particular entry or exit point, but some arbitrarily chosen point within the geographic extent of the Place.", "history": "", "FullName": "public abstract LatLng getLatLng ()"}, "getName()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the name of this Place. The name is localized according to the locale returned by @B_com#google#android#gms#location#places#Place#getLocale_E@.", "history": "", "FullName": "public abstract CharSequence getName ()"}, "getId()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the unique id of this Place. This ID can be passed to @B_com#google#android#gms#location#places#GeoDataApi#getPlaceById_E@ to lookup the same place at a later time, but it is not guaranteed that such a lookup will succeed (the place may no longer exist in our database). It is possible that the returned Place in such a lookup will have a different ID (so there may be multiple ID's for one given place).", "history": "", "FullName": "public abstract String getId ()"}, "getLocale()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the locale in which the names and addresses were localized.", "history": "", "FullName": "public abstract Locale getLocale ()"}, "getPriceLevel()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the price level for this place on a scale from 0 (cheapest) to 4. If no price level is known, a negative value is returned. The price level of the place, on a scale of 0 to 4. The exact amount indicated by a specific value will vary from region to region. Price levels are interpreted as follows: 0 — Free 1 — Inexpensive 2 — Moderate 3 — Expensive 4 — Very Expensive", "history": "", "FullName": "public abstract int getPriceLevel ()"}, "getPlaceTypes()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a list of place types for this Place. The elements of this list are drawn from Place.TYPE_* constants, though one should expect there could be new place types returned that were introduced after an app was published.", "history": "", "FullName": "public abstract List<Integer> getPlaceTypes ()"}, "getAddress()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a human readable address for this Place. May return null if the address is unknown. The address is localized according to the locale returned by @B_com#google#android#gms#location#places#Place#getLocale_E@.", "history": "", "FullName": "public abstract CharSequence getAddress ()"}}, "Inheritance": [], "ClassName": "com.google.android.gms.location.places.Place", "ClassDesc": "Represents a particular physical place. A Place encapsulates information about a physical location, including its name, address, and any other information we might have about it. Note that generally some fields will be inapplicable to certain places, or the information may be unknown."}