{"Functions": {"onUploadServerAuthCode(java.lang.String, java.lang.String)": {"Returns": [["", "Whether 3rd party web server successfully exchanged for a refresh token. Note that returning false will fail the @B_com#google#android#gms#common#api#GoogleApiClient#connect_E@. If client wants to ignore their server auth code exchange failure, they should always return true."]], "Parameters": [["String", "id token for the specific account."], ["String", "the server auth code to be uploaded to the 3rd party web server."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Called when server auth code has been fetched and client should upload it to their own server. This callback happens on a background thread and it's OK to do network communication in this callback.", "history": "", "FullName": "public abstract boolean onUploadServerAuthCode (String idToken, String serverAuthCode)"}, "onCheckServerAuthorization(java.lang.String, java.util.Set<com.google.android.gms.common.api.Scope>)": {"Returns": [["", "a non-null @B_com#google#android#gms#common#api#GoogleApiClient#ServerAuthCodeCallbacks#CheckResult_E@ object. for details what information we expect from the callback."]], "Parameters": [["String", "id token for the specific account."], ["Set", "an unmodifiable scope set which client side is planning to request access with. If only your server does data access or your client side doesn't user @B_com#google#android#gms#common#api#GoogleApiClient_E@ to do Google API access, then this scope set will be empty. If your server / client have distinct functionality or your server can figure out their required scopes without knowing what your side is doing, then you can ignore this input as well."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Called when client should check with their own web server whether it needs a (new) server auth code to exchange for a (new) refresh token for the given account. This callback happens on a background thread and it's OK to do network communication in this callback.", "history": "", "FullName": "public abstract GoogleApiClient.ServerAuthCodeCallbacks.CheckResult onCheckServerAuthorization (String idToken, Set<Scope> scopeSet)"}}, "Inheritance": [], "ClassName": "com.google.android.gms.common.api.GoogleApiClient.ServerAuthCodeCallbacks", "ClassDesc": "Provides callbacks to facilitate the server auth code retrieval and eliminates clients from manipulating background threads to do network communications with their own server. Server auth code retrieving flow will look like below: Framework will invoke the callbacks on a background thread. It's NOT necessary to spawn background thread on your own for the network communication."}