{"Functions": {"getInfoContents(com.google.android.gms.maps.model.Marker)": {"Returns": [["", "A custom view to display as contents in the info window for marker, or null to use the default content rendering instead."]], "Parameters": [["@B_com#google#android#gms#maps#model#Marker_E@", "The marker for which an info window is being populated."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Provides custom contents for the default info window frame of a marker. This method is only called if @B_com#google#android#gms#maps#GoogleMap#InfoWindowAdapter#getInfoWindow_E@ first returns null. If this method returns a view, it will be placed inside the default info window frame. If you change this view after this method is called, those changes will not necessarily be reflected in the rendered info window. If this method returns null, the default rendering will be used instead.", "history": "", "FullName": "public abstract View getInfoContents (Marker marker)"}, "getInfoWindow(com.google.android.gms.maps.model.Marker)": {"Returns": [["", "A custom info window for marker, or null to use the default info window frame with @B_com#google#android#gms#maps#GoogleMap#InfoWindowAdapter#getInfoContents_E@."]], "Parameters": [["@B_com#google#android#gms#maps#model#Marker_E@", "The marker for which an info window is being populated."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Provides a custom info window for a marker. If this method returns a view, it is used for the entire info window. If you change this view after this method is called, those changes will not necessarily be reflected in the rendered info window. If this method returns null , the default info window frame will be used, with contents provided by @B_com#google#android#gms#maps#GoogleMap#InfoWindowAdapter#getInfoContents_E@.", "history": "", "FullName": "public abstract View getInfoWindow (Marker marker)"}}, "Inheritance": [], "ClassName": "com.google.android.gms.maps.GoogleMap.InfoWindowAdapter", "ClassDesc": "Provides views for customized rendering of info windows. Methods on this provider are called when it is time to show an info window for a marker, regardless of the cause (either a user gesture or a programmatic call to @B_com#google#android#gms#maps#model#Marker#showInfoWindow_E@. Since there is only one info window shown at any one time, this provider may choose to reuse views, or it may choose to create new views on each method invocation. When constructing an info window, methods in this class are called in a defined order. To replace the default info window, override @B_com#google#android#gms#maps#GoogleMap#InfoWindowAdapter#getInfoWindow_E@ with your custom rendering and return null for @B_com#google#android#gms#maps#GoogleMap#InfoWindowAdapter#getInfoContents_E@. To replace only the info window contents inside the default info window frame (the callout bubble), return null in @B_com#google#android#gms#maps#GoogleMap#InfoWindowAdapter#getInfoWindow_E@ and override @B_com#google#android#gms#maps#GoogleMap#InfoWindowAdapter#getInfoContents_E@ instead. For more information, read the"}