{"Functions": {"onConnected(android.os.Bundle)": {"Returns": [], "Parameters": [["Bundle", "Bundle of data provided to clients by Google Play services. May be null if no content is provided by the service."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "After calling @B_com#google#android#gms#common#api#GoogleApiClient#connect_E@, this method will be invoked asynchronously when the connect request has successfully completed. After this callback, the application can make requests on other methods provided by the client and expect that no user intervention is required to call methods that use account and scopes provided to the client constructor. Note that the contents of the connectionHint Bundle are defined by the specific services. Please see the documentation of the specific implementation of @B_com#google#android#gms#common#api#GoogleApiClient_E@ you are using for more information.", "history": "", "FullName": "public abstract void onConnected (Bundle connectionHint)"}, "onConnectionSuspended(int)": {"Returns": [], "Parameters": [["int", "The reason for the disconnection. Defined by constants CAUSE_*."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Called when the client is temporarily in a disconnected state. This can happen if there is a problem with the remote service (e.g. a crash or resource problem causes it to be killed by the system). When called, all requests have been canceled and no outstanding listeners will be executed. GoogleApiClient will automatically attempt to restore the connection. Applications should disable UI components that require the service, and wait for a call to @B_com#google#android#gms#common#api#GoogleApiClient#ConnectionCallbacks#onConnected_E@ to re-enable them.", "history": "", "FullName": "public abstract void onConnectionSuspended (int cause)"}}, "Inheritance": [], "ClassName": "com.google.android.gms.common.api.GoogleApiClient.ConnectionCallbacks", "ClassDesc": "Provides callbacks that are called when the client is connected or disconnected from the service. Most applications implement @B_com#google#android#gms#common#api#GoogleApiClient#ConnectionCallbacks#onConnected_E@ to start making requests."}