{"Functions": {"writeToParcel(android.os.Parcel, int)": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "", "history": "", "FullName": "public void writeToParcel (Parcel out, int flags)"}, "getInstrumentDetails()": {"Returns": [["", "instrument details that will not be null, but can be the empty string"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Details of an instrument that has a finite set of formats. These details You can rely on the format of instrument details not changing once it is defined for a given form of payment in a transaction (i.e. Instrument details of a credit card are always the last four digits of the card). However, you should be able to handle new formats that could be introduced in the future (i.e. InstantBuy adds support for a new form of payment where last four credit card digits has no meaning and other information is returned). Current expected formats for elements of this array are: Credit cards return the last four digits of the card selected", "history": "", "FullName": "public String getInstrumentDetails ()"}, "getInstrumentType()": {"Returns": [["", "an instrument type that will be non-empty"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Type of an instrument that has a finite set of values. This type You can rely on an instrument type not changing once it is defined for a given instrument in a transaction (i.e. Purchasing with a single Visa card will always return VISA). However, you should be able to handle elements that are not defined in the expected list below (i.e. InstantBuy adds support for a new form of of payment not listed below). Current expected values for elements of this array are: VISA MASTERCARD DISCOVER AMEX", "history": "", "FullName": "public String getInstrumentType ()"}, "describeContents()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "", "history": "", "FullName": "public int describeContents ()"}, "getVersionCode()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "", "history": "", "FullName": "public int getVersionCode ()"}}, "Inheritance": ["java.lang.Object"], "ClassName": "com.google.android.gms.wallet.InstrumentInfo", "ClassDesc": "Parcelable representing more detailed information about a payment instrument."}