{"Functions": {"getStatus()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the status of this result. Use @B_com#google#android#gms#common#api#Status#isSuccess_E@ to determine whether the call was successful, and @B_com#google#android#gms#common#api#Status#getStatusCode_E@ to determine what the error cause was. Certain errors are due to failures that can be resolved by launching a particular intent. The resolution intent is available via @B_com#google#android#gms#common#api#Status#getResolution_E@.", "history": "", "FullName": "public Status getStatus ()"}, "toString()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "", "history": "", "FullName": "public String toString ()"}, "get(int)": {"Returns": [["", "the item at position in this buffer."]], "Parameters": [["int", "The position of the item to retrieve."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Get the item at the specified position. Note that the objects returned from subsequent invocations of this method for the same position may not be identical objects, but will be equal in value. In other words: buffer.get(i) == buffer.get(i) may return false. buffer.get(i).equals(buffer.get(i)) will return true.", "history": "", "FullName": "public PlaceLikelihood get (int position)"}, "getAttributions()": {"Returns": [["", "attributions in HTML format, or null if there are no attributions to display."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the attributions to be shown to the user. We recommend placing this information below any search results or place information. See the", "history": "", "FullName": "public CharSequence getAttributions ()"}}, "Inheritance": ["java.lang.Object", "@B_com#google#android#gms#common#data#AbstractDataBuffer_E@"], "ClassName": "com.google.android.gms.location.places.PlaceLikelihoodBuffer", "ClassDesc": "A DataBuffer that represents a list of PlaceLikelihoods. A PlaceLikelihoodBuffer may contain a number of candidate Places, and an associated likelihood for each Place being the correct Place. For example, the Places service may be uncertain what the true Place is, but think it 55% likely to be PlaceA, and 35% likely to be PlaceB. The corresponding PlaceLikelihoodBuffer has two members, one with likelihood 0.55 and the other with likelihood 0.35. The likelihoods are not guaranteed to be correct, and in a given PlaceLikelihoodBuffer they may not sum to 1.0. NOTE: The calling application must @B_com#google#android#gms#common#data#AbstractDataBuffer#release_E@ this object after it is done with it to prevent a memory leak. Refer to the"}