{"Functions": {"onAchievementUpdated(int, java.lang.String)": {"Returns": [], "Parameters": [["int", "A status code indicating the result of the operation."], ["String", "The ID of the achievement that was updated."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Called when achievement data has been loaded. Possible status codes include: @B_com#google#android#gms#games#GamesClient#STATUS_OK_E@ if data was successfully loaded and is up-to-date. @B_com#google#android#gms#games#GamesClient#STATUS_NETWORK_ERROR_NO_DATA_E@ if the device was unable to retrieve any data from the network and has no data cached locally. @B_com#google#android#gms#games#GamesClient#STATUS_NETWORK_ERROR_STALE_DATA_E@ if the device was unable to retrieve the latest data from the network, but has some data cached locally. @B_com#google#android#gms#games#GamesClient#STATUS_NETWORK_ERROR_OPERATION_DEFERRED_E@ if the device is offline or was otherwise unable to post the achievement update to the server. The achievement update was stored locally and will be posted to the server the next time the device is online and is able to perform a sync (no further action is required from the client). @B_com#google#android#gms#games#GamesClient#STATUS_CLIENT_RECONNECT_REQUIRED_E@ if the @B_com#google#android#gms#games#GamesClient_E@ needs to reconnect to the service to access this data. @B_com#google#android#gms#games#GamesClient#STATUS_LICENSE_CHECK_FAILED_E@ if the game is not licensed to the user. @B_com#google#android#gms#games#GamesClient#STATUS_ACHIEVEMENT_UNLOCKED_E@ if the state of the achievement is @B_com#google#android#gms#games#achievement#Achievement#STATE_UNLOCKED_E@ after an increment operation. Continuing to increment an already unlocked achievement will always return this status. @B_com#google#android#gms#games#GamesClient#STATUS_ACHIEVEMENT_UNKNOWN_E@ if the achievement failed to update because could not find the achievement to update. @B_com#google#android#gms#games#GamesClient#STATUS_ACHIEVEMENT_NOT_INCREMENTAL_E@ if achievement failed to increment since it is not an incremental achievement. @B_com#google#android#gms#games#GamesClient#STATUS_ACHIEVEMENT_UNLOCK_FAILURE_E@ if the call to unlock achievement failed. @B_com#google#android#gms#games#GamesClient#STATUS_INTERNAL_ERROR_E@ if an unexpected error occurred in the service.", "history": "", "FullName": "public abstract void onAchievementUpdated (int statusCode, String achievementId)"}}, "Inheritance": [], "ClassName": "com.google.android.gms.games.achievement.OnAchievementUpdatedListener", "ClassDesc": "Listener for receiving callbacks when achievement data has been updated (revealed, unlocked or incremented)."}