{"Functions": {"appendText(java.time.temporal.TemporalField,java.util.Map<java.lang.Long,java.lang.String>)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to append, not null"], ["@B_java#util#Map_E@", "Map: the map from the value to the text"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends the text of a date-time field to the formatter using the specified map to supply the text. The standard text outputting methods use the localized text in the JDK. This method allows that text to be specified directly. The supplied map is not validated by the builder to ensure that formatting or parsing is possible, thus an invalid map may throw an error during later use. Supplying the map of text provides considerable flexibility in formatting and parsing. For example, a legacy application might require or supply the months of the year as \"JNY\", \"FBY\", \"MCH\" etc. These do not match the standard set of text for localized month names. Using this method, a map can be created which defines the connection between each value and the text: Other uses might be to output the value with a suffix, such as \"1st\", \"2nd\", \"3rd\", or as Roman numerals \"I\", \"II\", \"III\", \"IV\". During formatting, the value is obtained and checked that it is in the valid range. If text is not available for the value then it is output as a number. During parsing, the parser will match against the map of text and numeric values.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendText (TemporalField field, Map<Long, String> textLookup)"}, "appendZoneText(java.time.format.TextStyle,java.util.Set<java.time.ZoneId>)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#format#TextStyle_E@", "TextStyle: the text style to use, not null"], ["@B_java#util#Set_E@", "Set: the set of preferred zone ids, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends the time-zone name, such as 'British Summer Time', to the formatter. This appends an instruction to format/parse the textual name of the zone to the builder. During formatting, the zone is obtained using a mechanism equivalent to querying the temporal with @B_java#time#temporal#TemporalQueries#zoneId_E@. If the zone is a ZoneOffset it will be printed using the result of @B_java#time#ZoneOffset#getId_E@. If the zone is not an offset, the textual name will be looked up for the locale set in the @B_java#time#format#DateTimeFormatter_E@. If the temporal object being printed represents an instant, then the text will be the summer or winter time text as appropriate. If the lookup for text does not find any suitable result, then the @B_java#time#ZoneId#getId_E@ will be printed instead. If the zone cannot be obtained then an exception is thrown unless the section of the formatter is optional. During parsing, either the textual zone name, the zone ID or the offset is accepted. Many textual zone names are not unique, such as CST can be for both \"Central Standard Time\" and \"China Standard Time\". In this situation, the zone id will be determined by the region information from formatter's @B_java#time#format#DateTimeFormatter#getLocale_E@ and the standard zone id for that area, for example, America/New_York for the America Eastern zone. This method also allows a set of preferred @B_java#time#ZoneId_E@ to be specified for parsing. The matched preferred zone id will be used if the textural zone name being parsed is not unique. If the zone cannot be parsed then an exception is thrown unless the section of the formatter is optional.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendZoneText (TextStyle textStyle, Set<ZoneId> preferredZones)"}, "padNext(int)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["int", "int: the pad width, 1 or greater"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if pad width is too small"]], "SeeAlso": [], "Permissions": [], "Description": "Causes the next added printer/parser to pad to a fixed width using a space. This padding will pad to a fixed width using spaces. During formatting, the decorated element will be output and then padded to the specified width. An exception will be thrown during formatting if the pad width is exceeded. During parsing, the padding and decorated element are parsed. If parsing is lenient, then the pad width is treated as a maximum. The padding is parsed greedily. Thus, if the decorated element starts with the pad character, it will not be parsed.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder padNext (int padWidth)"}, "toFormatter()": {"Returns": [["@B_java#time#format#DateTimeFormatter_E@", "the created formatter, not null"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Completes this builder by creating the DateTimeFormatter using the default locale. This will create a formatter with the @B_java#time#format#ResolverStyle#SMART_E@. Calling this method will end any open optional sections by repeatedly calling @B_java#time#format#DateTimeFormatterBuilder#optionalEnd_E@ before creating the formatter. This builder can still be used after creating the formatter if desired, although the state may have been changed by calls to optionalEnd.", "history": "Added in API level 26", "FullName": "public DateTimeFormatter toFormatter ()"}, "appendValueReduced(java.time.temporal.TemporalField,int,int,int)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to append, not null"], ["int", "int: the field width of the printed and parsed field, from 1 to 10"], ["int", "int: the maximum field width of the printed field, from 1 to 10"], ["int", "int: the base value of the range of valid values"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if the width or base value is invalid"]], "SeeAlso": [], "Permissions": [], "Description": "Appends the reduced value of a date-time field to the formatter. Since fields such as year vary by chronology, it is recommended to use the @B_java#time#format#DateTimeFormatterBuilder#appendValueReduced_E@ date} variant of this method in most cases. This variant is suitable for simple fields or working with only the ISO chronology. For formatting, the width and maxWidth are used to determine the number of characters to format. If they are equal then the format is fixed width. If the value of the field is within the range of the baseValue using width characters then the reduced value is formatted otherwise the value is truncated to fit maxWidth. The rightmost characters are output to match the width, left padding with zero. For strict parsing, the number of characters allowed by width to maxWidth are parsed. For lenient parsing, the number of characters must be at least 1 and less than 10. If the number of digits parsed is equal to width and the value is positive, the value of the field is computed to be the first number greater than or equal to the baseValue with the same least significant characters, otherwise the value parsed is the field value. This allows a reduced value to be entered for values in range of the baseValue and width and absolute values can be entered for values outside the range. For example, a base value of 1980 and a width of 2 will have valid values from 1980 to 2079. During parsing, the text \"12\" will result in the value 2012 as that is the value within the range where the last two characters are \"12\". By contrast, parsing the text \"1915\" will result in the value 1915.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendValueReduced (TemporalField field, int width, int maxWidth, int baseValue)"}, "parseStrict()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Changes the parse style to be strict for the remainder of the formatter. Parsing can be strict or lenient - by default its strict. This controls the degree of flexibility in matching the text and sign styles. When used, this method changes the parsing to be strict from this point onwards. As strict is the default, this is normally only needed after calling @B_java#time#format#DateTimeFormatterBuilder#parseLenient_E@. The change will remain in force until the end of the formatter that is eventually constructed or until parseLenient is called.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder parseStrict ()"}, "appendPattern(java.lang.String)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#lang#String_E@", "String: the pattern to add, not null"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if the pattern is invalid"]], "SeeAlso": [], "Permissions": [], "Description": "Appends the elements defined by the specified pattern to the builder. All letters 'A' to 'Z' and 'a' to 'z' are reserved as pattern letters. The characters '#', '{' and '}' are reserved for future use. The characters '[' and ']' indicate optional patterns. The following pattern letters are defined: The count of pattern letters determine the format. See ZoneId. ZoneOffset. Any sequence of letters not specified above, unrecognized letter or reserved character will throw an exception. Future versions may add to the set of patterns. It is recommended to use single quotes around all characters that you want to output directly to ensure that future changes do not break your application. Note that the pattern string is similar, but not identical, to @B_java#text#SimpleDateFormat_E@. The pattern string is also similar, but not identical, to that defined by the Unicode Common Locale Data Repository (CLDR/LDML). Pattern letters 'X' and 'u' are aligned with Unicode CLDR/LDML. By contrast, SimpleDateFormat uses 'u' for the numeric day of week. Pattern letters 'y' and 'Y' parse years of two digits and more than 4 digits differently. Pattern letters 'n', 'A', 'N', and 'p' are added. Number types will reject large numbers.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendPattern (String pattern)"}, "appendInstant()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends an instant using ISO-8601 to the formatter, formatting fractional digits in groups of three. Instants have a fixed output format. They are converted to a date-time with a zone-offset of UTC and formatted using the standard ISO-8601 format. With this method, formatting nano-of-second outputs zero, three, six or nine digits digits as necessary. The localized decimal style is not used. The instant is obtained using @B_java#time#temporal#ChronoField#INSTANT_SECONDS_E@ and optionally (@code NANO_OF_SECOND). The value of INSTANT_SECONDS may be outside the maximum range of LocalDateTime. The @B_java#time#format#DateTimeFormatter#parsedLeapSecond_E@ for full details. An alternative to this method is to format/parse the instant as a single epoch-seconds value. That is achieved using appendValue(INSTANT_SECONDS).", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendInstant ()"}, "DateTimeFormatterBuilder()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Constructs a new instance of the builder.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder ()"}, "appendLocalizedOffset(java.time.format.TextStyle)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#format#TextStyle_E@", "TextStyle: the format style to use, not null"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if style is neither @B_java#time#format#TextStyle#FULL_E@ nor @B_java#time#format#TextStyle#SHORT_E@"]], "SeeAlso": [], "Permissions": [], "Description": "Appends the localized zone offset, such as 'GMT+01:00', to the formatter. This appends a localized zone offset to the builder, the format of the localized offset is controlled by the specified @B_java#time#format#FormatStyle_E@ to this method: @B_java#time#format#TextStyle#FULL_E@ - formats with localized offset text, such as 'GMT, 2-digit hour and minute field, optional second field if non-zero, and colon. @B_java#time#format#TextStyle#SHORT_E@ - formats with localized offset text, such as 'GMT, hour without leading zero, optional 2-digit minute and second if non-zero, and colon. During formatting, the offset is obtained using a mechanism equivalent to querying the temporal with @B_java#time#temporal#TemporalQueries#offset_E@. If the offset cannot be obtained then an exception is thrown unless the section of the formatter is optional. During parsing, the offset is parsed using the format defined above. If the offset cannot be parsed then an exception is thrown unless the section of the formatter is optional.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendLocalizedOffset (TextStyle style)"}, "appendChronologyText(java.time.format.TextStyle)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#format#TextStyle_E@", "TextStyle: the text style to use, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends the chronology name to the formatter. The calendar system name will be output during a format. If the chronology cannot be obtained then an exception will be thrown.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendChronologyText (TextStyle textStyle)"}, "appendOptional(java.time.format.DateTimeFormatter)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#format#DateTimeFormatter_E@", "DateTimeFormatter: the formatter to add, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends a formatter to the builder which will optionally format/parse. This method has the same effect as appending each of the constituent parts directly to this builder surrounded by an @B_java#time#format#DateTimeFormatterBuilder#optionalStart_E@ and @B_java#time#format#DateTimeFormatterBuilder#optionalEnd_E@. The formatter will format if data is available for all the fields contained within it. The formatter will parse if the string matches, otherwise no error is returned.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendOptional (DateTimeFormatter formatter)"}, "padNext(int, char)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["int", "int: the pad width, 1 or greater"], ["char", "char: the pad character"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if pad width is too small"]], "SeeAlso": [], "Permissions": [], "Description": "Causes the next added printer/parser to pad to a fixed width. This padding is intended for padding other than zero-padding. Zero-padding should be achieved using the appendValue methods. During formatting, the decorated element will be output and then padded to the specified width. An exception will be thrown during formatting if the pad width is exceeded. During parsing, the padding and decorated element are parsed. If parsing is lenient, then the pad width is treated as a maximum. If parsing is case insensitive, then the pad character is matched ignoring case. The padding is parsed greedily. Thus, if the decorated element starts with the pad character, it will not be parsed.", "history": "added in API level 26", "FullName": "public DateTimeFormatterBuilder padNext (int padWidth, char padChar)"}, "appendText(java.time.temporal.TemporalField)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to append, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends the text of a date-time field to the formatter using the full text style. The text of the field will be output during a format. The value must be within the valid range of the field. If the value cannot be obtained then an exception will be thrown. If the field has no textual representation, then the numeric value will be used. The value will be printed as per the normal format of an integer value. Only negative numbers will be signed. No padding will be added.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendText (TemporalField field)"}, "appendOffset(java.lang.String, java.lang.String)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#lang#String_E@", "String: the pattern to use, not null"], ["@B_java#lang#String_E@", "String: the text to use when the offset is zero, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends the zone offset, such as '+01:00', to the formatter. This appends an instruction to format/parse the offset ID to the builder. During formatting, the offset is obtained using a mechanism equivalent to querying the temporal with @B_java#time#temporal#TemporalQueries#offset_E@. It will be printed using the format defined below. If the offset cannot be obtained then an exception is thrown unless the section of the formatter is optional. During parsing, the offset is parsed using the format defined below. If the offset cannot be parsed then an exception is thrown unless the section of the formatter is optional. The format of the offset is controlled by a pattern which must be one of the following: +HH - hour only, ignoring minute and second +HHmm - hour, with minute if non-zero, ignoring second, no colon +HH:mm - hour, with minute if non-zero, ignoring second, with colon +HHMM - hour and minute, ignoring second, no colon +HH:MM - hour and minute, ignoring second, with colon +HHMMss - hour and minute, with second if non-zero, no colon +HH:MM:ss - hour and minute, with second if non-zero, with colon +HHMMSS - hour, minute and second, no colon +HH:MM:SS - hour, minute and second, with colon The \"no offset\" text controls what text is printed when the total amount of the offset fields to be output is zero. Example values would be 'Z', '+00:00', 'UTC' or 'GMT'. Three formats are accepted for parsing UTC - the \"no offset\" text, and the plus and minus versions of zero defined by the pattern.", "history": "added in API level 26", "FullName": "public DateTimeFormatterBuilder appendOffset (String pattern, String noOffsetText)"}, "parseDefaulting(java.time.temporal.TemporalField,long)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to default the value of, not null"], ["long", "long: the value to default the field to"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends a default value for a field to the formatter for use in parsing. This appends an instruction to the builder to inject a default value into the parsed result. This is especially useful in conjunction with optional parts of the formatter. For example, consider a formatter that parses the year, followed by an optional month, with a further optional day-of-month. Using such a formatter would require the calling code to check whether a full date, year-month or just a year had been parsed. This method can be used to default the month and day-of-month to a sensible value, such as the first of the month, allowing the calling code to always get a date. During formatting, this method has no effect. During parsing, the current state of the parse is inspected. If the specified field has no associated value, because it has not been parsed successfully at that point, then the specified value is injected into the parse result. Injection is immediate, thus the field-value pair will be visible to any subsequent elements in the formatter. As such, this method is normally called at the end of the builder.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder parseDefaulting (TemporalField field, long value)"}, "appendZoneId()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [], "SeeAlso": ["@B_java#time#format#DateTimeFormatterBuilder#appendZoneRegionId_E@"], "Permissions": [], "Description": "Appends the time-zone ID, such as 'Europe/Paris' or '+02:00', to the formatter. This appends an instruction to format/parse the zone ID to the builder. The zone ID is obtained in a strict manner suitable for ZonedDateTime. By contrast, OffsetDateTime does not have a zone ID suitable for use with this method, see @B_java#time#format#DateTimeFormatterBuilder#appendZoneOrOffsetId_E@. During formatting, the zone is obtained using a mechanism equivalent to querying the temporal with @B_java#time#temporal#TemporalQueries#zoneId_E@. It will be printed using the result of @B_java#time#ZoneId#getId_E@. If the zone cannot be obtained then an exception is thrown unless the section of the formatter is optional. During parsing, the text must match a known zone or offset. There are two types of zone ID, offset-based, such as '+01:30' and region-based, such as 'Europe/London'. These are parsed differently. If the parse starts with '+', '-', 'UT', 'UTC' or 'GMT', then the parser expects an offset-based zone and will not match region-based zones. The offset ID, such as '+02:30', may be at the start of the parse, or prefixed by 'UT', 'UTC' or 'GMT'. The offset ID parsing is equivalent to using @B_java#time#format#DateTimeFormatterBuilder#appendOffset_E@ using the arguments 'HH:MM:ss' and the no offset string '0'. If the parse starts with 'UT', 'UTC' or 'GMT', and the parser cannot match a following offset ID, then @B_java#time#ZoneOffset#UTC_E@ is selected. In all other cases, the list of known region-based zones is used to find the longest available match. If no match is found, and the parse starts with 'Z', then ZoneOffset.UTC is selected. The parser uses the For example, the following will parse:", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendZoneId ()"}, "appendText(java.time.temporal.TemporalField,java.time.format.TextStyle)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to append, not null"], ["@B_java#time#format#TextStyle_E@", "TextStyle: the text style to use, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends the text of a date-time field to the formatter. The text of the field will be output during a format. The value must be within the valid range of the field. If the value cannot be obtained then an exception will be thrown. If the field has no textual representation, then the numeric value will be used. The value will be printed as per the normal format of an integer value. Only negative numbers will be signed. No padding will be added.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendText (TemporalField field, TextStyle textStyle)"}, "appendFraction(java.time.temporal.TemporalField,int,int,boolean)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to append, not null"], ["int", "int: the minimum width of the field excluding the decimal point, from 0 to 9"], ["int", "int: the maximum width of the field excluding the decimal point, from 1 to 9"], ["boolean", "boolean: whether to output the localized decimal point symbol"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if the field has a variable set of valid values or either width is invalid"]], "SeeAlso": [], "Permissions": [], "Description": "Appends the fractional value of a date-time field to the formatter. The fractional value of the field will be output including the preceding decimal point. The preceding value is not output. For example, the second-of-minute value of 15 would be output as .25. The width of the printed fraction can be controlled. Setting the minimum width to zero will cause no output to be generated. The printed fraction will have the minimum width necessary between the minimum and maximum widths - trailing zeroes are omitted. No rounding occurs due to the maximum width - digits are simply dropped. When parsing in strict mode, the number of parsed digits must be between the minimum and maximum width. When parsing in lenient mode, the minimum width is considered to be zero and the maximum is nine. If the value cannot be obtained then an exception will be thrown. If the value is negative an exception will be thrown. If the field does not have a fixed set of valid values then an exception will be thrown. If the field value in the date-time to be printed is invalid it cannot be printed and an exception will be thrown.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendFraction (TemporalField field, int minWidth, int maxWidth, boolean decimalPoint)"}, "appendZoneRegionId()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [], "SeeAlso": ["@B_java#time#format#DateTimeFormatterBuilder#appendZoneId_E@"], "Permissions": [], "Description": "Appends the time-zone region ID, such as 'Europe/Paris', to the formatter, rejecting the zone ID if it is a ZoneOffset. This appends an instruction to format/parse the zone ID to the builder only if it is a region-based ID. During formatting, the zone is obtained using a mechanism equivalent to querying the temporal with @B_java#time#temporal#TemporalQueries#zoneId_E@. If the zone is a ZoneOffset or it cannot be obtained then an exception is thrown unless the section of the formatter is optional. If the zone is not an offset, then the zone will be printed using the zone ID from @B_java#time#ZoneId#getId_E@. During parsing, the text must match a known zone or offset. There are two types of zone ID, offset-based, such as '+01:30' and region-based, such as 'Europe/London'. These are parsed differently. If the parse starts with '+', '-', 'UT', 'UTC' or 'GMT', then the parser expects an offset-based zone and will not match region-based zones. The offset ID, such as '+02:30', may be at the start of the parse, or prefixed by 'UT', 'UTC' or 'GMT'. The offset ID parsing is equivalent to using @B_java#time#format#DateTimeFormatterBuilder#appendOffset_E@ using the arguments 'HH:MM:ss' and the no offset string '0'. If the parse starts with 'UT', 'UTC' or 'GMT', and the parser cannot match a following offset ID, then @B_java#time#ZoneOffset#UTC_E@ is selected. In all other cases, the list of known region-based zones is used to find the longest available match. If no match is found, and the parse starts with 'Z', then ZoneOffset.UTC is selected. The parser uses the For example, the following will parse: Note that this method is identical to appendZoneId() except in the mechanism used to obtain the zone. Note also that parsing accepts offsets, whereas formatting will never produce one.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendZoneRegionId ()"}, "optionalStart()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Mark the start of an optional section. The output of formatting can include optional sections, which may be nested. An optional section is started by calling this method and ended by calling @B_java#time#format#DateTimeFormatterBuilder#optionalEnd_E@ or by ending the build process. All elements in the optional section are treated as optional. During formatting, the section is only output if data is available in the TemporalAccessor for all the elements in the section. During parsing, the whole section may be missing from the parsed string. For example, consider a builder setup as builder.appendValue(HOUR_OF_DAY,2).optionalStart().appendValue(MINUTE_OF_HOUR,2). The optional section ends automatically at the end of the builder. During formatting, the minute will only be output if its value can be obtained from the date-time. During parsing, the input will be successfully parsed whether the minute is present or not.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder optionalStart ()"}, "appendLocalized(java.time.format.FormatStyle,java.time.format.FormatStyle)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#format#FormatStyle_E@", "FormatStyle: the date style to use, null means no date required"], ["@B_java#time#format#FormatStyle_E@", "FormatStyle: the time style to use, null means no time required"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if both the date and time styles are null"]], "SeeAlso": [], "Permissions": [], "Description": "Appends a localized date-time pattern to the formatter. This appends a localized section to the builder, suitable for outputting a date, time or date-time combination. The format of the localized section is lazily looked up based on four items: the dateStyle specified to this method the timeStyle specified to this method the Locale of the DateTimeFormatter the Chronology, selecting the best available During formatting, the chronology is obtained from the temporal object being formatted, which may have been overridden by @B_java#time#format#DateTimeFormatter#withChronology_E@. During parsing, if a chronology has already been parsed, then it is used. Otherwise the default from DateTimeFormatter.withChronology(Chronology) is used, with IsoChronology as the fallback. Note that this method provides similar functionality to methods on DateFormat such as @B_java#text#DateFormat#getDateTimeInstance_E@.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendLocalized (FormatStyle dateStyle, FormatStyle timeStyle)"}, "getLocalizedDateTimePattern(java.time.format.FormatStyle,java.time.format.FormatStyle,java.time.chrono.Chronology,java.util.Locale)": {"Returns": [["@B_java#lang#String_E@", "the locale and Chronology specific formatting pattern"]], "Parameters": [["@B_java#time#format#FormatStyle_E@", "FormatStyle: the FormatStyle for the date, null for time-only pattern"], ["@B_java#time#format#FormatStyle_E@", "FormatStyle: the FormatStyle for the time, null for date-only pattern"], ["@B_java#time#chrono#Chronology_E@", "Chronology: the Chronology, non-null"], ["@B_java#util#Locale_E@", "Locale: the locale, non-null"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if both dateStyle and timeStyle are null"]], "SeeAlso": [], "Permissions": [], "Description": "Gets the formatting pattern for date and time styles for a locale and chronology. The locale and chronology are used to lookup the locale specific format for the requested dateStyle and/or timeStyle.", "history": "Added in API level 26", "FullName": "public static String getLocalizedDateTimePattern (FormatStyle dateStyle, FormatStyle timeStyle, Chronology chrono, Locale locale)"}, "optionalEnd()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [["@B_java#lang#IllegalStateException_E@", "if there was no previous call to optionalStart"]], "SeeAlso": [], "Permissions": [], "Description": "Ends an optional section. The output of formatting can include optional sections, which may be nested. An optional section is started by calling @B_java#time#format#DateTimeFormatterBuilder#optionalStart_E@ and ended using this method (or at the end of the builder). Calling this method without having previously called optionalStart will throw an exception. Calling this method immediately after calling optionalStart has no effect on the formatter other than ending the (empty) optional section. All elements in the optional section are treated as optional. During formatting, the section is only output if data is available in the TemporalAccessor for all the elements in the section. During parsing, the whole section may be missing from the parsed string. For example, consider a builder setup as builder.appendValue(HOUR_OF_DAY,2).optionalStart().appendValue(MINUTE_OF_HOUR,2).optionalEnd(). During formatting, the minute will only be output if its value can be obtained from the date-time. During parsing, the input will be successfully parsed whether the minute is present or not.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder optionalEnd ()"}, "appendLiteral(char)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["char", "char: the literal to append, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends a character literal to the formatter. This character will be output during a format.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendLiteral (char literal)"}, "appendValue(java.time.temporal.TemporalField, int)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to append, not null"], ["int", "int: the width of the printed field, from 1 to 19"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if the width is invalid"]], "SeeAlso": [], "Permissions": [], "Description": "Appends the value of a date-time field to the formatter using a fixed width, zero-padded approach. The value of the field will be output during a format. If the value cannot be obtained then an exception will be thrown. The value will be zero-padded on the left. If the size of the value means that it cannot be printed within the width then an exception is thrown. If the value of the field is negative then an exception is thrown during formatting. This method supports a special technique of parsing known as 'adjacent value parsing'. This technique solves the problem where a value, variable or fixed width, is followed by one or more fixed length values. The standard parser is greedy, and thus it would normally steal the digits that are needed by the fixed width value parsers that follow the variable width one. No action is required to initiate 'adjacent value parsing'. When a call to appendValue is made, the builder enters adjacent value parsing setup mode. If the immediately subsequent method call or calls on the same builder are for a fixed width value, then the parser will reserve space so that the fixed width values can be parsed. For example, consider builder.appendValue(YEAR).appendValue(MONTH_OF_YEAR, 2); The year is a variable width parse of between 1 and 19 digits. The month is a fixed width parse of 2 digits. Because these were appended to the same builder immediately after one another, the year parser will reserve two digits for the month to parse. Thus, the text '201106' will correctly parse to a year of 2011 and a month of 6. Without adjacent value parsing, the year would greedily parse all six digits and leave nothing for the month. Adjacent value parsing applies to each set of fixed width not-negative values in the parser that immediately follow any kind of value, variable or fixed width. Calling any other append method will end the setup of adjacent value parsing. Thus, in the unlikely event that you need to avoid adjacent value parsing behavior, simply add the appendValue to another DateTimeFormatterBuilder and add that to this builder. If adjacent parsing is active, then parsing must match exactly the specified number of digits in both strict and lenient modes. In addition, no positive or negative sign is permitted.", "history": "added in API level 26", "FullName": "public DateTimeFormatterBuilder appendValue (TemporalField field, int width)"}, "appendZoneText(java.time.format.TextStyle)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#format#TextStyle_E@", "TextStyle: the text style to use, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends the time-zone name, such as 'British Summer Time', to the formatter. This appends an instruction to format/parse the textual name of the zone to the builder. During formatting, the zone is obtained using a mechanism equivalent to querying the temporal with @B_java#time#temporal#TemporalQueries#zoneId_E@. If the zone is a ZoneOffset it will be printed using the result of @B_java#time#ZoneOffset#getId_E@. If the zone is not an offset, the textual name will be looked up for the locale set in the @B_java#time#format#DateTimeFormatter_E@. If the temporal object being printed represents an instant, then the text will be the summer or winter time text as appropriate. If the lookup for text does not find any suitable result, then the @B_java#time#ZoneId#getId_E@ will be printed instead. If the zone cannot be obtained then an exception is thrown unless the section of the formatter is optional. During parsing, either the textual zone name, the zone ID or the offset is accepted. Many textual zone names are not unique, such as CST can be for both \"Central Standard Time\" and \"China Standard Time\". In this situation, the zone id will be determined by the region information from formatter's @B_java#time#format#DateTimeFormatter#getLocale_E@ and the standard zone id for that area, for example, America/New_York for the America Eastern zone. The @B_java#time#format#DateTimeFormatterBuilder#appendZoneText_E@ may be used to specify a set of preferred @B_java#time#ZoneId_E@ in this situation.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendZoneText (TextStyle textStyle)"}, "parseCaseSensitive()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Changes the parse style to be case sensitive for the remainder of the formatter. Parsing can be case sensitive or insensitive - by default it is case sensitive. This method allows the case sensitivity setting of parsing to be changed. Calling this method changes the state of the builder such that all subsequent builder method calls will parse text in case sensitive mode. See @B_java#time#format#DateTimeFormatterBuilder#parseCaseInsensitive_E@ for the opposite setting. The parse case sensitive/insensitive methods may be called at any point in the builder, thus the parser can swap between case parsing modes multiple times during the parse. Since the default is case sensitive, this method should only be used after a previous call to #parseCaseInsensitive.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder parseCaseSensitive ()"}, "appendZoneOrOffsetId()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [], "SeeAlso": ["@B_java#time#format#DateTimeFormatterBuilder#appendZoneId_E@"], "Permissions": [], "Description": "Appends the time-zone ID, such as 'Europe/Paris' or '+02:00', to the formatter, using the best available zone ID. This appends an instruction to format/parse the best available zone or offset ID to the builder. The zone ID is obtained in a lenient manner that first attempts to find a true zone ID, such as that on ZonedDateTime, and then attempts to find an offset, such as that on OffsetDateTime. During formatting, the zone is obtained using a mechanism equivalent to querying the temporal with @B_java#time#temporal#TemporalQueries#zone_E@. It will be printed using the result of @B_java#time#ZoneId#getId_E@. If the zone cannot be obtained then an exception is thrown unless the section of the formatter is optional. During parsing, the text must match a known zone or offset. There are two types of zone ID, offset-based, such as '+01:30' and region-based, such as 'Europe/London'. These are parsed differently. If the parse starts with '+', '-', 'UT', 'UTC' or 'GMT', then the parser expects an offset-based zone and will not match region-based zones. The offset ID, such as '+02:30', may be at the start of the parse, or prefixed by 'UT', 'UTC' or 'GMT'. The offset ID parsing is equivalent to using @B_java#time#format#DateTimeFormatterBuilder#appendOffset_E@ using the arguments 'HH:MM:ss' and the no offset string '0'. If the parse starts with 'UT', 'UTC' or 'GMT', and the parser cannot match a following offset ID, then @B_java#time#ZoneOffset#UTC_E@ is selected. In all other cases, the list of known region-based zones is used to find the longest available match. If no match is found, and the parse starts with 'Z', then ZoneOffset.UTC is selected. The parser uses the For example, the following will parse: Note that this method is identical to appendZoneId() except in the mechanism used to obtain the zone.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendZoneOrOffsetId ()"}, "appendInstant(int)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["int", "int: the number of fractional second digits to format with, from 0 to 9, or -1 to use as many digits as necessary"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends an instant using ISO-8601 to the formatter with control over the number of fractional digits. Instants have a fixed output format, although this method provides some control over the fractional digits. They are converted to a date-time with a zone-offset of UTC and printed using the standard ISO-8601 format. The localized decimal style is not used. The fractionalDigits parameter allows the output of the fractional second to be controlled. Specifying zero will cause no fractional digits to be output. From 1 to 9 will output an increasing number of digits, using zero right-padding if necessary. The special value -1 is used to output as many digits as necessary to avoid any trailing zeroes. When parsing in strict mode, the number of parsed digits must match the fractional digits. When parsing in lenient mode, any number of fractional digits from zero to nine are accepted. The instant is obtained using @B_java#time#temporal#ChronoField#INSTANT_SECONDS_E@ and optionally (@code NANO_OF_SECOND). The value of INSTANT_SECONDS may be outside the maximum range of LocalDateTime. The @B_java#time#format#DateTimeFormatter#parsedLeapSecond_E@ for full details. An alternative to this method is to format/parse the instant as a single epoch-seconds value. That is achieved using appendValue(INSTANT_SECONDS).", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendInstant (int fractionalDigits)"}, "padNext(int,char)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["int", "int: the pad width, 1 or greater"], ["char", "char: the pad character"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if pad width is too small"]], "SeeAlso": [], "Permissions": [], "Description": "Causes the next added printer/parser to pad to a fixed width. This padding is intended for padding other than zero-padding. Zero-padding should be achieved using the appendValue methods. During formatting, the decorated element will be output and then padded to the specified width. An exception will be thrown during formatting if the pad width is exceeded. During parsing, the padding and decorated element are parsed. If parsing is lenient, then the pad width is treated as a maximum. If parsing is case insensitive, then the pad character is matched ignoring case. The padding is parsed greedily. Thus, if the decorated element starts with the pad character, it will not be parsed.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder padNext (int padWidth, char padChar)"}, "appendLiteral(java.lang.String)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#lang#String_E@", "String: the literal to append, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends a string literal to the formatter. This string will be output during a format. If the literal is empty, nothing is added to the formatter.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendLiteral (String literal)"}, "appendOffsetId()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends the zone offset, such as '+01:00', to the formatter. This appends an instruction to format/parse the offset ID to the builder. This is equivalent to calling appendOffset(\"+HH:MM:ss\", \"Z\").", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendOffsetId ()"}, "appendValueReduced(java.time.temporal.TemporalField,int,int,java.time.chrono.ChronoLocalDate)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to append, not null"], ["int", "int: the field width of the printed and parsed field, from 1 to 10"], ["int", "int: the maximum field width of the printed field, from 1 to 10"], ["@B_java#time#chrono#ChronoLocalDate_E@", "ChronoLocalDate: the base date used to calculate the base value for the range of valid values in the parsed chronology, not null"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if the width or base value is invalid"]], "SeeAlso": [], "Permissions": [], "Description": "Appends the reduced value of a date-time field to the formatter. This is typically used for formatting and parsing a two digit year. The base date is used to calculate the full value during parsing. For example, if the base date is 1950-01-01 then parsed values for a two digit year parse will be in the range 1950-01-01 to 2049-12-31. Only the year would be extracted from the date, thus a base date of 1950-08-25 would also parse to the range 1950-01-01 to 2049-12-31. This behavior is necessary to support fields such as week-based-year or other calendar systems where the parsed value does not align with standard ISO years. The exact behavior is as follows. Parse the full set of fields and determine the effective chronology using the last chronology if it appears more than once. Then convert the base date to the effective chronology. Then extract the specified field from the chronology-specific base date and use it to determine the baseValue used below. For formatting, the width and maxWidth are used to determine the number of characters to format. If they are equal then the format is fixed width. If the value of the field is within the range of the baseValue using width characters then the reduced value is formatted otherwise the value is truncated to fit maxWidth. The rightmost characters are output to match the width, left padding with zero. For strict parsing, the number of characters allowed by width to maxWidth are parsed. For lenient parsing, the number of characters must be at least 1 and less than 10. If the number of digits parsed is equal to width and the value is positive, the value of the field is computed to be the first number greater than or equal to the baseValue with the same least significant characters, otherwise the value parsed is the field value. This allows a reduced value to be entered for values in range of the baseValue and width and absolute values can be entered for values outside the range. For example, a base value of 1980 and a width of 2 will have valid values from 1980 to 2079. During parsing, the text \"12\" will result in the value 2012 as that is the value within the range where the last two characters are \"12\". By contrast, parsing the text \"1915\" will result in the value 1915.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendValueReduced (TemporalField field, int width, int maxWidth, ChronoLocalDate baseDate)"}, "appendChronologyId()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends the chronology ID, such as 'ISO' or 'ThaiBuddhist', to the formatter. This appends an instruction to format/parse the chronology ID to the builder. During formatting, the chronology is obtained using a mechanism equivalent to querying the temporal with @B_java#time#temporal#TemporalQueries#chronology_E@. It will be printed using the result of @B_java#time#chrono#Chronology#getId_E@. If the chronology cannot be obtained then an exception is thrown unless the section of the formatter is optional. During parsing, the chronology is parsed and must match one of the chronologies in @B_java#time#chrono#Chronology#getAvailableChronologies_E@. If the chronology cannot be parsed then an exception is thrown unless the section of the formatter is optional. The parser uses the", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendChronologyId ()"}, "parseCaseInsensitive()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Changes the parse style to be case insensitive for the remainder of the formatter. Parsing can be case sensitive or insensitive - by default it is case sensitive. This method allows the case sensitivity setting of parsing to be changed. Calling this method changes the state of the builder such that all subsequent builder method calls will parse text in case insensitive mode. See @B_java#time#format#DateTimeFormatterBuilder#parseCaseSensitive_E@ for the opposite setting. The parse case sensitive/insensitive methods may be called at any point in the builder, thus the parser can swap between case parsing modes multiple times during the parse.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder parseCaseInsensitive ()"}, "appendValue(java.time.temporal.TemporalField,int,int,java.time.format.SignStyle)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to append, not null"], ["int", "int: the minimum field width of the printed field, from 1 to 19"], ["int", "int: the maximum field width of the printed field, from 1 to 19"], ["@B_java#time#format#SignStyle_E@", "SignStyle: the positive/negative output style, not null"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if the widths are invalid"]], "SeeAlso": [], "Permissions": [], "Description": "Appends the value of a date-time field to the formatter providing full control over formatting. The value of the field will be output during a format. If the value cannot be obtained then an exception will be thrown. This method provides full control of the numeric formatting, including zero-padding and the positive/negative sign. The parser for a variable width value such as this normally behaves greedily, accepting as many digits as possible. This behavior can be affected by 'adjacent value parsing'. See @B_java#time#format#DateTimeFormatterBuilder#appendValue_E@ for full details. In strict parsing mode, the minimum number of parsed digits is minWidth and the maximum is maxWidth. In lenient parsing mode, the minimum number of parsed digits is one and the maximum is 19 (except as limited by adjacent value parsing). If this method is invoked with equal minimum and maximum widths and a sign style of NOT_NEGATIVE then it delegates to appendValue(TemporalField,int). In this scenario, the formatting and parsing behavior described there occur.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendValue (TemporalField field, int minWidth, int maxWidth, SignStyle signStyle)"}, "appendValue(java.time.temporal.TemporalField)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to append, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends the value of a date-time field to the formatter using a normal output style. The value of the field will be output during a format. If the value cannot be obtained then an exception will be thrown. The value will be printed as per the normal format of an integer value. Only negative numbers will be signed. No padding will be added. The parser for a variable width value such as this normally behaves greedily, requiring one digit, but accepting as many digits as possible. This behavior can be affected by 'adjacent value parsing'. See @B_java#time#format#DateTimeFormatterBuilder#appendValue_E@ for full details.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendValue (TemporalField field)"}, "toFormatter(java.util.Locale)": {"Returns": [["@B_java#time#format#DateTimeFormatter_E@", "the created formatter, not null"]], "Parameters": [["@B_java#util#Locale_E@", "Locale: the locale to use for formatting, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Completes this builder by creating the DateTimeFormatter using the specified locale. This will create a formatter with the specified locale. Numbers will be printed and parsed using the standard DecimalStyle. The resolver style will be @B_java#time#format#ResolverStyle#SMART_E@. Calling this method will end any open optional sections by repeatedly calling @B_java#time#format#DateTimeFormatterBuilder#optionalEnd_E@ before creating the formatter. This builder can still be used after creating the formatter if desired, although the state may have been changed by calls to optionalEnd.", "history": "Added in API level 26", "FullName": "public DateTimeFormatter toFormatter (Locale locale)"}, "appendValue(java.time.temporal.TemporalField,int)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to append, not null"], ["int", "int: the width of the printed field, from 1 to 19"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "if the width is invalid"]], "SeeAlso": [], "Permissions": [], "Description": "Appends the value of a date-time field to the formatter using a fixed width, zero-padded approach. The value of the field will be output during a format. If the value cannot be obtained then an exception will be thrown. The value will be zero-padded on the left. If the size of the value means that it cannot be printed within the width then an exception is thrown. If the value of the field is negative then an exception is thrown during formatting. This method supports a special technique of parsing known as 'adjacent value parsing'. This technique solves the problem where a value, variable or fixed width, is followed by one or more fixed length values. The standard parser is greedy, and thus it would normally steal the digits that are needed by the fixed width value parsers that follow the variable width one. No action is required to initiate 'adjacent value parsing'. When a call to appendValue is made, the builder enters adjacent value parsing setup mode. If the immediately subsequent method call or calls on the same builder are for a fixed width value, then the parser will reserve space so that the fixed width values can be parsed. For example, consider builder.appendValue(YEAR).appendValue(MONTH_OF_YEAR, 2); The year is a variable width parse of between 1 and 19 digits. The month is a fixed width parse of 2 digits. Because these were appended to the same builder immediately after one another, the year parser will reserve two digits for the month to parse. Thus, the text '201106' will correctly parse to a year of 2011 and a month of 6. Without adjacent value parsing, the year would greedily parse all six digits and leave nothing for the month. Adjacent value parsing applies to each set of fixed width not-negative values in the parser that immediately follow any kind of value, variable or fixed width. Calling any other append method will end the setup of adjacent value parsing. Thus, in the unlikely event that you need to avoid adjacent value parsing behavior, simply add the appendValue to another DateTimeFormatterBuilder and add that to this builder. If adjacent parsing is active, then parsing must match exactly the specified number of digits in both strict and lenient modes. In addition, no positive or negative sign is permitted.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendValue (TemporalField field, int width)"}, "appendOffset(java.lang.String,java.lang.String)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#lang#String_E@", "String: the pattern to use, not null"], ["@B_java#lang#String_E@", "String: the text to use when the offset is zero, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends the zone offset, such as '+01:00', to the formatter. This appends an instruction to format/parse the offset ID to the builder. During formatting, the offset is obtained using a mechanism equivalent to querying the temporal with @B_java#time#temporal#TemporalQueries#offset_E@. It will be printed using the format defined below. If the offset cannot be obtained then an exception is thrown unless the section of the formatter is optional. During parsing, the offset is parsed using the format defined below. If the offset cannot be parsed then an exception is thrown unless the section of the formatter is optional. The format of the offset is controlled by a pattern which must be one of the following: +HH - hour only, ignoring minute and second +HHmm - hour, with minute if non-zero, ignoring second, no colon +HH:mm - hour, with minute if non-zero, ignoring second, with colon +HHMM - hour and minute, ignoring second, no colon +HH:MM - hour and minute, ignoring second, with colon +HHMMss - hour and minute, with second if non-zero, no colon +HH:MM:ss - hour and minute, with second if non-zero, with colon +HHMMSS - hour, minute and second, no colon +HH:MM:SS - hour, minute and second, with colon The \"no offset\" text controls what text is printed when the total amount of the offset fields to be output is zero. Example values would be 'Z', '+00:00', 'UTC' or 'GMT'. Three formats are accepted for parsing UTC - the \"no offset\" text, and the plus and minus versions of zero defined by the pattern.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder appendOffset (String pattern, String noOffsetText)"}, "append(java.time.format.DateTimeFormatter)": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [["@B_java#time#format#DateTimeFormatter_E@", "DateTimeFormatter: the formatter to add, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Appends all the elements of a formatter to the builder. This method has the same effect as appending each of the constituent parts of the formatter directly to this builder.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder append (DateTimeFormatter formatter)"}, "parseLenient()": {"Returns": [["@B_java#time#format#DateTimeFormatterBuilder_E@", "this, for chaining, not null"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Changes the parse style to be lenient for the remainder of the formatter. Note that case sensitivity is set separately to this method. Parsing can be strict or lenient - by default its strict. This controls the degree of flexibility in matching the text and sign styles. Applications calling this method should typically also call @B_java#time#format#DateTimeFormatterBuilder#parseCaseInsensitive_E@. When used, this method changes the parsing to be lenient from this point onwards. The change will remain in force until the end of the formatter that is eventually constructed or until parseStrict is called.", "history": "Added in API level 26", "FullName": "public DateTimeFormatterBuilder parseLenient ()"}}, "Inheritance": [], "ClassName": "java.time.format.DateTimeFormatterBuilder", "ClassDesc": "Builder to create date-time formatters. This allows a DateTimeFormatter to be created. All date-time formatters are created ultimately using this builder. The basic elements of date-time can all be added: Value - a numeric value Fraction - a fractional value including the decimal place. Always use this when outputting fractions to ensure that the fraction is parsed correctly Text - the textual equivalent for the value OffsetId/Offset - the ZoneId - the ZoneText - the name of the time-zone ChronologyId - the ChronologyText - the name of the chronology Literal - a text literal Nested and Optional - formats can be nested or made optional In addition, any of the elements may be decorated by padding, either with spaces or any other character. Finally, a shorthand pattern, mostly compatible with java.text.SimpleDateFormat SimpleDateFormat can be used, see @B_java#time#format#DateTimeFormatterBuilder#appendPattern_E@. In practice, this simply parses the pattern and calls other methods on the builder."}