{"Functions": {"encode(java.io.OutputStream)": {"Returns": [], "Parameters": [["@B_java#io#OutputStream_E@", "OutputStream: the output stream to which to encode the certificate."]], "Throws": [["@B_java#security#KeyException_E@", "if the certificate is not properly initialized, or data is missing, etc."], ["@B_java#io#IOException_E@", "if a stream exception occurs while trying to output the encoded certificate to the output stream."]], "SeeAlso": ["@B_java#security#Certificate#decode_E@", "@B_java#security#Certificate#getFormat_E@"], "Permissions": [], "Description": "Encodes the certificate to an output stream in a format that can be decoded by the decode method.", "history": "Added in API level 1 Deprecated in API level 3", "FullName": "public abstract void encode (OutputStream stream)"}, "toString(boolean)": {"Returns": [["@B_java#lang#String_E@", "a string representing the contents of the certificate"]], "Parameters": [["boolean", "boolean: whether or not to give detailed information about the certificate"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a string that represents the contents of the certificate.", "history": "Added in API level 1 Deprecated in API level 3", "FullName": "public abstract String toString (boolean detailed)"}, "getPrincipal()": {"Returns": [["@B_java#security#Principal_E@", "the principal to which this certificate is bound."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the principal of the principal-key pair being guaranteed by the guarantor.", "history": "Added in API level 1 Deprecated in API level 3", "FullName": "public abstract Principal getPrincipal ()"}, "getPublicKey()": {"Returns": [["@B_java#security#PublicKey_E@", "the public key that this certificate certifies belongs to a particular principal."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the key of the principal-key pair being guaranteed by the guarantor.", "history": "Added in API level 1 Deprecated in API level 3", "FullName": "public abstract PublicKey getPublicKey ()"}, "decode(java.io.InputStream)": {"Returns": [], "Parameters": [["@B_java#io#InputStream_E@", "InputStream: the input stream from which to fetch the data being decoded."]], "Throws": [["@B_java#security#KeyException_E@", "if the certificate is not properly initialized, or data is missing, etc."], ["@B_java#io#IOException_E@", "if an exception occurs while trying to input the encoded certificate from the input stream."]], "SeeAlso": ["@B_java#security#Certificate#encode_E@", "@B_java#security#Certificate#getFormat_E@"], "Permissions": [], "Description": "Decodes a certificate from an input stream. The format should be that returned by getFormat and produced by encode.", "history": "Added in API level 1 Deprecated in API level 3", "FullName": "public abstract void decode (InputStream stream)"}, "getFormat()": {"Returns": [["@B_java#lang#String_E@", "the name of the coding format."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the name of the coding format. This is used as a hint to find an appropriate parser. It could be \"X.509\", \"PGP\", etc. This is the format produced and understood by the encode and decode methods.", "history": "Added in API level 1 Deprecated in API level 3", "FullName": "public abstract String getFormat ()"}, "getGuarantor()": {"Returns": [["@B_java#security#Principal_E@", "the guarantor which guaranteed the principal-key binding."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the guarantor of the certificate, that is, the principal guaranteeing that the public key associated with this certificate is that of the principal associated with this certificate. For X.509 certificates, the guarantor will typically be a Certificate Authority (such as the United States Postal Service or Verisign, Inc.).", "history": "Added in API level 1 Deprecated in API level 3", "FullName": "public abstract Principal getGuarantor ()"}}, "Inheritance": [], "ClassName": "java.security.Certificate", "ClassDesc": "A new certificate handling package is created in the Java platform. This Certificate interface is entirely deprecated and is here to allow for a smooth transition to the new package. This is an interface of abstract methods for managing a variety of identity certificates. An identity certificate is a guarantee by a principal that a public key is that of another principal. (A principal represents an entity such as an individual user, a group, or a corporation.) In particular, this interface is intended to be a common abstraction for constructs that have different formats but important common uses. For example, different types of certificates, such as X.509 certificates and PGP certificates, share general certificate functionality (the need to encode and decode certificates) and some types of information, such as a public key, the principal whose key it is, and the guarantor guaranteeing that the public key is that of the specified principal. So an implementation of X.509 certificates and an implementation of PGP certificates can both utilize the Certificate interface, even though their formats and additional types and amounts of information stored are different."}