{"Functions": {"probeContentType(java.nio.file.Path)": {"Returns": [["@B_java#lang#String_E@", "The content type or null if the file type is not recognized"]], "Parameters": [["@B_java#nio#file#Path_E@", "Path: the path to the file to probe"]], "Throws": [["@B_java#io#IOException_E@", "An I/O error occurs"], ["@B_java#lang#SecurityException_E@", "If the implementation requires to access the file, and a security manager is installed, and it denies an unspecified permission required by a file system provider implementation. If the file reference is associated with the default file system provider then the @B_java#lang#SecurityManager#checkRead_E@ method is invoked to check read access to the file."]], "SeeAlso": ["@B_java#nio#file#Files#probeContentType_E@"], "Permissions": [], "Description": "Probes the given file to guess its content type. The means by which this method determines the file type is highly implementation specific. It may simply examine the file name, it may use a file The probe result is the string form of the value of a Multipurpose Internet Mail Extension (MIME) content type as defined by", "history": "Added in API level 26", "FullName": "public abstract String probeContentType (Path path)"}, "FileTypeDetector()": {"Returns": [], "Parameters": [], "Throws": [["@B_java#lang#SecurityException_E@", "If a security manager has been installed and it denies @B_java#lang#RuntimePermission_E@(\"fileTypeDetector\")"]], "SeeAlso": [], "Permissions": [], "Description": "Initializes a new instance of this class.", "history": "Added in API level 26", "FullName": "protected FileTypeDetector ()"}}, "Inheritance": [], "ClassName": "java.nio.file.spi.FileTypeDetector", "ClassDesc": "A file type detector for probing a file to guess its file type. A file type detector is a concrete implementation of this class, has a zero-argument constructor, and implements the abstract methods specified below. The means by which a file type detector determines the file type is highly implementation specific. A simple implementation might examine the file extension (a convention used in some platforms) and map it to a file type. In other cases, the file type may be stored as a file"}