{"Functions": {"CollectionCertStoreParameters()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Creates an instance of CollectionCertStoreParameters with the default parameter values (an empty and immutable Collection).", "history": "Added in API level 1", "FullName": "public CollectionCertStoreParameters ()"}, "toString()": {"Returns": [["@B_java#lang#String_E@", "a formatted string describing the parameters"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a formatted string describing the parameters.", "history": "Added in API level 1", "FullName": "public String toString ()"}, "clone()": {"Returns": [["@B_java#lang#Object_E@", "the copy"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this object. Note that only a reference to the Collection is copied, and not the contents.", "history": "Added in API level 1", "FullName": "public Object clone ()"}, "CollectionCertStoreParameters(java.util.Collection<?>)": {"Returns": [], "Parameters": [["@B_java#util#Collection_E@", "Collection: a Collection of Certificates and CRLs"]], "Throws": [["@B_java#lang#NullPointerException_E@", "if collection is null"]], "SeeAlso": [], "Permissions": [], "Description": "Creates an instance of CollectionCertStoreParameters which will allow certificates and CRLs to be retrieved from the specified Collection. If the specified Collection contains an object that is not a Certificate or CRL, that object will be ignored by the Collection CertStore. The Collection is Certificates or CRLs from the Collection, thus changing the set of Certificates or CRLs available to the Collection CertStore. The Collection CertStore will not modify the contents of the Collection. If the Collection will be modified by one thread while another thread is calling a method of a Collection CertStore that has been initialized with this Collection, the Collection must have fail-fast iterators.", "history": "Added in API level 1", "FullName": "public CollectionCertStoreParameters (Collection<?> collection)"}, "getCollection()": {"Returns": [["@B_java#util#Collection_E@", "the Collection (never null)"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the Collection from which Certificates and CRLs are retrieved. This is Collection, it is a reference. This allows the caller to subsequently add or remove Certificates or CRLs from the Collection.", "history": "Added in API level 1", "FullName": "public Collection<?> getCollection ()"}}, "Inheritance": [], "ClassName": "java.security.cert.CollectionCertStoreParameters", "ClassDesc": "Parameters used as input for the Collection CertStore algorithm. This class is used to provide necessary configuration parameters to implementations of the Collection CertStore algorithm. The only parameter included in this class is the Collection from which the CertStore will retrieve certificates and CRLs. Unless otherwise specified, the methods defined in this class are not thread-safe. Multiple threads that need to access a single object concurrently should synchronize amongst themselves and provide the necessary locking. Multiple threads each manipulating separate objects need not synchronize."}