{"Functions": {"printStackTrace()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Prints this throwable and its backtrace to the standard error stream. This method prints a stack trace for this Throwable object on the error output stream that is the value of the field System.err. The first line of output contains the result of the @B_java#lang#Throwable#toString_E@ method for this object. Remaining lines represent data previously recorded by the method @B_java#lang#Throwable#fillInStackTrace_E@. The format of this information depends on the implementation, but the following example may be regarded as typical: \"...\". These lines indicate that the remainder of the stack trace for this exception matches the indicated number of frames from the bottom of the stack trace of the exception that was caused by this exception (the \"enclosing\" exception). This shorthand can greatly reduce the length of the output in the common case where a wrapped exception is thrown from same method as the \"causative exception\" is caught. The above example was produced by running the program: try-with-resources statement). Any exceptions that were suppressed in order to deliver an exception are printed out beneath the stack trace. The format of this information depends on the implementation, but the following example may be regarded as typical: An exception can have both a cause and one or more suppressed exceptions:", "history": "Added in API level 8", "FullName": "public void printStackTrace ()"}, "getCause()": {"Returns": [["@B_java#lang#Throwable_E@", "the cause of this throwable or null if the cause is nonexistent or unknown."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the cause of this throwable or null if the cause is nonexistent or unknown. (The cause is the throwable that caused this throwable to get thrown.) This implementation returns the cause that was supplied via one of the constructors requiring a Throwable, or that was set after creation with the @B_java#lang#Throwable#initCause_E@ method. While it is typically unnecessary to override this method, a subclass can override it to return a cause set by some other means. This is appropriate for a \"legacy chained throwable\" that predates the addition of chained exceptions to Throwable. Note that it is PrintStackTrace methods, all of which invoke the getCause method to determine the cause of a throwable.", "history": "Added in API level 8", "FullName": "public Throwable getCause ()"}, "XPathException(java.lang.String)": {"Returns": [], "Parameters": [["@B_java#lang#String_E@", "String: The detail message."]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Constructs a new XPathException with the specified detail message. The cause is not initialized. If message is null, then a NullPointerException is thrown.", "history": "Added in API level 8", "FullName": "public XPathException (String message)"}, "printStackTrace(java.io.PrintWriter)": {"Returns": [], "Parameters": [["@B_java#io#PrintWriter_E@", "PrintWriter: PrintWriter to use for output"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Prints this throwable and its backtrace to the specified print writer.", "history": "Added in API level 8", "FullName": "public void printStackTrace (PrintWriter s)"}, "XPathException(java.lang.Throwable)": {"Returns": [], "Parameters": [["@B_java#lang#Throwable_E@", "Throwable: The cause."]], "Throws": [["@B_java#lang#NullPointerException_E@", "if cause is null."]], "SeeAlso": [], "Permissions": [], "Description": "Constructs a new XPathException with the specified cause. If cause is null, then a NullPointerException is thrown.", "history": "Added in API level 8", "FullName": "public XPathException (Throwable cause)"}, "printStackTrace(java.io.PrintStream)": {"Returns": [], "Parameters": [["@B_java#io#PrintStream_E@", "PrintStream: PrintStream to use for output"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Prints this throwable and its backtrace to the specified print stream.", "history": "Added in API level 8", "FullName": "public void printStackTrace (PrintStream s)"}}, "Inheritance": ["@B_java#lang#Throwable_E@", "@B_java#lang#Exception_E@"], "ClassName": "javax.xml.xpath.XPathException", "ClassDesc": "XPathException represents a generic XPath exception."}