{"Functions": {"ContentHandler()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "", "history": "added in API level 1", "FullName": "public ContentHandler ()"}, "getContent(java.net.URLConnection,java.lang.Class[])": {"Returns": [["@B_java#lang#Object_E@", "the object read by the ContentHandler that is the first match of the suggested types. null if none of the requested are supported."]], "Parameters": [["@B_java#net#URLConnection_E@", "URLConnection: a URL connection."], ["@B_java#lang#Class_E@", "Class: an array of types requested"]], "Throws": [["@B_java#io#IOException_E@", "if an I/O error occurs while reading the object."]], "SeeAlso": [], "Permissions": [], "Description": "Given a URL connect stream positioned at the beginning of the representation of an object, this method reads that stream and creates an object that matches one of the types specified. The default implementation of this method should call getContent() and screen the return type for a match of the suggested types.", "history": "Added in API level 1", "FullName": "public Object getContent (URLConnection urlc, Class[] classes)"}, "getContent(java.net.URLConnection)": {"Returns": [["@B_java#lang#Object_E@", "the object read by the ContentHandler."]], "Parameters": [["@B_java#net#URLConnection_E@", "URLConnection: a URL connection."]], "Throws": [["@B_java#io#IOException_E@", "if an I/O error occurs while reading the object."]], "SeeAlso": [], "Permissions": [], "Description": "Given a URL connect stream positioned at the beginning of the representation of an object, this method reads that stream and creates an object from it.", "history": "Added in API level 1", "FullName": "public abstract Object getContent (URLConnection urlc)"}}, "Inheritance": [], "ClassName": "java.net.ContentHandler", "ClassDesc": "The abstract class ContentHandler is the superclass of all classes that read an Object from a URLConnection. An application does not generally call the getContent method in this class directly. Instead, an application calls the getContent method in class URL or in URLConnection. The application's content handler factory (an instance of a class that implements the interface ContentHandlerFactory set up by a call to setContentHandler) is called with a String giving the MIME type of the object being received on the socket. The factory returns an instance of a subclass of ContentHandler, and its getContent method is called to create the object. If no content handler could be found, URLConnection will look for a content handler in a user-defineable set of places. By default it looks in sun.net.www.content, but users can define a vertical-bar delimited set of class prefixes to search through in addition by defining the java.content.handler.pkgs property. The class name must be of the form:"}