{"Functions": {"newPacker()": {"Returns": [["@B_java#util#jar#Pack200#Packer_E@", "A newly allocated Packer engine."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Obtain new instance of a class that implements Packer. If the system property If an implementation has not been specified with the system property, then the system-default implementation class is instantiated, and the result is returned. Note: The returned object is not guaranteed to operate correctly if multiple threads use it at the same time. A multi-threaded application should either allocate multiple packer engines, or else serialize use of one engine with a lock.", "history": "Added in API level 1", "FullName": "public static Pack200.Packer newPacker ()"}, "newUnpacker()": {"Returns": [["@B_java#util#jar#Pack200#Unpacker_E@", "A newly allocated Unpacker engine."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Obtain new instance of a class that implements Unpacker. If the system property If an implementation has not been specified with the system property, then the system-default implementation class is instantiated, and the result is returned. Note: The returned object is not guaranteed to operate correctly if multiple threads use it at the same time. A multi-threaded application should either allocate multiple unpacker engines, or else serialize use of one engine with a lock.", "history": "Added in API level 1", "FullName": "public static Pack200.Unpacker newUnpacker ()"}}, "Inheritance": [], "ClassName": "java.util.jar.Pack200", "ClassDesc": "Transforms a JAR file to or from a packed stream in Pack200 format. Please refer to Network Transfer Format JSR 200 Specification at Typically the packer engine is used by application developers to deploy or host JAR files on a website. The unpacker engine is used by deployment applications to transform the byte-stream back to JAR format. Here is an example using packer and unpacker: A Pack200 file compressed with gzip can be hosted on HTTP/1.1 web servers. The deployment applications can use \"Accept-Encoding=pack200-gzip\". This indicates to the server that the client application desires a version of the file encoded with Pack200 and further compressed with gzip. Please refer to Unless otherwise noted, passing a @B_java#lang#NullPointerException_E@ to be thrown."}