{"Functions": {"invoke(java.lang.Object,java.lang.reflect.Method,java.lang.Object[])": {"Returns": [["@B_java#lang#Object_E@", "the value to return from the method invocation on the proxy instance. If the declared return type of the interface method is a primitive type, then the value returned by this method must be an instance of the corresponding primitive wrapper class; otherwise, it must be a type assignable to the declared return type. If the value returned by this method is null and the interface method's return type is primitive, then a NullPointerException will be thrown by the method invocation on the proxy instance. If the value returned by this method is otherwise not compatible with the interface method's declared return type as described above, a ClassCastException will be thrown by the method invocation on the proxy instance."]], "Parameters": [["@B_java#lang#Object_E@", "Object: the proxy instance that the method was invoked on"], ["@B_java#lang#reflect#Method_E@", "Method: the Method instance corresponding to the interface method invoked on the proxy instance. The declaring class of the Method object will be the interface that the method was declared in, which may be a superinterface of the proxy interface that the proxy class inherits the method through."], ["@B_java#lang#Object_E@", "Object: an array of objects containing the values of the arguments passed in the method invocation on the proxy instance, or null if interface method takes no arguments. Arguments of primitive types are wrapped in instances of the appropriate primitive wrapper class, such as java.lang.Integer or java.lang.Boolean."]], "Throws": [["@B_java#lang#Throwable_E@", "the exception to throw from the method invocation on the proxy instance. The exception's type must be assignable either to any of the exception types declared in the throws clause of the interface method or to the unchecked exception types java.lang.RuntimeException or java.lang.Error. If a checked exception is thrown by this method that is not assignable to any of the exception types declared in the throws clause of the interface method, then an @B_java#lang#reflect#UndeclaredThrowableException_E@ containing the exception that was thrown by this method will be thrown by the method invocation on the proxy instance."]], "SeeAlso": ["@B_java#lang#reflect#UndeclaredThrowableException_E@"], "Permissions": [], "Description": "Processes a method invocation on a proxy instance and returns the result. This method will be invoked on an invocation handler when a method is invoked on a proxy instance that it is associated with.", "history": "Added in API level 1", "FullName": "public abstract Object invoke (Object proxy, Method method, Object[] args)"}}, "Inheritance": [], "ClassName": "java.lang.reflect.InvocationHandler", "ClassDesc": "InvocationHandler is the interface implemented by the Each proxy instance has an associated invocation handler. When a method is invoked on a proxy instance, the method invocation is encoded and dispatched to the invoke method of its invocation handler."}