{"Functions": {"toString()": {"Returns": [["", "a printable representation of this object."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a string containing a concise, human-readable description of this object. Subclasses are encouraged to override this method and provide an implementation that takes into account the object's type and data. The default implementation is equivalent to the following expression: See toString method.", "history": "Added in API level 1", "FullName": "public String toString ()"}, "sync()": {"Returns": [], "Parameters": [], "Throws": [["@B_java#io#SyncFailedException_E@", "Thrown when the buffers cannot be flushed, or because the system cannot guarantee that all the buffers have been synchronized with physical media."]], "SeeAlso": [], "Permissions": [], "Description": "Force all system buffers to synchronize with the underlying device. This method returns after all modified data and attributes of this FileDescriptor have been written to the relevant device(s). In particular, if this FileDescriptor refers to a physical storage medium, such as a file in a file system, sync will not return until all in-memory modified copies of buffers associated with this FileDescriptor have been written to the physical medium. sync is meant to be used by code that requires physical storage (such as a file) to be in a known state For example, a class that provided a simple transaction facility might use sync to ensure that all changes to a file caused by a given transaction were recorded on a storage medium. sync only affects buffers downstream of this FileDescriptor. If any in-memory buffering is being done by the application (for example, by a BufferedOutputStream object), those buffers must be flushed into the FileDescriptor (for example, by invoking OutputStream.flush) before that data will be affected by sync.", "history": "Added in API level 1", "FullName": "public void sync ()"}, "valid()": {"Returns": [["boolean", "true if the file descriptor object represents a valid, open file, socket, or other active I/O connection; false otherwise."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Tests if this file descriptor object is valid.", "history": "Added in API level 1", "FullName": "public boolean valid ()"}, "FileDescriptor()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Constructs an (invalid) FileDescriptor object.", "history": "Added in API level 1", "FullName": "public FileDescriptor ()"}}, "Inheritance": [], "ClassName": "java.io.FileDescriptor", "ClassDesc": "Instances of the file descriptor class serve as an opaque handle to the underlying machine-specific structure representing an open file, an open socket, or another source or sink of bytes. The main practical use for a file descriptor is to create a FileInputStream or FileOutputStream to contain it. Applications should not create their own file descriptors."}