{"Functions": {"ConstantCallSite(java.lang.invoke.MethodType,java.lang.invoke.MethodHandle)": {"Returns": [], "Parameters": [["@B_java#lang#invoke#MethodType_E@", "MethodType: the type of the method handle to be permanently associated with this call site"], ["@B_java#lang#invoke#MethodHandle_E@", "MethodHandle: a method handle to invoke (on the call site) to produce the call site's target"]], "Throws": [["@B_java#lang#invoke#WrongMethodTypeException_E@", "if the hook cannot be invoked on the required arguments, or if the target returned by the hook is not of the given targetType"], ["@B_java#lang#NullPointerException_E@", "if the hook returns a null value"], ["@B_java#lang#ClassCastException_E@", "if the hook returns something other than a MethodHandle"], ["@B_java#lang#Throwable_E@", "anything else thrown by the hook function"]], "SeeAlso": [], "Permissions": [], "Description": "Creates a call site with a permanent target, possibly bound to the call site itself. During construction of the call site, the createTargetHook is invoked to produce the actual target, as if by a call of the form (MethodHandle) createTargetHook.invoke(this). Note that user code cannot perform such an action directly in a subclass constructor, since the target must be fixed before the ConstantCallSite constructor returns. The hook is said to bind the call site to a target method handle, and a typical action would be someTarget.bindTo(this). However, the hook is free to take any action whatever, including ignoring the call site and returning a constant target. The result returned by the hook must be a method handle of exactly the same type as the call site. While the hook is being called, the new ConstantCallSite object is in a partially constructed state. In this state, a call to getTarget, or any other attempt to use the target, will result in an IllegalStateException. It is legal at all times to obtain the call site's type using the type method.", "history": "Added in API level 26", "FullName": "protected ConstantCallSite (MethodType targetType, MethodHandle createTargetHook)"}, "getTarget()": {"Returns": [["@B_java#lang#invoke#MethodHandle_E@", "the immutable linkage state of this call site, a constant method handle"]], "Parameters": [], "Throws": [["@B_java#lang#IllegalStateException_E@", "if the ConstantCallSite constructor has not completed"]], "SeeAlso": [], "Permissions": [], "Description": "Returns the target method of the call site, which behaves like a final field of the ConstantCallSite. That is, the target is always the original value passed to the constructor call which created this instance.", "history": "Added in API level 26", "FullName": "public final MethodHandle getTarget ()"}, "ConstantCallSite(java.lang.invoke.MethodHandle)": {"Returns": [], "Parameters": [["@B_java#lang#invoke#MethodHandle_E@", "MethodHandle: the target to be permanently associated with this call site"]], "Throws": [["@B_java#lang#NullPointerException_E@", "if the proposed target is null"]], "SeeAlso": [], "Permissions": [], "Description": "Creates a call site with a permanent target.", "history": "Added in API level 26", "FullName": "public ConstantCallSite (MethodHandle target)"}, "dynamicInvoker()": {"Returns": [["@B_java#lang#invoke#MethodHandle_E@", "the immutable linkage state of this call site, a constant method handle"]], "Parameters": [], "Throws": [["@B_java#lang#IllegalStateException_E@", "if the ConstantCallSite constructor has not completed"]], "SeeAlso": [], "Permissions": [], "Description": "Returns this call site's permanent target. Since that target will never change, this is a correct implementation of @B_java#lang#invoke#CallSite#dynamicInvoker_E@.", "history": "Added in API level 26", "FullName": "public final MethodHandle dynamicInvoker ()"}, "setTarget(java.lang.invoke.MethodHandle)": {"Returns": [], "Parameters": [["@B_java#lang#invoke#MethodHandle_E@", "MethodHandle: a new target proposed for the call site, which is ignored"]], "Throws": [["@B_java#lang#UnsupportedOperationException_E@", "because this kind of call site cannot change its target"]], "SeeAlso": [], "Permissions": [], "Description": "Always throws an @B_java#lang#UnsupportedOperationException_E@. This kind of call site cannot change its target.", "history": "Added in API level 26", "FullName": "public final void setTarget (MethodHandle ignore)"}}, "Inheritance": ["@B_java#lang#invoke#CallSite_E@"], "ClassName": "java.lang.invoke.ConstantCallSite", "ClassDesc": "A ConstantCallSite is a @B_java#lang#invoke#CallSite_E@ whose target is permanent, and can never be changed. An invokedynamic instruction linked to a ConstantCallSite is permanently bound to the call site's target."}