{"Functions": {"minusSeconds(long)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the specified seconds subtracted, not null"]], "Parameters": [["long", "long: the seconds to subtract, positive or negative"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the result exceeds the maximum or minimum instant"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified duration in seconds subtracted. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant minusSeconds (long secondsToSubtract)"}, "plusNanos(long)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the specified nanoseconds added, not null"]], "Parameters": [["long", "long: the nanoseconds to add, positive or negative"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the result exceeds the maximum or minimum instant"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified duration in nanoseconds added. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant plusNanos (long nanosToAdd)"}, "atOffset(java.time.ZoneOffset)": {"Returns": [["@B_java#time#OffsetDateTime_E@", "the offset date-time formed from this instant and the specified offset, not null"]], "Parameters": [["@B_java#time#ZoneOffset_E@", "ZoneOffset: the offset to combine with, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the result exceeds the supported range"]], "SeeAlso": [], "Permissions": [], "Description": "Combines this instant with an offset to create an OffsetDateTime. This returns an OffsetDateTime formed from this instant at the specified offset from UTC/Greenwich. An exception will be thrown if the instant is too large to fit into an offset date-time. This method is equivalent to @B_java#time#OffsetDateTime#ofInstant_E@.", "history": "Added in API level 26", "FullName": "public OffsetDateTime atOffset (ZoneOffset offset)"}, "truncatedTo(java.time.temporal.TemporalUnit)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the time truncated, not null"]], "Parameters": [["@B_java#time#temporal#TemporalUnit_E@", "TemporalUnit: the unit to truncate to, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the unit is invalid for truncation"], ["@B_java#time#temporal#UnsupportedTemporalTypeException_E@", "if the unit is not supported"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this Instant truncated to the specified unit. Truncating the instant returns a copy of the original with fields smaller than the specified unit set to zero. The fields are calculated on the basis of using a UTC offset as seen in toString. For example, truncating with the @B_java#time#temporal#ChronoUnit#MINUTES_E@ unit will round down to the nearest minute, setting the seconds and nanoseconds to zero. The unit must have a @B_java#time#temporal#ChronoUnit_E@ and @B_java#time#temporal#ChronoUnit#DAYS_E@. Other units throw an exception. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant truncatedTo (TemporalUnit unit)"}, "plus(long,java.time.temporal.TemporalUnit)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the specified amount added, not null"]], "Parameters": [["long", "long: the amount of the unit to add to the result, may be negative"], ["@B_java#time#temporal#TemporalUnit_E@", "TemporalUnit: the unit of the amount to add, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the addition cannot be made"], ["@B_java#time#temporal#UnsupportedTemporalTypeException_E@", "if the unit is not supported"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified amount added. This returns an Instant, based on this one, with the amount in terms of the unit added. If it is not possible to add the amount, because the unit is not supported or for some other reason, an exception is thrown. If the field is a @B_java#time#temporal#ChronoUnit_E@ then the addition is implemented here. The supported fields behave as follows: NANOS - Returns a Instant with the specified number of nanoseconds added. This is equivalent to @B_java#time#Instant#plusNanos_E@. MICROS - Returns a Instant with the specified number of microseconds added. This is equivalent to @B_java#time#Instant#plusNanos_E@ with the amount multiplied by 1,000. MILLIS - Returns a Instant with the specified number of milliseconds added. This is equivalent to @B_java#time#Instant#plusNanos_E@ with the amount multiplied by 1,000,000. SECONDS - Returns a Instant with the specified number of seconds added. This is equivalent to @B_java#time#Instant#plusSeconds_E@. MINUTES - Returns a Instant with the specified number of minutes added. This is equivalent to @B_java#time#Instant#plusSeconds_E@ with the amount multiplied by 60. HOURS - Returns a Instant with the specified number of hours added. This is equivalent to @B_java#time#Instant#plusSeconds_E@ with the amount multiplied by 3,600. HALF_DAYS - Returns a Instant with the specified number of half-days added. This is equivalent to @B_java#time#Instant#plusSeconds_E@ with the amount multiplied by 43,200 (12 hours). DAYS - Returns a Instant with the specified number of days added. This is equivalent to @B_java#time#Instant#plusSeconds_E@ with the amount multiplied by 86,400 (24 hours). All other ChronoUnit instances will throw an UnsupportedTemporalTypeException. If the field is not a ChronoUnit, then the result of this method is obtained by invoking TemporalUnit.addTo(Temporal, long) passing this as the argument. In this case, the unit determines whether and how to perform the addition. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant plus (long amountToAdd, TemporalUnit unit)"}, "ofEpochSecond(long, long)": {"Returns": [["@B_java#time#Instant_E@", "an instant, not null"]], "Parameters": [["long", "long: the number of seconds from 1970-01-01T00:00:00Z"], ["long", "long: the nanosecond adjustment to the number of seconds, positive or negative"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the instant exceeds the maximum or minimum instant"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Obtains an instance of Instant using seconds from the epoch of 1970-01-01T00:00:00Z and nanosecond fraction of second. This method allows an arbitrary number of nanoseconds to be passed in. The factory will alter the values of the second and nanosecond in order to ensure that the stored nanosecond is in the range 0 to 999,999,999. For example, the following will result in the exactly the same instant:", "history": "added in API level 26", "FullName": "public static Instant ofEpochSecond (long epochSecond, long nanoAdjustment)"}, "isSupported(java.time.temporal.TemporalField)": {"Returns": [["boolean", "true if the field is supported on this instant, false if not"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to check, null returns false"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Checks if the specified field is supported. This checks if this instant can be queried for the specified field. If false, then calling the @B_java#time#Instant#range_E@, @B_java#time#Instant#get_E@ and @B_java#time#Instant#with_E@ methods will throw an exception. If the field is a @B_java#time#temporal#ChronoField_E@ then the query is implemented here. The supported fields are: NANO_OF_SECOND MICRO_OF_SECOND MILLI_OF_SECOND INSTANT_SECONDS All other ChronoField instances will return false. If the field is not a ChronoField, then the result of this method is obtained by invoking TemporalField.isSupportedBy(TemporalAccessor) passing this as the argument. Whether the field is supported is determined by the field.", "history": "Added in API level 26", "FullName": "public boolean isSupported (TemporalField field)"}, "adjustInto(java.time.temporal.Temporal)": {"Returns": [["@B_java#time#temporal#Temporal_E@", "the adjusted object, not null"]], "Parameters": [["@B_java#time#temporal#Temporal_E@", "Temporal: the target object to be adjusted, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if unable to make the adjustment"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Adjusts the specified temporal object to have this instant. This returns a temporal object of the same observable type as the input with the instant changed to be the same as this. The adjustment is equivalent to using @B_java#time#temporal#Temporal#with_E@ twice, passing @B_java#time#temporal#ChronoField#INSTANT_SECONDS_E@ and @B_java#time#temporal#ChronoField#NANO_OF_SECOND_E@ as the fields. In most cases, it is clearer to reverse the calling pattern by using @B_java#time#temporal#Temporal#with_E@: This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Temporal adjustInto (Temporal temporal)"}, "minus(long, java.time.temporal.TemporalUnit)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the specified amount subtracted, not null"]], "Parameters": [["long", "long: the amount of the unit to subtract from the result, may be negative"], ["@B_java#time#temporal#TemporalUnit_E@", "TemporalUnit: the unit of the amount to subtract, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the subtraction cannot be made"], ["@B_java#time#temporal#UnsupportedTemporalTypeException_E@", "if the unit is not supported"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified amount subtracted. This returns a Instant, based on this one, with the amount in terms of the unit subtracted. If it is not possible to subtract the amount, because the unit is not supported or for some other reason, an exception is thrown. This method is equivalent to @B_java#time#Instant#plus_E@ with the amount negated. See that method for a full description of how addition, and thus subtraction, works. This instance is immutable and unaffected by this method call.", "history": "added in API level 27", "FullName": "public Instant minus (long amountToSubtract, TemporalUnit unit)"}, "isAfter(java.time.Instant)": {"Returns": [["boolean", "true if this instant is after the specified instant"]], "Parameters": [["@B_java#time#Instant_E@", "Instant: the other instant to compare to, not null"]], "Throws": [["@B_java#lang#NullPointerException_E@", "if otherInstant is null"]], "SeeAlso": [], "Permissions": [], "Description": "Checks if this instant is after the specified instant. The comparison is based on the time-line position of the instants.", "history": "Added in API level 26", "FullName": "public boolean isAfter (Instant otherInstant)"}, "now(java.time.Clock)": {"Returns": [["@B_java#time#Instant_E@", "the current instant, not null"]], "Parameters": [["@B_java#time#Clock_E@", "Clock: the clock to use, not null"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Obtains the current instant from the specified clock. This will query the specified clock to obtain the current time. Using this method allows the use of an alternate clock for testing. The alternate clock may be introduced using @B_java#time#Clock_E@.", "history": "Added in API level 26", "FullName": "public static Instant now (Clock clock)"}, "ofEpochMilli(long)": {"Returns": [["@B_java#time#Instant_E@", "an instant, not null"]], "Parameters": [["long", "long: the number of milliseconds from 1970-01-01T00:00:00Z"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the instant exceeds the maximum or minimum instant"]], "SeeAlso": [], "Permissions": [], "Description": "Obtains an instance of Instant using milliseconds from the epoch of 1970-01-01T00:00:00Z. The seconds and nanoseconds are extracted from the specified milliseconds.", "history": "Added in API level 26", "FullName": "public static Instant ofEpochMilli (long epochMilli)"}, "toEpochMilli()": {"Returns": [["long", "the number of milliseconds since the epoch of 1970-01-01T00:00:00Z"]], "Parameters": [], "Throws": [["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Converts this instant to the number of milliseconds from the epoch of 1970-01-01T00:00:00Z. If this instant represents a point on the time-line too far in the future or past to fit in a long milliseconds, then an exception is thrown. If this instant has greater than millisecond precision, then the conversion will drop any excess precision information as though the amount in nanoseconds was subject to integer division by one million.", "history": "Added in API level 26", "FullName": "public long toEpochMilli ()"}, "getLong(java.time.temporal.TemporalField)": {"Returns": [["long", "the value for the field"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to get, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if a value for the field cannot be obtained"], ["@B_java#time#temporal#UnsupportedTemporalTypeException_E@", "if the field is not supported"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Gets the value of the specified field from this instant as a long. This queries this instant for the value of the specified field. If it is not possible to return the value, because the field is not supported or for some other reason, an exception is thrown. If the field is a @B_java#time#temporal#ChronoField_E@ then the query is implemented here. The @B_java#time#Instant#isSupported_E@ will return valid values based on this date-time. All other ChronoField instances will throw an UnsupportedTemporalTypeException. If the field is not a ChronoField, then the result of this method is obtained by invoking TemporalField.getFrom(TemporalAccessor) passing this as the argument. Whether the value can be obtained, and what the value represents, is determined by the field.", "history": "Added in API level 26", "FullName": "public long getLong (TemporalField field)"}, "compareTo(java.time.Instant)": {"Returns": [["int", "the comparator value, negative if less, positive if greater"]], "Parameters": [["@B_java#time#Instant_E@", "Instant: the other instant to compare to, not null"]], "Throws": [["@B_java#lang#NullPointerException_E@", "if otherInstant is null"]], "SeeAlso": [], "Permissions": [], "Description": "Compares this instant to the specified instant. The comparison is based on the time-line position of the instants. It is \"consistent with equals\", as defined by @B_java#lang#Comparable_E@.", "history": "Added in API level 26", "FullName": "public int compareTo (Instant otherInstant)"}, "equals(java.lang.Object)": {"Returns": [["boolean", "true if the other instant is equal to this one"]], "Parameters": [["@B_java#lang#Object_E@", "Object: the other instant, null returns false"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Checks if this instant is equal to the specified instant. The comparison is based on the time-line position of the instants.", "history": "Added in API level 26", "FullName": "public boolean equals (Object otherInstant)"}, "minusNanos(long)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the specified nanoseconds subtracted, not null"]], "Parameters": [["long", "long: the nanoseconds to subtract, positive or negative"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the result exceeds the maximum or minimum instant"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified duration in nanoseconds subtracted. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant minusNanos (long nanosToSubtract)"}, "with(java.time.temporal.TemporalField,long)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this with the specified field set, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to set in the result, not null"], ["long", "long: the new value of the field in the result"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the field cannot be set"], ["@B_java#time#temporal#UnsupportedTemporalTypeException_E@", "if the field is not supported"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified field set to a new value. This returns an Instant, based on this one, with the value for the specified field changed. If it is not possible to set the value, because the field is not supported or for some other reason, an exception is thrown. If the field is a @B_java#time#temporal#ChronoField_E@ then the adjustment is implemented here. The supported fields behave as follows: NANO_OF_SECOND - Returns an Instant with the specified nano-of-second. The epoch-second will be unchanged. MICRO_OF_SECOND - Returns an Instant with the nano-of-second replaced by the specified micro-of-second multiplied by 1,000. The epoch-second will be unchanged. MILLI_OF_SECOND - Returns an Instant with the nano-of-second replaced by the specified milli-of-second multiplied by 1,000,000. The epoch-second will be unchanged. INSTANT_SECONDS - Returns an Instant with the specified epoch-second. The nano-of-second will be unchanged. In all cases, if the new value is outside the valid range of values for the field then a DateTimeException will be thrown. All other ChronoField instances will throw an UnsupportedTemporalTypeException. If the field is not a ChronoField, then the result of this method is obtained by invoking TemporalField.adjustInto(Temporal, long) passing this as the argument. In this case, the field determines whether and how to adjust the instant. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant with (TemporalField field, long newValue)"}, "minus(java.time.temporal.TemporalAmount)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the subtraction made, not null"]], "Parameters": [["@B_java#time#temporal#TemporalAmount_E@", "TemporalAmount: the amount to subtract, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the subtraction cannot be made"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified amount subtracted. This returns an Instant, based on this one, with the specified amount subtracted. The amount is typically @B_java#time#Duration_E@ but may be any other type implementing the @B_java#time#temporal#TemporalAmount_E@ interface. The calculation is delegated to the amount object by calling @B_java#time#temporal#TemporalAmount#subtractFrom_E@. The amount implementation is free to implement the subtraction in any way it wishes, however it typically calls back to @B_java#time#Instant#minus_E@. Consult the documentation of the amount implementation to determine if it can be successfully subtracted. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant minus (TemporalAmount amountToSubtract)"}, "now()": {"Returns": [["@B_java#time#Instant_E@", "the current instant using the system clock, not null"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Obtains the current instant from the system clock. This will query the @B_java#time#Clock#systemUTC_E@ to obtain the current instant. Using this method will prevent the ability to use an alternate time-source for testing because the clock is effectively hard-coded.", "history": "Added in API level 26", "FullName": "public static Instant now ()"}, "with(java.time.temporal.TemporalField, long)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this with the specified field set, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to set in the result, not null"], ["long", "long: the new value of the field in the result"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the field cannot be set"], ["@B_java#time#temporal#UnsupportedTemporalTypeException_E@", "if the field is not supported"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified field set to a new value. This returns an Instant, based on this one, with the value for the specified field changed. If it is not possible to set the value, because the field is not supported or for some other reason, an exception is thrown. If the field is a @B_java#time#temporal#ChronoField_E@ then the adjustment is implemented here. The supported fields behave as follows: NANO_OF_SECOND - Returns an Instant with the specified nano-of-second. The epoch-second will be unchanged. MICRO_OF_SECOND - Returns an Instant with the nano-of-second replaced by the specified micro-of-second multiplied by 1,000. The epoch-second will be unchanged. MILLI_OF_SECOND - Returns an Instant with the nano-of-second replaced by the specified milli-of-second multiplied by 1,000,000. The epoch-second will be unchanged. INSTANT_SECONDS - Returns an Instant with the specified epoch-second. The nano-of-second will be unchanged. In all cases, if the new value is outside the valid range of values for the field then a DateTimeException will be thrown. All other ChronoField instances will throw an UnsupportedTemporalTypeException. If the field is not a ChronoField, then the result of this method is obtained by invoking TemporalField.adjustInto(Temporal, long) passing this as the argument. In this case, the field determines whether and how to adjust the instant. This instance is immutable and unaffected by this method call.", "history": "added in API level 26", "FullName": "public Instant with (TemporalField field, long newValue)"}, "range(java.time.temporal.TemporalField)": {"Returns": [["@B_java#time#temporal#ValueRange_E@", "the range of valid values for the field, not null"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to query the range for, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the range for the field cannot be obtained"], ["@B_java#time#temporal#UnsupportedTemporalTypeException_E@", "if the field is not supported"]], "SeeAlso": [], "Permissions": [], "Description": "Gets the range of valid values for the specified field. The range object expresses the minimum and maximum valid values for a field. This instant is used to enhance the accuracy of the returned range. If it is not possible to return the range, because the field is not supported or for some other reason, an exception is thrown. If the field is a @B_java#time#temporal#ChronoField_E@ then the query is implemented here. The @B_java#time#Instant#isSupported_E@ will return appropriate range instances. All other ChronoField instances will throw an UnsupportedTemporalTypeException. If the field is not a ChronoField, then the result of this method is obtained by invoking TemporalField.rangeRefinedBy(TemporalAccessor) passing this as the argument. Whether the range can be obtained is determined by the field.", "history": "Added in API level 26", "FullName": "public ValueRange range (TemporalField field)"}, "toString()": {"Returns": [["@B_java#lang#String_E@", "an ISO-8601 representation of this instant, not null"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "A string representation of this instant using ISO-8601 representation. The format used is the same as @B_java#time#format#DateTimeFormatter#ISO_INSTANT_E@.", "history": "Added in API level 26", "FullName": "public String toString ()"}, "plus(java.time.temporal.TemporalAmount)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the addition made, not null"]], "Parameters": [["@B_java#time#temporal#TemporalAmount_E@", "TemporalAmount: the amount to add, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the addition cannot be made"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified amount added. This returns an Instant, based on this one, with the specified amount added. The amount is typically @B_java#time#Duration_E@ but may be any other type implementing the @B_java#time#temporal#TemporalAmount_E@ interface. The calculation is delegated to the amount object by calling @B_java#time#temporal#TemporalAmount#addTo_E@. The amount implementation is free to implement the addition in any way it wishes, however it typically calls back to @B_java#time#Instant#plus_E@. Consult the documentation of the amount implementation to determine if it can be successfully added. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant plus (TemporalAmount amountToAdd)"}, "query(java.time.temporal.TemporalQuery<R>)": {"Returns": [["R", "the query result, null may be returned (defined by the query)"]], "Parameters": [["@B_java#time#temporal#TemporalQuery_E@", "TemporalQuery: the query to invoke, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if unable to query (defined by the query)"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs (defined by the query)"]], "SeeAlso": [], "Permissions": [], "Description": "Queries this instant using the specified query. This queries this instant using the specified query strategy object. The TemporalQuery object defines the logic to be used to obtain the result. Read the documentation of the query to understand what the result of this method will be. The result of this method is obtained by invoking the @B_java#time#temporal#TemporalQuery#queryFrom_E@ method on the specified query passing this as the argument.", "history": "Added in API level 26", "FullName": "public R query (TemporalQuery<R> query)"}, "getEpochSecond()": {"Returns": [["long", "the seconds from the epoch of 1970-01-01T00:00:00Z"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Gets the number of seconds from the Java epoch of 1970-01-01T00:00:00Z. The epoch second count is a simple incrementing count of seconds where second 0 is 1970-01-01T00:00:00Z. The nanosecond part of the day is returned by getNanosOfSecond.", "history": "Added in API level 26", "FullName": "public long getEpochSecond ()"}, "until(java.time.temporal.Temporal,java.time.temporal.TemporalUnit)": {"Returns": [["long", "the amount of time between this instant and the end instant"]], "Parameters": [["@B_java#time#temporal#Temporal_E@", "Temporal: the end date, exclusive, which is converted to an Instant, not null"], ["@B_java#time#temporal#TemporalUnit_E@", "TemporalUnit: the unit to measure the amount in, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the amount cannot be calculated, or the end temporal cannot be converted to an Instant"], ["@B_java#time#temporal#UnsupportedTemporalTypeException_E@", "if the unit is not supported"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Calculates the amount of time until another instant in terms of the specified unit. This calculates the amount of time between two Instant objects in terms of a single TemporalUnit. The start and end points are this and the specified instant. The result will be negative if the end is before the start. The calculation returns a whole number, representing the number of complete units between the two instants. The Temporal passed to this method is converted to a Instant using @B_java#time#Instant#from_E@. For example, the amount in days between two dates can be calculated using startInstant.until(endInstant, SECONDS). There are two equivalent ways of using this method. The first is to invoke this method. The second is to use @B_java#time#temporal#TemporalUnit#between_E@: The calculation is implemented in this method for @B_java#time#temporal#ChronoUnit_E@. The units NANOS, MICROS, MILLIS, SECONDS, MINUTES, HOURS, HALF_DAYS and DAYS are supported. Other ChronoUnit values will throw an exception. If the unit is not a ChronoUnit, then the result of this method is obtained by invoking TemporalUnit.between(Temporal, Temporal) passing this as the first argument and the converted input temporal as the second argument. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public long until (Temporal endExclusive, TemporalUnit unit)"}, "ofEpochSecond(long,long)": {"Returns": [["@B_java#time#Instant_E@", "an instant, not null"]], "Parameters": [["long", "long: the number of seconds from 1970-01-01T00:00:00Z"], ["long", "long: the nanosecond adjustment to the number of seconds, positive or negative"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the instant exceeds the maximum or minimum instant"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Obtains an instance of Instant using seconds from the epoch of 1970-01-01T00:00:00Z and nanosecond fraction of second. This method allows an arbitrary number of nanoseconds to be passed in. The factory will alter the values of the second and nanosecond in order to ensure that the stored nanosecond is in the range 0 to 999,999,999. For example, the following will result in the exactly the same instant:", "history": "Added in API level 26", "FullName": "public static Instant ofEpochSecond (long epochSecond, long nanoAdjustment)"}, "isBefore(java.time.Instant)": {"Returns": [["boolean", "true if this instant is before the specified instant"]], "Parameters": [["@B_java#time#Instant_E@", "Instant: the other instant to compare to, not null"]], "Throws": [["@B_java#lang#NullPointerException_E@", "if otherInstant is null"]], "SeeAlso": [], "Permissions": [], "Description": "Checks if this instant is before the specified instant. The comparison is based on the time-line position of the instants.", "history": "Added in API level 26", "FullName": "public boolean isBefore (Instant otherInstant)"}, "plusMillis(long)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the specified milliseconds added, not null"]], "Parameters": [["long", "long: the milliseconds to add, positive or negative"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the result exceeds the maximum or minimum instant"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified duration in milliseconds added. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant plusMillis (long millisToAdd)"}, "minus(long,java.time.temporal.TemporalUnit)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the specified amount subtracted, not null"]], "Parameters": [["long", "long: the amount of the unit to subtract from the result, may be negative"], ["@B_java#time#temporal#TemporalUnit_E@", "TemporalUnit: the unit of the amount to subtract, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the subtraction cannot be made"], ["@B_java#time#temporal#UnsupportedTemporalTypeException_E@", "if the unit is not supported"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified amount subtracted. This returns a Instant, based on this one, with the amount in terms of the unit subtracted. If it is not possible to subtract the amount, because the unit is not supported or for some other reason, an exception is thrown. This method is equivalent to @B_java#time#Instant#plus_E@ with the amount negated. See that method for a full description of how addition, and thus subtraction, works. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant minus (long amountToSubtract, TemporalUnit unit)"}, "minusMillis(long)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the specified milliseconds subtracted, not null"]], "Parameters": [["long", "long: the milliseconds to subtract, positive or negative"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the result exceeds the maximum or minimum instant"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified duration in milliseconds subtracted. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant minusMillis (long millisToSubtract)"}, "with(java.time.temporal.TemporalAdjuster)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this with the adjustment made, not null"]], "Parameters": [["@B_java#time#temporal#TemporalAdjuster_E@", "TemporalAdjuster: the adjuster to use, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the adjustment cannot be made"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns an adjusted copy of this instant. This returns an Instant, based on this one, with the instant adjusted. The adjustment takes place using the specified adjuster strategy object. Read the documentation of the adjuster to understand what adjustment will be made. The result of this method is obtained by invoking the @B_java#time#temporal#TemporalAdjuster#adjustInto_E@ method on the specified adjuster passing this as the argument. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant with (TemporalAdjuster adjuster)"}, "atZone(java.time.ZoneId)": {"Returns": [["@B_java#time#ZonedDateTime_E@", "the zoned date-time formed from this instant and the specified zone, not null"]], "Parameters": [["@B_java#time#ZoneId_E@", "ZoneId: the zone to combine with, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the result exceeds the supported range"]], "SeeAlso": [], "Permissions": [], "Description": "Combines this instant with a time-zone to create a ZonedDateTime. This returns an ZonedDateTime formed from this instant at the specified time-zone. An exception will be thrown if the instant is too large to fit into a zoned date-time. This method is equivalent to @B_java#time#ZonedDateTime#ofInstant_E@.", "history": "Added in API level 26", "FullName": "public ZonedDateTime atZone (ZoneId zone)"}, "get(java.time.temporal.TemporalField)": {"Returns": [["int", "the value for the field"]], "Parameters": [["@B_java#time#temporal#TemporalField_E@", "TemporalField: the field to get, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if a value for the field cannot be obtained or the value is outside the range of valid values for the field"], ["@B_java#time#temporal#UnsupportedTemporalTypeException_E@", "if the field is not supported or the range of values exceeds an int"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Gets the value of the specified field from this instant as an int. This queries this instant for the value of the specified field. The returned value will always be within the valid range of values for the field. If it is not possible to return the value, because the field is not supported or for some other reason, an exception is thrown. If the field is a @B_java#time#temporal#ChronoField_E@ then the query is implemented here. The @B_java#time#Instant#isSupported_E@ will return valid values based on this date-time, except INSTANT_SECONDS which is too large to fit in an int and throws a DateTimeException. All other ChronoField instances will throw an UnsupportedTemporalTypeException. If the field is not a ChronoField, then the result of this method is obtained by invoking TemporalField.getFrom(TemporalAccessor) passing this as the argument. Whether the value can be obtained, and what the value represents, is determined by the field.", "history": "Added in API level 26", "FullName": "public int get (TemporalField field)"}, "plusSeconds(long)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the specified seconds added, not null"]], "Parameters": [["long", "long: the seconds to add, positive or negative"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the result exceeds the maximum or minimum instant"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified duration in seconds added. This instance is immutable and unaffected by this method call.", "history": "Added in API level 26", "FullName": "public Instant plusSeconds (long secondsToAdd)"}, "plus(long, java.time.temporal.TemporalUnit)": {"Returns": [["@B_java#time#Instant_E@", "an Instant based on this instant with the specified amount added, not null"]], "Parameters": [["long", "long: the amount of the unit to add to the result, may be negative"], ["@B_java#time#temporal#TemporalUnit_E@", "TemporalUnit: the unit of the amount to add, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the addition cannot be made"], ["@B_java#time#temporal#UnsupportedTemporalTypeException_E@", "if the unit is not supported"], ["@B_java#lang#ArithmeticException_E@", "if numeric overflow occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Returns a copy of this instant with the specified amount added. This returns an Instant, based on this one, with the amount in terms of the unit added. If it is not possible to add the amount, because the unit is not supported or for some other reason, an exception is thrown. If the field is a @B_java#time#temporal#ChronoUnit_E@ then the addition is implemented here. The supported fields behave as follows: NANOS - Returns a Instant with the specified number of nanoseconds added. This is equivalent to @B_java#time#Instant#plusNanos_E@. MICROS - Returns a Instant with the specified number of microseconds added. This is equivalent to @B_java#time#Instant#plusNanos_E@ with the amount multiplied by 1,000. MILLIS - Returns a Instant with the specified number of milliseconds added. This is equivalent to @B_java#time#Instant#plusNanos_E@ with the amount multiplied by 1,000,000. SECONDS - Returns a Instant with the specified number of seconds added. This is equivalent to @B_java#time#Instant#plusSeconds_E@. MINUTES - Returns a Instant with the specified number of minutes added. This is equivalent to @B_java#time#Instant#plusSeconds_E@ with the amount multiplied by 60. HOURS - Returns a Instant with the specified number of hours added. This is equivalent to @B_java#time#Instant#plusSeconds_E@ with the amount multiplied by 3,600. HALF_DAYS - Returns a Instant with the specified number of half-days added. This is equivalent to @B_java#time#Instant#plusSeconds_E@ with the amount multiplied by 43,200 (12 hours). DAYS - Returns a Instant with the specified number of days added. This is equivalent to @B_java#time#Instant#plusSeconds_E@ with the amount multiplied by 86,400 (24 hours). All other ChronoUnit instances will throw an UnsupportedTemporalTypeException. If the field is not a ChronoUnit, then the result of this method is obtained by invoking TemporalUnit.addTo(Temporal, long) passing this as the argument. In this case, the unit determines whether and how to perform the addition. This instance is immutable and unaffected by this method call.", "history": "added in API level 26", "FullName": "public Instant plus (long amountToAdd, TemporalUnit unit)"}, "parse(java.lang.CharSequence)": {"Returns": [["@B_java#time#Instant_E@", "the parsed instant, not null"]], "Parameters": [["@B_java#lang#CharSequence_E@", "CharSequence: the text to parse, not null"]], "Throws": [["@B_java#time#format#DateTimeParseException_E@", "if the text cannot be parsed"]], "SeeAlso": [], "Permissions": [], "Description": "Obtains an instance of Instant from a text string such as 2007-12-03T10:15:30.00Z. The string must represent a valid instant in UTC and is parsed using @B_java#time#format#DateTimeFormatter#ISO_INSTANT_E@.", "history": "Added in API level 26", "FullName": "public static Instant parse (CharSequence text)"}, "from(java.time.temporal.TemporalAccessor)": {"Returns": [["@B_java#time#Instant_E@", "the instant, not null"]], "Parameters": [["@B_java#time#temporal#TemporalAccessor_E@", "TemporalAccessor: the temporal object to convert, not null"]], "Throws": [["@B_java#time#DateTimeException_E@", "if unable to convert to an Instant"]], "SeeAlso": [], "Permissions": [], "Description": "Obtains an instance of Instant from a temporal object. This obtains an instant based on the specified temporal. A TemporalAccessor represents an arbitrary set of date and time information, which this factory converts to an instance of Instant. The conversion extracts the @B_java#time#temporal#ChronoField#INSTANT_SECONDS_E@ and @B_java#time#temporal#ChronoField#NANO_OF_SECOND_E@ fields. This method matches the signature of the functional interface @B_java#time#temporal#TemporalQuery_E@ allowing it to be used as a query via method reference, Instant::from.", "history": "Added in API level 26", "FullName": "public static Instant from (TemporalAccessor temporal)"}, "hashCode()": {"Returns": [["int", "a suitable hash code"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns a hash code for this instant.", "history": "Added in API level 26", "FullName": "public int hashCode ()"}, "isSupported(java.time.temporal.TemporalUnit)": {"Returns": [["boolean", "true if the unit can be added/subtracted, false if not"]], "Parameters": [["@B_java#time#temporal#TemporalUnit_E@", "TemporalUnit: the unit to check, null returns false"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Checks if the specified unit is supported. This checks if the specified unit can be added to, or subtracted from, this date-time. If false, then calling the @B_java#time#Instant#plus_E@ and @B_java#time#Instant#minus_E@ methods will throw an exception. If the unit is a @B_java#time#temporal#ChronoUnit_E@ then the query is implemented here. The supported units are: NANOS MICROS MILLIS SECONDS MINUTES HOURS HALF_DAYS DAYS All other ChronoUnit instances will return false. If the unit is not a ChronoUnit, then the result of this method is obtained by invoking TemporalUnit.isSupportedBy(Temporal) passing this as the argument. Whether the unit is supported is determined by the unit.", "history": "Added in API level 26", "FullName": "public boolean isSupported (TemporalUnit unit)"}, "getNano()": {"Returns": [["int", "the nanoseconds within the second, always positive, never exceeds 999,999,999"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Gets the number of nanoseconds, later along the time-line, from the start of the second. The nanosecond-of-second value measures the total number of nanoseconds from the second returned by getEpochSecond.", "history": "Added in API level 26", "FullName": "public int getNano ()"}, "ofEpochSecond(long)": {"Returns": [["@B_java#time#Instant_E@", "an instant, not null"]], "Parameters": [["long", "long: the number of seconds from 1970-01-01T00:00:00Z"]], "Throws": [["@B_java#time#DateTimeException_E@", "if the instant exceeds the maximum or minimum instant"]], "SeeAlso": [], "Permissions": [], "Description": "Obtains an instance of Instant using seconds from the epoch of 1970-01-01T00:00:00Z. The nanosecond field is set to zero.", "history": "Added in API level 26", "FullName": "public static Instant ofEpochSecond (long epochSecond)"}}, "Inheritance": [], "ClassName": "java.time.Instant", "ClassDesc": "An instantaneous point on the time-line. This class models a single instantaneous point on the time-line. This might be used to record event time-stamps in the application. The range of an instant requires the storage of a number larger than a long. To achieve this, the class stores a long representing epoch-seconds and an int representing nanosecond-of-second, which will always be between 0 and 999,999,999. The epoch-seconds are measured from the standard Java epoch of 1970-01-01T00:00:00Z where instants after the epoch have positive values, and earlier instants have negative values. For both the epoch-second and nanosecond parts, a larger value is always later on the time-line than a smaller value. The length of the solar day is the standard way that humans measure time. This has traditionally been subdivided into 24 hours of 60 minutes of 60 seconds, forming a 86400 second day. Modern timekeeping is based on atomic clocks which precisely define an SI second relative to the transitions of a Caesium atom. The length of an SI second was defined to be very close to the 86400th fraction of a day. Unfortunately, as the Earth rotates the length of the day varies. In addition, over time the average length of the day is getting longer as the Earth slows. As a result, the length of a solar day in 2012 is slightly longer than 86400 SI seconds. The actual length of any given day and the amount by which the Earth is slowing are not predictable and can only be determined by measurement. The UT1 time-scale captures the accurate length of day, but is only available some time after the day has completed. The UTC time-scale is a standard approach to bundle up all the additional fractions of a second from UT1 into whole seconds, known as The modern UTC time-scale was introduced in 1972, introducing the concept of whole leap-seconds. Between 1958 and 1972, the definition of UTC was complex, with minor sub-second leaps and alterations to the length of the notional second. As of 2012, discussions are underway to change the definition of UTC again, with the potential to remove leap seconds or introduce other changes. Given the complexity of accurate timekeeping described above, this Java API defines its own time-scale, the The Java Time-Scale divides each calendar day into exactly 86400 subdivisions, known as seconds. These seconds may differ from the SI second. It closely matches the de facto international civil time scale, the definition of which changes from time to time. The Java Time-Scale has slightly different definitions for different segments of the time-line, each based on the consensus international time scale that is used as the basis for civil time. Whenever the internationally-agreed time scale is modified or replaced, a new segment of the Java Time-Scale must be defined for it. Each segment must meet these requirements: the Java Time-Scale shall closely match the underlying international civil time scale; the Java Time-Scale shall exactly match the international civil time scale at noon each day; the Java Time-Scale shall have a precisely-defined relationship to the international civil time scale. There are currently, as of 2013, two segments in the Java time-scale. For the segment from 1972-11-03 (exact boundary discussed below) until further notice, the consensus international time scale is UTC (with leap seconds). In this segment, the Java Time-Scale is identical to For the segment prior to 1972-11-03, extending back arbitrarily far, the consensus international time scale is defined to be UT1, applied proleptically, which is equivalent to the (mean) solar time on the prime meridian (Greenwich). In this segment, the Java Time-Scale is identical to the consensus international time scale. The exact boundary between the two segments is the instant where UT1 = UTC between 1972-11-03T00:00 and 1972-11-04T12:00. Implementations of the Java time-scale using the JSR-310 API are not required to provide any clock that is sub-second accurate, or that progresses monotonically or smoothly. Implementations are therefore not required to actually perform the UTC-SLS slew or to otherwise be aware of leap seconds. JSR-310 does, however, require that implementations must document the approach they use when defining a clock representing the current instant. See @B_java#time#Clock_E@ for details on the available clocks. The Java time-scale is used for all date-time classes. This includes Instant, LocalDate, LocalTime, OffsetDateTime, ZonedDateTime and Duration."}