{"Functions": {"close()": {"Returns": [], "Parameters": [], "Throws": [["@B_java#io#IOException_E@", "If an I/O error occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Closes this channel. Any outstanding asynchronous operations upon this channel will complete with the exception @B_java#nio#channels#AsynchronousCloseException_E@. After a channel is closed, further attempts to initiate asynchronous I/O operations complete immediately with cause @B_java#nio#channels#ClosedChannelException_E@. This method otherwise behaves exactly as specified by the @B_java#nio#channels#Channel_E@ interface.", "history": "Added in API level 26", "FullName": "public abstract void close ()"}}, "Inheritance": [], "ClassName": "java.nio.channels.AsynchronousChannel", "ClassDesc": "A channel that supports asynchronous I/O operations. Asynchronous I/O operations will usually take one of two forms: state-less CompletionHandler is used to consume the result of many I/O operations. In the first form, the methods defined by the @B_java#util#concurrent#Future_E@ interface may be used to check if the operation has completed, wait for its completion, and to retrieve the result. In the second form, a @B_java#nio#channels#CompletionHandler_E@ is invoked to consume the result of the I/O operation when it completes or fails. A channel that implements this interface is asynchronously closeable: If an I/O operation is outstanding on the channel and the channel's @B_java#nio#channels#AsynchronousChannel#close_E@ method is invoked, then the I/O operation fails with the exception @B_java#nio#channels#AsynchronousCloseException_E@. Asynchronous channels are safe for use by multiple concurrent threads. Some channel implementations may support concurrent reading and writing, but may not allow more than one read and one write operation to be outstanding at any given time. The Future interface defines the @B_java#util#concurrent#Future#cancel_E@ method to cancel execution. This causes all threads waiting on the result of the I/O operation to throw @B_java#util#concurrent#CancellationException_E@. Whether the underlying I/O operation can be cancelled is highly implementation specific and therefore not specified. Where cancellation leaves the channel, or the entity to which it is connected, in an inconsistent state, then the channel is put into an implementation specific error state that prevents further attempts to initiate I/O operations that are read operation cause an unspecified runtime exception to be thrown. Similarly, if a write operation is cancelled but the implementation cannot guarantee that bytes have not been written to the channel then subsequent attempts to initiate a write will fail with an unspecified runtime exception. Where the @B_java#util#concurrent#Future#cancel_E@ method is invoked with the mayInterruptIfRunning parameter set to true then the I/O operation may be interrupted by closing the channel. In that case all threads waiting on the result of the I/O operation throw CancellationException and any other I/O operations outstanding on the channel complete with the exception @B_java#nio#channels#AsynchronousCloseException_E@. Where the cancel method is invoked to cancel read or write operations then it is recommended that all buffers used in the I/O operations be discarded or care taken to ensure that the buffers are not accessed while the channel remains open."}