{"Functions": {"load()": {"Returns": [["@B_java#nio#MappedByteBuffer_E@", "This buffer"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Loads this buffer's content into physical memory. This method makes a best effort to ensure that, when it returns, this buffer's content is resident in physical memory. Invoking this method may cause some number of page faults and I/O operations to occur.", "history": "Added in API level 1", "FullName": "public final MappedByteBuffer load ()"}, "force()": {"Returns": [["@B_java#nio#MappedByteBuffer_E@", "This buffer"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Forces any changes made to this buffer's content to be written to the storage device containing the mapped file. If the file mapped into this buffer resides on a local storage device then when this method returns it is guaranteed that all changes made to the buffer since it was created, or since this method was last invoked, will have been written to that device. If the file does not reside on a local device then no such guarantee is made. If this buffer was not mapped in read/write mode (@B_java#nio#channels#FileChannel#MapMode#READ_WRITE_E@) then invoking this method has no effect.", "history": "Added in API level 1", "FullName": "public final MappedByteBuffer force ()"}, "isLoaded()": {"Returns": [["boolean", "true if it is likely that this buffer's content is resident in physical memory"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Tells whether or not this buffer's content is resident in physical memory. A return value of The returned value is a hint, rather than a guarantee, because the underlying operating system may have paged out some of the buffer's data by the time that an invocation of this method returns.", "history": "Added in API level 1", "FullName": "public final boolean isLoaded ()"}}, "Inheritance": ["@B_java#nio#Buffer_E@", "@B_java#nio#ByteBuffer_E@"], "ClassName": "java.nio.MappedByteBuffer", "ClassDesc": "A direct byte buffer whose content is a memory-mapped region of a file. Mapped byte buffers are created via the @B_java#nio#channels#FileChannel#map_E@ method. This class extends the @B_java#nio#ByteBuffer_E@ class with operations that are specific to memory-mapped file regions. A mapped byte buffer and the file mapping that it represents remain valid until the buffer itself is garbage-collected. The content of a mapped byte buffer can change at any time, for example if the content of the corresponding region of the mapped file is changed by this program or another. Whether or not such changes occur, and when they occur, is operating-system dependent and therefore unspecified. All or part of a mapped byte buffer may become inaccessible at any time, for example if the mapped file is truncated. An attempt to access an inaccessible region of a mapped byte buffer will not change the buffer's content and will cause an unspecified exception to be thrown either at the time of the access or at some later time. It is therefore strongly recommended that appropriate precautions be taken to avoid the manipulation of a mapped file by this program, or by a concurrently running program, except to read or write the file's content. Mapped byte buffers otherwise behave no differently than ordinary direct byte buffers."}