{"Functions": {"getSystemId()": {"Returns": [["@B_java#lang#String_E@", "A string containing the system identifier, or null if none is available."]], "Parameters": [], "Throws": [], "SeeAlso": ["@B_javax#xml#transform#SourceLocator#getPublicId_E@"], "Permissions": [], "Description": "Return the system identifier for the current document event. The return value is the system identifier of the document entity or of the external parsed entity in which the markup that triggered the event appears. If the system identifier is a URL, the parser must resolve it fully before passing it to the application.", "history": "Added in API level 8", "FullName": "public abstract String getSystemId ()"}, "getLineNumber()": {"Returns": [["int", "The line number, or -1 if none is available."]], "Parameters": [], "Throws": [], "SeeAlso": ["@B_javax#xml#transform#SourceLocator#getColumnNumber_E@"], "Permissions": [], "Description": "Return the line number where the current document event ends. The return value is an approximation of the line number in the document entity or external parsed entity where the markup that triggered the event appears.", "history": "Added in API level 8", "FullName": "public abstract int getLineNumber ()"}, "getPublicId()": {"Returns": [["@B_java#lang#String_E@", "A string containing the public identifier, or null if none is available."]], "Parameters": [], "Throws": [], "SeeAlso": ["@B_javax#xml#transform#SourceLocator#getSystemId_E@"], "Permissions": [], "Description": "Return the public identifier for the current document event. The return value is the public identifier of the document entity or of the external parsed entity in which the markup that triggered the event appears.", "history": "Added in API level 8", "FullName": "public abstract String getPublicId ()"}, "getColumnNumber()": {"Returns": [["int", "The column number, or -1 if none is available."]], "Parameters": [], "Throws": [], "SeeAlso": ["@B_javax#xml#transform#SourceLocator#getLineNumber_E@"], "Permissions": [], "Description": "Return the character position where the current document event ends. The return value is an approximation of the column number in the document entity or external parsed entity where the markup that triggered the event appears.", "history": "Added in API level 8", "FullName": "public abstract int getColumnNumber ()"}}, "Inheritance": [], "ClassName": "javax.xml.transform.SourceLocator", "ClassDesc": "This interface is primarily for the purposes of reporting where an error occurred in the XML source or transformation instructions."}