{"Functions": {"getPath(java.lang.String,java.lang.String...)": {"Returns": [["@B_java#nio#file#Path_E@", "the resulting Path"]], "Parameters": [["@B_java#lang#String_E@", "String: the path string or initial part of the path string"], ["@B_java#lang#String_E@", "String: additional strings to be joined to form the path string"]], "Throws": [["@B_java#nio#file#InvalidPathException_E@", "If the path string cannot be converted"]], "SeeAlso": [], "Permissions": [], "Description": "Converts a path string, or a sequence of strings that when joined form a path string, to a Path. If more does not specify any elements then the value of the first parameter is the path string to convert. If more specifies one or more elements then each non-empty string, including first, is considered to be a sequence of name elements (see @B_java#nio#file#Path_E@) and is joined to form a path string. The details as to how the Strings are joined is provider specific but typically they will be joined using the @B_java#nio#file#FileSystem#getSeparator_E@ as the separator. For example, if the name separator is \"/\" and getPath(\"/foo\",\"bar\",\"gus\") is invoked, then the path string \"/foo/bar/gus\" is converted to a Path. A Path representing an empty path is returned if first is the empty string and more does not contain any non-empty strings. The parsing and conversion to a path object is inherently implementation dependent. In the simplest case, the path string is rejected, and @B_java#nio#file#InvalidPathException_E@ thrown, if the path string contains characters that cannot be converted to characters that are legal to the file store. For example, on UNIX systems, the NUL (\\u0000) character is not allowed to be present in a path. An implementation may choose to reject path strings that contain names that are longer than those allowed by any file store, and where an implementation supports a complex path syntax, it may choose to reject path strings that are badly formed. In the case of the default provider, path strings are parsed based on the definition of paths at the platform or virtual file system level. For example, an operating system may not allow specific characters to be present in a file name, but a specific underlying file store may impose different or additional restrictions on the set of legal characters. This method throws @B_java#nio#file#InvalidPathException_E@ when the path string cannot be converted to a path. Where possible, and where applicable, the exception is created with an @B_java#nio#file#InvalidPathException#getIndex_E@ value indicating the first position in the path parameter that caused the path string to be rejected.", "history": "Added in API level 26", "FullName": "public abstract Path getPath (String first, String... more)"}, "supportedFileAttributeViews()": {"Returns": [["@B_java#util#Set_E@", "An unmodifiable set of the names of the supported file attribute views"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the set of the @B_java#nio#file#attribute#AttributeView#name_E@ of the file attribute views supported by this FileSystem. The @B_java#nio#file#attribute#BasicFileAttributeView_E@ is required to be supported and therefore the set contains at least one element, \"basic\". The @B_java#nio#file#FileStore#supportsFileAttributeView_E@ method may be used to test if an underlying @B_java#nio#file#FileStore_E@ supports the file attributes identified by a file attribute view.", "history": "Added in API level 26", "FullName": "public abstract Set<String> supportedFileAttributeViews ()"}, "getRootDirectories()": {"Returns": [["@B_java#lang#Iterable_E@", "An object to iterate over the root directories"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns an object to iterate over the paths of the root directories. A file system provides access to a file store that may be composed of a number of distinct file hierarchies, each with its own top-level root directory. Unless denied by the security manager, each element in the returned iterator corresponds to the root directory of a distinct file hierarchy. The order of the elements is not defined. The file hierarchies may change during the lifetime of the Java virtual machine. For example, in some implementations, the insertion of removable media may result in the creation of a new file hierarchy with its own top-level directory. When a security manager is installed, it is invoked to check access to the each root directory. If denied, the root directory is not returned by the iterator. In the case of the default provider, the @B_java#lang#SecurityManager#checkRead_E@ method is invoked to check read access to each root directory. It is system dependent if the permission checks are done when the iterator is obtained or during iteration.", "history": "Added in API level 26", "FullName": "public abstract Iterable<Path> getRootDirectories ()"}, "getPath(java.lang.String, java.lang.String...)": {"Returns": [["@B_java#nio#file#Path_E@", "the resulting Path"]], "Parameters": [["@B_java#lang#String_E@", "String: the path string or initial part of the path string"], ["@B_java#lang#String_E@", "String: additional strings to be joined to form the path string"]], "Throws": [["@B_java#nio#file#InvalidPathException_E@", "If the path string cannot be converted"]], "SeeAlso": [], "Permissions": [], "Description": "Converts a path string, or a sequence of strings that when joined form a path string, to a Path. If more does not specify any elements then the value of the first parameter is the path string to convert. If more specifies one or more elements then each non-empty string, including first, is considered to be a sequence of name elements (see @B_java#nio#file#Path_E@) and is joined to form a path string. The details as to how the Strings are joined is provider specific but typically they will be joined using the @B_java#nio#file#FileSystem#getSeparator_E@ as the separator. For example, if the name separator is \"/\" and getPath(\"/foo\",\"bar\",\"gus\") is invoked, then the path string \"/foo/bar/gus\" is converted to a Path. A Path representing an empty path is returned if first is the empty string and more does not contain any non-empty strings. The parsing and conversion to a path object is inherently implementation dependent. In the simplest case, the path string is rejected, and @B_java#nio#file#InvalidPathException_E@ thrown, if the path string contains characters that cannot be converted to characters that are legal to the file store. For example, on UNIX systems, the NUL (\\u0000) character is not allowed to be present in a path. An implementation may choose to reject path strings that contain names that are longer than those allowed by any file store, and where an implementation supports a complex path syntax, it may choose to reject path strings that are badly formed. In the case of the default provider, path strings are parsed based on the definition of paths at the platform or virtual file system level. For example, an operating system may not allow specific characters to be present in a file name, but a specific underlying file store may impose different or additional restrictions on the set of legal characters. This method throws @B_java#nio#file#InvalidPathException_E@ when the path string cannot be converted to a path. Where possible, and where applicable, the exception is created with an @B_java#nio#file#InvalidPathException#getIndex_E@ value indicating the first position in the path parameter that caused the path string to be rejected.", "history": "added in API level 26", "FullName": "public abstract Path getPath (String first, String... more)"}, "isReadOnly()": {"Returns": [["boolean", "true if, and only if, this file system provides read-only access"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Tells whether or not this file system allows only read-only access to its file stores.", "history": "Added in API level 26", "FullName": "public abstract boolean isReadOnly ()"}, "newWatchService()": {"Returns": [["@B_java#nio#file#WatchService_E@", "a new watch service"]], "Parameters": [], "Throws": [["@B_java#lang#UnsupportedOperationException_E@", "If this FileSystem does not support watching file system objects for changes and events. This exception is not thrown by FileSystems created by the default provider."], ["@B_java#io#IOException_E@", "If an I/O error occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Constructs a new @B_java#nio#file#WatchService_E@ This method constructs a new watch service that may be used to watch registered objects for changes and events.", "history": "Added in API level 26", "FullName": "public abstract WatchService newWatchService ()"}, "close()": {"Returns": [], "Parameters": [], "Throws": [["@B_java#io#IOException_E@", "If an I/O error occurs"], ["@B_java#lang#UnsupportedOperationException_E@", "Thrown in the case of the default file system"]], "SeeAlso": [], "Permissions": [], "Description": "Closes this file system. After a file system is closed then all subsequent access to the file system, either by methods defined by this class or on objects associated with this file system, throw @B_java#nio#file#ClosedFileSystemException_E@. If the file system is already closed then invoking this method has no effect. Closing a file system will close all open @B_java#nio#channels#Channel_E@, @B_java#nio#file#DirectoryStream_E@, @B_java#nio#file#WatchService_E@, and other closeable objects associated with this file system. The @B_java#nio#file#FileSystems#getDefault_E@ file system cannot be closed.", "history": "Added in API level 26", "FullName": "public abstract void close ()"}, "isOpen()": {"Returns": [["boolean", "true if, and only if, this file system is open"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Tells whether or not this file system is open. File systems created by the default provider are always open.", "history": "Added in API level 26", "FullName": "public abstract boolean isOpen ()"}, "provider()": {"Returns": [["@B_java#nio#file#spi#FileSystemProvider_E@", "The provider that created this file system."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the provider that created this file system.", "history": "Added in API level 26", "FullName": "public abstract FileSystemProvider provider ()"}, "getSeparator()": {"Returns": [["@B_java#lang#String_E@", "The name separator"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the name separator, represented as a string. The name separator is used to separate names in a path string. An implementation may support multiple name separators in which case this method returns an implementation specific default name separator. This separator is used when creating path strings by invoking the @B_java#nio#file#Path#toString_E@ method. In the case of the default provider, this method returns the same separator as @B_java#io#File#separator_E@.", "history": "Added in API level 26", "FullName": "public abstract String getSeparator ()"}, "getUserPrincipalLookupService()": {"Returns": [["@B_java#nio#file#attribute#UserPrincipalLookupService_E@", "The UserPrincipalLookupService for this file system"]], "Parameters": [], "Throws": [["@B_java#lang#UnsupportedOperationException_E@", "If this FileSystem does not does have a lookup service"]], "SeeAlso": [], "Permissions": [], "Description": "Returns the UserPrincipalLookupService for this file system", "history": "Added in API level 26", "FullName": "public abstract UserPrincipalLookupService getUserPrincipalLookupService ()"}, "FileSystem()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Initializes a new instance of this class.", "history": "Added in API level 26", "FullName": "protected FileSystem ()"}, "getFileStores()": {"Returns": [["@B_java#lang#Iterable_E@", "An object to iterate over the backing file stores"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns an object to iterate over the underlying file stores. The elements of the returned iterator are the @B_java#nio#file#FileStore_E@ for this file system. The order of the elements is not defined and the file stores may change during the lifetime of the Java virtual machine. When an I/O error occurs, perhaps because a file store is not accessible, then it is not returned by the iterator. In the case of the default provider, and a security manager is installed, the security manager is invoked to check @B_java#lang#RuntimePermission_E@@B_java#lang#SecurityManager#checkRead_E@ method is invoked to check read access to the file store's top-most directory. If denied, the file store is not returned by the iterator. It is system dependent if the permission checks are done when the iterator is obtained or during iteration.", "history": "Added in API level 26", "FullName": "public abstract Iterable<FileStore> getFileStores ()"}, "getPathMatcher(java.lang.String)": {"Returns": [["@B_java#nio#file#PathMatcher_E@", "A path matcher that may be used to match paths against the pattern"]], "Parameters": [["@B_java#lang#String_E@", "String: The syntax and pattern"]], "Throws": [["@B_java#lang#IllegalArgumentException_E@", "If the parameter does not take the form: syntax:pattern"], ["@B_java#util#regex#PatternSyntaxException_E@", "If the pattern is invalid"], ["@B_java#lang#UnsupportedOperationException_E@", "If the pattern syntax is not known to the implementation"]], "SeeAlso": ["@B_java#nio#file#Files#newDirectoryStream_E@"], "Permissions": [], "Description": "Returns a PathMatcher that performs match operations on the String representation of @B_java#nio#file#Path_E@ objects by interpreting a given pattern. The syntaxAndPattern parameter identifies the syntax and the pattern and takes the form: ':' stands for itself. A FileSystem implementation supports the \"glob\" and \"regex\" syntaxes, and may support others. The value of the syntax component is compared without regard to case. When the syntax is \"glob\" then the String representation of the path is matched using a limited pattern language that resembles regular expressions but with a simpler syntax. For example: The following rules are used to interpret glob patterns: The * character matches zero or more @B_java#lang#Character_E@ of a @B_java#nio#file#Path#getName_E@ component without crossing directory boundaries. The ** characters matches zero or more @B_java#lang#Character_E@ crossing directory boundaries. The ? character matches exactly one character of a name component. The backslash character (\\) is used to escape characters that would otherwise be interpreted as special characters. The expression \\\\ matches a single backslash and \"\\{\" matches a left brace for example. The [ ] characters are a [abc] matches \"a\", \"b\", or \"c\". The hyphen (-) may be used to specify a range so [a-z] specifies a range that matches from \"a\" to \"z\" (inclusive). These forms can be mixed so [abce-g] matches \"a\", \"b\", \"c\", \"e\", \"f\" or \"g\". If the character after the [ is a ! then it is used for negation so [!a-c] matches any character except \"a\", \"b\", or \"c\". Within a bracket expression the *, ? and \\ characters match themselves. The (-) character matches itself if it is the first character within the brackets, or the first character after the ! if negating. The { } characters are a group of subpatterns, where the group matches if any subpattern in the group matches. The \",\" character is used to separate the subpatterns. Groups cannot be nested. Leading period\"*\" glob pattern matches file name \".login\". The @B_java#nio#file#Files#isHidden_E@ method may be used to test whether a file is considered hidden. All other characters match themselves in an implementation dependent manner. This includes characters representing any @B_java#nio#file#FileSystem#getSeparator_E@. The matching of @B_java#nio#file#Path#getRoot_E@ components is highly implementation-dependent and is not specified. When the syntax is \"regex\" then the pattern component is a regular expression as defined by the @B_java#util#regex#Pattern_E@ class. For both the glob and regex syntaxes, the matching details, such as whether the matching is case sensitive, are implementation-dependent and therefore not specified.", "history": "Added in API level 26", "FullName": "public abstract PathMatcher getPathMatcher (String syntaxAndPattern)"}}, "Inheritance": [], "ClassName": "java.nio.file.FileSystem", "ClassDesc": "Provides an interface to a file system and is the factory for objects to access files and other objects in the file system. The default file system, obtained by invoking the @B_java#nio#file#FileSystems#getDefault_E@ method, provides access to the file system that is accessible to the Java virtual machine. The @B_java#nio#file#FileSystems_E@ class defines methods to create file systems that provide access to other types of (custom) file systems. A file system is the factory for several types of objects: The @B_java#nio#file#FileSystem#getPath_E@ method converts a system dependent path string, returning a @B_java#nio#file#Path_E@ object that may be used to locate and access a file. The @B_java#nio#file#FileSystem#getPathMatcher_E@ method is used to create a @B_java#nio#file#PathMatcher_E@ that performs match operations on paths. The @B_java#nio#file#FileSystem#getFileStores_E@ method returns an iterator over the underlying @B_java#nio#file#FileStore_E@. The @B_java#nio#file#FileSystem#getUserPrincipalLookupService_E@ method returns the @B_java#nio#file#attribute#UserPrincipalLookupService_E@ to lookup users or groups by name. The @B_java#nio#file#FileSystem#newWatchService_E@ method creates a @B_java#nio#file#WatchService_E@ that may be used to watch objects for changes and events. File systems vary greatly. In some cases the file system is a single hierarchy of files with one top-level root directory. In other cases it may have several distinct file hierarchies, each with its own top-level root directory. The @B_java#nio#file#FileSystem#getRootDirectories_E@ method may be used to iterate over the root directories in the file system. A file system is typically composed of one or more underlying @B_java#nio#file#FileStore_E@ that provide the storage for the files. Theses file stores can also vary in the features they support, and the file attributes or meta-data that they associate with files. A file system is open upon creation and can be closed by invoking its @B_java#nio#file#FileSystem#close_E@ method. Once closed, any further attempt to access objects in the file system cause @B_java#nio#file#ClosedFileSystemException_E@ to be thrown. File systems created by the default @B_java#nio#file#spi#FileSystemProvider_E@ cannot be closed. A FileSystem can provide read-only or read-write access to the file system. Whether or not a file system provides read-only access is established when the FileSystem is created and can be tested by invoking its @B_java#nio#file#FileSystem#isReadOnly_E@ method. Attempts to write to file stores by means of an object associated with a read-only file system throws @B_java#nio#file#ReadOnlyFileSystemException_E@. File systems are safe for use by multiple concurrent threads. The @B_java#nio#file#FileSystem#close_E@ method may be invoked at any time to close a file system but whether a file system is close method then it may require to block until the first operation is complete. Closing a file system causes all open channels, watch services, and other @B_java#io#Closeable_E@ objects associated with the file system to be closed."}