{"Functions": {"SoftReference(T)": {"Returns": [], "Parameters": [["T", "T: object the new soft reference will refer to"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Creates a new soft reference that refers to the given object. The new reference is not registered with any queue.", "history": "Added in API level 1", "FullName": "public SoftReference (T referent)"}, "get()": {"Returns": [["T", "The object to which this reference refers, or null if this reference object has been cleared"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns this reference object's referent. If this reference object has been cleared, either by the program or by the garbage collector, then this method returns null.", "history": "Added in API level 1", "FullName": "public T get ()"}, "SoftReference(T,java.lang.ref.ReferenceQueue<?superT>)": {"Returns": [], "Parameters": [["T", "T: object the new soft reference will refer to"], ["@B_java#lang#ref#ReferenceQueue_E@", "ReferenceQueue: the queue with which the reference is to be registered, or null if registration is not required"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Creates a new soft reference that refers to the given object and is registered with the given queue.", "history": "Added in API level 1", "FullName": "public SoftReference (T referent, ReferenceQueue<? super T> q)"}}, "Inheritance": ["@B_java#lang#ref#Reference_E@"], "ClassName": "java.lang.ref.SoftReference<T>", "ClassDesc": "Soft reference objects, which are cleared at the discretion of the garbage collector in response to memory demand. Suppose that the garbage collector determines at a certain point in time that an object is All soft references to softly-reachable objects are guaranteed to have been cleared before the virtual machine throws an OutOfMemoryError. Otherwise no constraints are placed upon the time at which a soft reference will be cleared or the order in which a set of such references to different objects will be cleared. Virtual machine implementations are, however, encouraged to bias against clearing recently-created or recently-used soft references. The lack of information on the value to your application of each reference limits the usefulness of soft references. References that are cleared too early cause unnecessary work; those that are cleared too late waste memory. Most applications should use an android.util.LruCache instead of soft references. LruCache has an effective eviction policy and lets the user tune how much memory is allotted."}