{"Functions": {"getKeys()": {"Returns": [["@B_java#util#Enumeration_E@", "an Enumeration of the keys contained in this ResourceBundle and its parent bundles."]], "Parameters": [], "Throws": [], "SeeAlso": ["@B_java#util#ResourceBundle#keySet_E@"], "Permissions": [], "Description": "Returns an Enumeration of the keys contained in this ResourceBundle and its parent bundles.", "history": "Added in API level 1", "FullName": "public Enumeration<String> getKeys ()"}, "ListResourceBundle()": {"Returns": [], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Sole constructor. (For invocation by subclass constructors, typically implicit.)", "history": "Added in API level 1", "FullName": "public ListResourceBundle ()"}, "handleKeySet()": {"Returns": [["@B_java#util#Set_E@", "a Set of the keys contained only in this ResourceBundle"]], "Parameters": [], "Throws": [], "SeeAlso": ["@B_java#util#ResourceBundle#keySet_E@"], "Permissions": [], "Description": "Returns a Set of the keys contained only in this ResourceBundle.", "history": "Added in API level 9", "FullName": "protected Set<String> handleKeySet ()"}, "handleGetObject(java.lang.String)": {"Returns": [["@B_java#lang#Object_E@", "the object for the given key, or null"]], "Parameters": [["@B_java#lang#String_E@", "String: the key for the desired object"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Gets an object for the given key from this resource bundle. Returns null if this resource bundle does not contain an object for the given key.", "history": "Added in API level 1", "FullName": "public final Object handleGetObject (String key)"}, "getContents()": {"Returns": [["@B_java#lang#Object_E@", "an array of an Object array representing a key-value pair."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns an array in which each item is a pair of objects in an Object array. The first element of each pair is the key, which must be a String, and the second element is the value associated with that key. See the class description for details.", "history": "Added in API level 1", "FullName": "protected abstract Object[][] getContents ()"}}, "Inheritance": ["@B_java#util#ResourceBundle_E@"], "ClassName": "java.util.ListResourceBundle", "ClassDesc": "ListResourceBundle is an abstract subclass of ResourceBundle that manages resources for a locale in a convenient and easy to use list. See ResourceBundle for more information about resource bundles in general. Subclasses must override getContents and provide an array, where each item in the array is a pair of objects. The first element of each pair is the key, which must be a String, and the second element is the value associated with that key. The following ListResourceBundle (a related The implementation of a ListResourceBundle subclass must be thread-safe if it's simultaneously used by multiple threads. The default implementations of the methods in this class are thread-safe."}