{"Functions": {"getPrefix(java.lang.String)": {"Returns": [["@B_java#lang#String_E@", "prefix bound to Namespace URI in current context"]], "Parameters": [["@B_java#lang#String_E@", "String: URI of Namespace to lookup"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Get prefix bound to Namespace URI in the current scope. To get all prefixes bound to a Namespace URI in the current scope, use @B_javax#xml#namespace#NamespaceContext#getPrefixes_E@. When requesting a prefix by Namespace URI, the following table describes the returned prefix value for all Namespace URI values:", "history": "Added in API level 8", "FullName": "public abstract String getPrefix (String namespaceURI)"}, "getNamespaceURI(java.lang.String)": {"Returns": [["@B_java#lang#String_E@", "Namespace URI bound to prefix in the current scope"]], "Parameters": [["@B_java#lang#String_E@", "String: prefix to look up"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Get Namespace URI bound to a prefix in the current scope. When requesting a Namespace URI by prefix, the following table describes the returned Namespace URI value for all possible prefix values:", "history": "Added in API level 8", "FullName": "public abstract String getNamespaceURI (String prefix)"}, "getPrefixes(java.lang.String)": {"Returns": [["@B_java#util#Iterator_E@", "Iterator for all prefixes bound to the Namespace URI in the current scope"]], "Parameters": [["@B_java#lang#String_E@", "String: URI of Namespace to lookup"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Get all prefixes bound to a Namespace URI in the current scope. An Iterator over String elements is returned in an arbitrary, When requesting prefixes by Namespace URI, the following table describes the returned prefixes value for all Namespace URI values:", "history": "Added in API level 8", "FullName": "public abstract Iterator getPrefixes (String namespaceURI)"}}, "Inheritance": [], "ClassName": "javax.xml.namespace.NamespaceContext", "ClassDesc": "Interface for read only XML Namespace context processing. An XML Namespace has the properties: Namespace URI: Namespace name expressed as a URI to which the prefix is bound prefix: syntactically, this is the part of the attribute name following the XMLConstants.XMLNS_ATTRIBUTE (\"xmlns\") in the Namespace declaration example: <element xmlns:prefix=\"http://Namespace-name-URI\"> All get*(*) methods operate in the current scope for Namespace URI and prefix resolution. Note that a Namespace URI can be bound to XMLConstants.XMLNS_ATTRIBUTE (\"xmlns\") Namespace declarations occur in the same Start-Tag and refer to the same Namespace URI. e.g. XMLConstants.XMLNS_ATTRIBUTE (\"xmlns\") Namespace declarations in the logical parent element hierarchy. e.g. A prefix can only be bound to a"}