{"Functions": {"getAttributes(java.util.Map<java.lang.String,java.lang.Class<?>>)": {"Returns": [["@B_java#lang#Object_E@", "an array containing the ordered attribute values"]], "Parameters": [["@B_java#util#Map_E@", "Map: a mapping of SQL type names to Java classes"]], "Throws": [["@B_java#sql#SQLException_E@", "if a database access error occurs"], ["@B_java#sql#SQLFeatureNotSupportedException_E@", "if the JDBC driver does not support this method"]], "SeeAlso": [], "Permissions": [], "Description": "Produces the ordered values of the attributes of the SQL structured type that this Struct object represents. As individual attrbutes are proccessed, this method uses the given type map for customizations of the type mappings. If there is no entry in the given type map that matches the structured type that an attribute represents, the driver uses the standard mapping. This method never uses the type map associated with the connection. Conceptually, this method calls the method getObject on each attribute of the structured type and returns a Java array containing the result.", "history": "Added in API level 1", "FullName": "public abstract Object[] getAttributes (Map<String, Class<?>> map)"}, "getSQLTypeName()": {"Returns": [["@B_java#lang#String_E@", "the fully-qualified type name of the SQL structured type for which this Struct object is the generic representation"]], "Parameters": [], "Throws": [["@B_java#sql#SQLException_E@", "if a database access error occurs"], ["@B_java#sql#SQLFeatureNotSupportedException_E@", "if the JDBC driver does not support this method"]], "SeeAlso": [], "Permissions": [], "Description": "Retrieves the SQL type name of the SQL structured type that this Struct object represents.", "history": "Added in API level 1", "FullName": "public abstract String getSQLTypeName ()"}, "getAttributes()": {"Returns": [["@B_java#lang#Object_E@", "an array containing the ordered attribute values"]], "Parameters": [], "Throws": [["@B_java#sql#SQLException_E@", "if a database access error occurs"], ["@B_java#sql#SQLFeatureNotSupportedException_E@", "if the JDBC driver does not support this method"]], "SeeAlso": [], "Permissions": [], "Description": "Produces the ordered values of the attributes of the SQL structured type that this Struct object represents. As individual attributes are processed, this method uses the type map associated with the connection for customizations of the type mappings. If there is no entry in the connection's type map that matches the structured type that an attribute represents, the driver uses the standard mapping. Conceptually, this method calls the method getObject on each attribute of the structured type and returns a Java array containing the result.", "history": "Added in API level 1", "FullName": "public abstract Object[] getAttributes ()"}}, "Inheritance": [], "ClassName": "java.sql.Struct", "ClassDesc": "The standard mapping in the Java programming language for an SQL structured type. A Struct object contains a value for each attribute of the SQL structured type that it represents. By default, an instance ofStruct is valid as long as the application has a reference to it. All methods on the Struct interface must be fully implemented if the JDBC driver supports the data type."}