{"Functions": {"readAttributes()": {"Returns": [["@B_java#nio#file#attribute#BasicFileAttributes_E@", "the file attributes"]], "Parameters": [], "Throws": [["@B_java#io#IOException_E@", "if an I/O error occurs"], ["@B_java#lang#SecurityException_E@", "In the case of the default provider, a security manager is installed, its @B_java#lang#SecurityManager#checkRead_E@ method is invoked to check read access to the file"]], "SeeAlso": [], "Permissions": [], "Description": "Reads the basic file attributes as a bulk operation. It is implementation specific if all file attributes are read as an atomic operation with respect to other file system operations.", "history": "Added in API level 26", "FullName": "public abstract BasicFileAttributes readAttributes ()"}, "setTimes(java.nio.file.attribute.FileTime,java.nio.file.attribute.FileTime,java.nio.file.attribute.FileTime)": {"Returns": [], "Parameters": [["@B_java#nio#file#attribute#FileTime_E@", "FileTime: the new last modified time, or null to not change the value"], ["@B_java#nio#file#attribute#FileTime_E@", "FileTime: the last access time, or null to not change the value"], ["@B_java#nio#file#attribute#FileTime_E@", "FileTime: the file's create time, or null to not change the value"]], "Throws": [["@B_java#io#IOException_E@", "if an I/O error occurs"], ["@B_java#lang#SecurityException_E@", "In the case of the default provider, a security manager is installed, its @B_java#lang#SecurityManager#checkWrite_E@ method is invoked to check write access to the file"]], "SeeAlso": ["@B_java#nio#file#Files#setLastModifiedTime_E@"], "Permissions": [], "Description": "Updates any or all of the file's last modified time, last access time, and create time attributes. This method updates the file's timestamp attributes. The values are converted to the epoch and precision supported by the file system. Converting from finer to coarser granularities result in precision loss. The behavior of this method when attempting to set a timestamp that is not supported or to a value that is outside the range supported by the underlying file store is not defined. It may or not fail by throwing an IOException. If any of the lastModifiedTime, lastAccessTime, or createTime parameters has the value null then the corresponding timestamp is not changed. An implementation may require to read the existing values of the file attributes when only some, but not all, of the timestamp attributes are updated. Consequently, this method may not be an atomic operation with respect to other file system operations. Reading and re-writing existing values may also result in precision loss. If all of the lastModifiedTime, lastAccessTime and createTime parameters are null then this method has no effect.", "history": "Added in API level 26", "FullName": "public abstract void setTimes (FileTime lastModifiedTime, FileTime lastAccessTime, FileTime createTime)"}, "name()": {"Returns": [["@B_java#lang#String_E@", "the name of the attribute view"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the name of the attribute view. Attribute views of this type have the name \"basic\".", "history": "Added in API level 26", "FullName": "public abstract String name ()"}}, "Inheritance": [], "ClassName": "java.nio.file.attribute.BasicFileAttributeView", "ClassDesc": "A file attribute view that provides a view of a basic set of file attributes common to many file systems. The basic set of file attributes consist of mandatory and optional file attributes as defined by the @B_java#nio#file#attribute#BasicFileAttributes_E@ interface. The file attributes are retrieved from the file system as a bulk operation by invoking the @B_java#nio#file#attribute#BasicFileAttributeView#readAttributes_E@ method. This class also defines the @B_java#nio#file#attribute#BasicFileAttributeView#setTimes_E@ method to update the file's time attributes. Where dynamic access to file attributes is required, the attributes supported by this attribute view have the following names and types: The @B_java#nio#file#Files#getAttribute_E@ method may be used to read any of these attributes as if by invoking the @B_java#nio#file#attribute#BasicFileAttributeView#readAttributes_E@ method. The @B_java#nio#file#Files#setAttribute_E@ method may be used to update the file's last modified time, last access time or create time attributes as if by invoking the @B_java#nio#file#attribute#BasicFileAttributeView#setTimes_E@ method."}