{"Functions": {"TextAttribute(java.lang.String)": {"Returns": [], "Parameters": [["@B_java#lang#String_E@", "String: the attribute name to assign to this TextAttribute"]], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Constructs a TextAttribute with the specified name.", "history": "Added in API level 1", "FullName": "protected TextAttribute (String name)"}, "readResolve()": {"Returns": [["@B_java#lang#Object_E@", "the resolved Attribute object"]], "Parameters": [], "Throws": [["@B_java#io#InvalidObjectException_E@", ""]], "SeeAlso": [], "Permissions": [], "Description": "Resolves instances being deserialized to the predefined constants.", "history": "Added in API level 1", "FullName": "protected Object readResolve ()"}}, "Inheritance": ["@B_java#text#AttributedCharacterIterator#Attribute_E@"], "ClassName": "java.awt.font.TextAttribute", "ClassDesc": "The TextAttribute class defines attribute keys and attribute values used for text rendering. TextAttribute instances are used as attribute keys to identify attributes in classes handling text attributes. Other constants defined in this class can be used as attribute values. For each text attribute, the documentation provides: the type of its value, the relevant predefined constants, if any the default effect if the attribute is absent the valid values if there are limitations a description of the effect. The values of attributes must always be immutable. Where value limitations are given, any value outside of that set is reserved for future use; the value will be treated as the default. The value null is treated the same as the default value and results in the default behavior. If the value is not of the proper type, the attribute will be ignored. The identity of the value does not matter, only the actual value. For example, TextAttribute.WEIGHT_BOLD and new Float(2.0) indicate the same WEIGHT. Attribute values of type Number (used for WEIGHT, WIDTH, POSTURE, SIZE, JUSTIFICATION, and TRACKING) can vary along their natural range and are not restricted to the predefined constants. Number.floatValue() is used to get the actual value from the Number. The values for WEIGHT, WIDTH, and POSTURE are interpolated by the system, which can select the 'nearest available' font or use other techniques to approximate the user's request."}