{"Functions": {"toString()": {"Returns": [["@B_java#lang#String_E@", "a String describing the contents of this PKIXCertPathBuilderResult"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Return a printable representation of this PKIXCertPathBuilderResult.", "history": "Added in API level 1", "FullName": "public String toString ()"}, "PKIXCertPathBuilderResult(java.security.cert.CertPath,java.security.cert.TrustAnchor,java.security.cert.PolicyNode,java.security.PublicKey)": {"Returns": [], "Parameters": [["@B_java#security#cert#CertPath_E@", "CertPath: the validated CertPath"], ["@B_java#security#cert#TrustAnchor_E@", "TrustAnchor: a TrustAnchor describing the CA that served as a trust anchor for the certification path"], ["@B_java#security#cert#PolicyNode_E@", "PolicyNode: the immutable valid policy tree, or null if there are no valid policies"], ["@B_java#security#PublicKey_E@", "PublicKey: the public key of the subject"]], "Throws": [["@B_java#lang#NullPointerException_E@", "if the certPath, trustAnchor or subjectPublicKey parameters are null"]], "SeeAlso": [], "Permissions": [], "Description": "Creates an instance of PKIXCertPathBuilderResult containing the specified parameters.", "history": "Added in API level 1", "FullName": "public PKIXCertPathBuilderResult (CertPath certPath, TrustAnchor trustAnchor, PolicyNode policyTree, PublicKey subjectPublicKey)"}, "getCertPath()": {"Returns": [["@B_java#security#cert#CertPath_E@", "the built and validated CertPath (never null)"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Returns the built and validated certification path. The CertPath object does not include the trust anchor. Instead, use the @B_java#security#cert#PKIXCertPathValidatorResult#getTrustAnchor_E@ method to obtain the TrustAnchor that served as the trust anchor for the certification path.", "history": "Added in API level 1", "FullName": "public CertPath getCertPath ()"}}, "Inheritance": ["@B_java#security#cert#PKIXCertPathValidatorResult_E@"], "ClassName": "java.security.cert.PKIXCertPathBuilderResult", "ClassDesc": "This class represents the successful result of the PKIX certification path builder algorithm. All certification paths that are built and returned using this algorithm are also validated according to the PKIX certification path validation algorithm. Instances of PKIXCertPathBuilderResult are returned by the build method of CertPathBuilder objects implementing the PKIX algorithm. All PKIXCertPathBuilderResult objects contain the certification path constructed by the build algorithm, the valid policy tree and subject public key resulting from the build algorithm, and a TrustAnchor describing the certification authority (CA) that served as a trust anchor for the certification path. Unless otherwise specified, the methods defined in this class are not thread-safe. Multiple threads that need to access a single object concurrently should synchronize amongst themselves and provide the necessary locking. Multiple threads each manipulating separate objects need not synchronize."}