{"Functions": {"getObject(java.util.Map<java.lang.String,java.lang.Class<?>>)": {"Returns": [["@B_java#lang#Object_E@", "a Java Object that is the custom mapping for the SQL structured type to which this Ref object refers"]], "Parameters": [["@B_java#util#Map_E@", "Map: a java.util.Map object that contains the mapping to use (the fully-qualified name of the SQL structured type being referenced and the class object for SQLData implementation to which the SQL structured type will be mapped)"]], "Throws": [["@B_java#sql#SQLException_E@", "if a database access error occurs"], ["@B_java#sql#SQLFeatureNotSupportedException_E@", "if the JDBC driver does not support this method"]], "SeeAlso": ["@B_java#sql#Ref#setObject_E@"], "Permissions": [], "Description": "Retrieves the referenced object and maps it to a Java type using the given type map.", "history": "Added in API level 1", "FullName": "public abstract Object getObject (Map<String, Class<?>> map)"}, "getBaseTypeName()": {"Returns": [["@B_java#lang#String_E@", "the fully-qualified SQL name of the referenced SQL structured type"]], "Parameters": [], "Throws": [["@B_java#sql#SQLException_E@", "if a database access error occurs"], ["@B_java#sql#SQLFeatureNotSupportedException_E@", "if the JDBC driver does not support this method"]], "SeeAlso": [], "Permissions": [], "Description": "Retrieves the fully-qualified SQL name of the SQL structured type that this Ref object references.", "history": "Added in API level 1", "FullName": "public abstract String getBaseTypeName ()"}, "setObject(java.lang.Object)": {"Returns": [], "Parameters": [["@B_java#lang#Object_E@", "Object: an Object representing the SQL structured type instance that this Ref object will reference"]], "Throws": [["@B_java#sql#SQLException_E@", "if a database access error occurs"], ["@B_java#sql#SQLFeatureNotSupportedException_E@", "if the JDBC driver does not support this method"]], "SeeAlso": ["@B_java#sql#Ref#getObject_E@", "@B_java#sql#PreparedStatement#setObject_E@", "@B_java#sql#CallableStatement#setObject_E@"], "Permissions": [], "Description": "Sets the structured type value that this Ref object references to the given instance of Object. The driver converts this to an SQL structured type when it sends it to the database.", "history": "Added in API level 1", "FullName": "public abstract void setObject (Object value)"}, "getObject()": {"Returns": [["@B_java#lang#Object_E@", "a Java Object that is the mapping for the SQL structured type to which this Ref object refers"]], "Parameters": [], "Throws": [["@B_java#sql#SQLException_E@", "if a database access error occurs"], ["@B_java#sql#SQLFeatureNotSupportedException_E@", "if the JDBC driver does not support this method"]], "SeeAlso": ["@B_java#sql#Ref#setObject_E@"], "Permissions": [], "Description": "Retrieves the SQL structured type instance referenced by this Ref object. If the connection's type map has an entry for the structured type, the instance will be custom mapped to the Java class indicated in the type map. Otherwise, the structured type instance will be mapped to a Struct object.", "history": "Added in API level 1", "FullName": "public abstract Object getObject ()"}}, "Inheritance": [], "ClassName": "java.sql.Ref", "ClassDesc": "The mapping in the Java programming language of an SQL REF value, which is a reference to an SQL structured type value in the database. SQL REF values are stored in a table that contains instances of a referenceable SQL structured type, and each REF value is a unique identifier for one instance in that table. An SQL REF value may be used in place of the SQL structured type it references, either as a column value in a table or an attribute value in a structured type. Because an SQL REF value is a logical pointer to an SQL structured type, a Ref object is by default also a logical pointer. Thus, retrieving an SQL REF value as a Ref object does not materialize the attributes of the structured type on the client. A Ref object can be stored in the database using the PreparedStatement.setRef method. All methods on the Ref interface must be fully implemented if the JDBC driver supports the data type."}