{"Functions": {"tryAdvance(T_CONS)": {"Returns": [["boolean", "false if no remaining elements existed upon entry to this method, else true."]], "Parameters": [["T_CONS", "T_CONS: The action"]], "Throws": [["@B_java#lang#NullPointerException_E@", "if the specified action is null"]], "SeeAlso": [], "Permissions": [], "Description": "If a remaining element exists, performs the given action on it, returning true; else returns false. If this Spliterator is @B_java#util#Spliterator#ORDERED_E@ the action is performed on the next element in encounter order. Exceptions thrown by the action are relayed to the caller.", "history": "Added in API level 24", "FullName": "public abstract boolean tryAdvance (T_CONS action)"}, "trySplit()": {"Returns": [["T_SPLITR", "a Spliterator covering some portion of the elements, or null if this spliterator cannot be split"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "If this spliterator can be partitioned, returns a Spliterator covering elements, that will, upon return from this method, not be covered by this Spliterator. If this Spliterator is @B_java#util#Spliterator#ORDERED_E@, the returned Spliterator must cover a strict prefix of the elements. Unless this Spliterator covers an infinite number of elements, repeated calls to trySplit() must eventually return null. Upon non-null return: the value reported for estimateSize() before splitting, must, after splitting, be greater than or equal to estimateSize() for this and the returned Spliterator; and if this Spliterator is SUBSIZED, then estimateSize() for this spliterator before splitting must be equal to the sum of estimateSize() for this and the returned Spliterator after splitting. This method may return null for any reason, including emptiness, inability to split after traversal has commenced, data structure constraints, and efficiency considerations.", "history": "Added in API level 24", "FullName": "public abstract T_SPLITR trySplit ()"}, "forEachRemaining(T_CONS)": {"Returns": [], "Parameters": [["T_CONS", "T_CONS: The action"]], "Throws": [["@B_java#lang#NullPointerException_E@", "if the specified action is null"]], "SeeAlso": [], "Permissions": [], "Description": "Performs the given action for each remaining element, sequentially in the current thread, until all elements have been processed or the action throws an exception. If this Spliterator is @B_java#util#Spliterator#ORDERED_E@, actions are performed in encounter order. Exceptions thrown by the action are relayed to the caller.", "history": "Added in API level 24", "FullName": "public void forEachRemaining (T_CONS action)"}}, "Inheritance": [], "ClassName": "@B_java#util#Spliterator#OfPrimitive_E@", "ClassDesc": "A Spliterator specialized for primitive values."}