{"Functions": {"isNormalized(java.lang.CharSequence,java.text.Normalizer.Form)": {"Returns": [["boolean", "true if the sequence of char values is normalized; false otherwise."]], "Parameters": [["@B_java#lang#CharSequence_E@", "CharSequence: The sequence of char values to be checked."], ["@B_java#text#Normalizer#Form_E@", "Normalizer.Form: The normalization form; one of @B_java#text#Normalizer#Form#NFC_E@, @B_java#text#Normalizer#Form#NFD_E@, @B_java#text#Normalizer#Form#NFKC_E@, @B_java#text#Normalizer#Form#NFKD_E@"]], "Throws": [["@B_java#lang#NullPointerException_E@", "If src or form is null."]], "SeeAlso": [], "Permissions": [], "Description": "Determines if the given sequence of char values is normalized.", "history": "Added in API level 9", "FullName": "public static boolean isNormalized (CharSequence src, Normalizer.Form form)"}, "normalize(java.lang.CharSequence,java.text.Normalizer.Form)": {"Returns": [["@B_java#lang#String_E@", "The normalized String"]], "Parameters": [["@B_java#lang#CharSequence_E@", "CharSequence: The sequence of char values to normalize."], ["@B_java#text#Normalizer#Form_E@", "Normalizer.Form: The normalization form; one of @B_java#text#Normalizer#Form#NFC_E@, @B_java#text#Normalizer#Form#NFD_E@, @B_java#text#Normalizer#Form#NFKC_E@, @B_java#text#Normalizer#Form#NFKD_E@"]], "Throws": [["@B_java#lang#NullPointerException_E@", "If src or form is null."]], "SeeAlso": [], "Permissions": [], "Description": "Normalize a sequence of char values. The sequence will be normalized according to the specified normalization from.", "history": "Added in API level 9", "FullName": "public static String normalize (CharSequence src, Normalizer.Form form)"}}, "Inheritance": [], "ClassName": "java.text.Normalizer", "ClassDesc": "This class provides the method normalize which transforms Unicode text into an equivalent composed or decomposed form, allowing for easier sorting and searching of text. The normalize method supports the standard normalization forms described in Characters with accents or other adornments can be encoded in several different ways in Unicode. For example, take the character A-acute. In Unicode, this can be encoded as a single character (the \"composed\" form): Similarly, the string \"ffi\" can be encoded as three separate letters: The normalize method helps solve these problems by transforming text into the canonical composed and decomposed forms as shown in the first example above. In addition, you can have it perform compatibility decompositions so that you can treat compatibility characters the same as their equivalents. Finally, the normalize method rearranges accents into the proper canonical order, so that you do not have to worry about accent rearrangement on your own. The W3C generally recommends to exchange texts in NFC. Note also that most legacy character encodings use only precomposed forms and often do not encode any combining marks by themselves. For conversion to such character encodings the Unicode text needs to be normalized to NFC. For more usage examples, see the Unicode Standard Annex."}