{"Functions": {"isChunked()": {"Returns": [["", "true if chunked encoding is preferred for this entity, or false if it is not"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Tells about chunked encoding for this entity. The primary purpose of this method is to indicate whether chunked encoding should be used when the entity is sent. For entities that are received, it can also indicate whether the entity was received with chunked encoding. The behavior of wrapping entities is implementation dependent, but should respect the primary purpose.", "history": "Added in API level 1", "FullName": "public abstract boolean isChunked ()"}, "getContent()": {"Returns": [["", "a new input stream that returns the entity data."]], "Parameters": [], "Throws": [["@B_java#io#IOException_E@", "if the stream could not be created"], ["@B_java#lang#IllegalStateException_E@", "if this entity is not repeatable and the stream has already been obtained previously"]], "SeeAlso": [], "Permissions": [], "Description": "Creates a new InputStream object of the entity. It is a programming error to return the same InputStream object more than once. Entities that are not @B_org#apache#http#HttpEntity#isRepeatable_E@ will throw an exception if this method is called multiple times.", "history": "Added in API level 1", "FullName": "public abstract InputStream getContent ()"}, "getContentType()": {"Returns": [["", "the Content-Type header for this entity, or null if the content type is unknown"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Obtains the Content-Type header, if known. This is the header that should be used when sending the entity, or the one that was received with the entity. It can include a charset attribute.", "history": "Added in API level 1", "FullName": "public abstract Header getContentType ()"}, "consumeContent()": {"Returns": [], "Parameters": [], "Throws": [["@B_java#io#IOException_E@", "if an I/O error occurs. This indicates that connection keep-alive is not possible."]], "SeeAlso": [], "Permissions": [], "Description": "TODO: The name of this method is misnomer. It will be renamed to #finish() in the next major release. This method is called to indicate that the content of this entity is no longer required. All entity implementations are expected to release all allocated resources as a result of this method invocation. Content streaming entities are also expected to dispose of the remaining content, if any. Wrapping entities should delegate this call to the wrapped entity. This method is of particular importance for entities being received from a @B_org#apache#http#HttpConnection_E@. The entity needs to be consumed completely in order to re-use the connection with keep-alive.", "history": "Added in API level 1", "FullName": "public abstract void consumeContent ()"}, "getContentLength()": {"Returns": [["", "the number of bytes of the content, or a negative number if unknown. If the content length is known but exceeds @B_java#lang#Long#MAX_VALUE_E@, a negative number is returned."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Tells the length of the content, if known.", "history": "Added in API level 1", "FullName": "public abstract long getContentLength ()"}, "isStreaming()": {"Returns": [["", "true if the entity content is streamed and not yet consumed, false otherwise"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Tells whether this entity depends on an underlying stream. Streamed entities should return true until the content has been consumed, false afterwards. Self-contained entities should return false. Wrapping entities should delegate this call to the wrapped entity. The content of a streamed entity is consumed when the stream returned by @B_org#apache#http#HttpEntity#getContent_E@ has been read to EOF, or after @B_org#apache#http#HttpEntity#consumeContent_E@ has been called. If a streamed entity can not detect whether the stream has been read to EOF, it should return true until @B_org#apache#http#HttpEntity#consumeContent_E@ is called.", "history": "Added in API level 1", "FullName": "public abstract boolean isStreaming ()"}, "isRepeatable()": {"Returns": [["", "true if the entity is repeatable, false otherwise."]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Tells if the entity is capable to produce its data more than once. A repeatable entity's getContent() and writeTo(OutputStream) methods can be called more than once whereas a non-repeatable entity's can not.", "history": "Added in API level 1", "FullName": "public abstract boolean isRepeatable ()"}, "writeTo(java.io.OutputStream)": {"Returns": [], "Parameters": [["@B_java#io#OutputStream_E@", "the output stream to write entity content to"]], "Throws": [["@B_java#io#IOException_E@", "if an I/O error occurs"]], "SeeAlso": [], "Permissions": [], "Description": "Writes the entity content to the output stream.", "history": "Added in API level 1", "FullName": "public abstract void writeTo (OutputStream outstream)"}, "getContentEncoding()": {"Returns": [["", "the Content-Encoding header for this entity, or null if the content encoding is unknown"]], "Parameters": [], "Throws": [], "SeeAlso": [], "Permissions": [], "Description": "Obtains the Content-Encoding header, if known. This is the header that should be used when sending the entity, or the one that was received with the entity. Wrapping entities that modify the content encoding should adjust this header accordingly.", "history": "Added in API level 1", "FullName": "public abstract Header getContentEncoding ()"}}, "Inheritance": [], "ClassName": "org.apache.http.HttpEntity", "ClassDesc": "Please use @B_java#net#URL#openConnection_E@ instead. Please visit An entity that can be sent or received with an HTTP message. Entities can be found in some @B_org#apache#http#HttpEntityEnclosingRequest_E@ and in @B_org#apache#http#HttpResponse_E@, where they are optional. In some places, the JavaDoc distinguishes three kinds of entities, depending on where their @B_org#apache#http#HttpEntity#getContent_E@ originates: @B_org#apache#http#HttpConnection_E@. @B_org#apache#http#HttpEntity#isStreaming_E@ entities are generally not @B_org#apache#http#HttpEntity#isRepeatable_E@. @B_org#apache#http#HttpEntity#isRepeatable_E@. This distinction is important for connection management with incoming entities. For entities that are created by an application and only sent using the HTTP components framework, the difference between streamed and self-contained is of little importance. In that case, it is suggested to consider non-repeatable entities as streamed, and those that are repeatable (without a huge effort) as self-contained."}