{"Functions": {"setDTDHandler(org.xml.sax.DTDHandler)": {"Returns": [], "Parameters": [["@B_org#xml#sax#DTDHandler_E@", "DTDHandler: The DTD handler."]], "Throws": [], "SeeAlso": ["@B_org#xml#sax#DTDHandler_E@", "@B_org#xml#sax#HandlerBase_E@"], "Permissions": [], "Description": "Allow an application to register a DTD event handler. If the application does not register a DTD handler, all DTD events reported by the SAX parser will be silently ignored (this is the default behaviour implemented by HandlerBase). Applications may register a new or different handler in the middle of a parse, and the SAX parser must begin using the new handler immediately.", "history": "Added in API level 1 Deprecated in API level 9", "FullName": "public abstract void setDTDHandler (DTDHandler handler)"}, "setLocale(java.util.Locale)": {"Returns": [], "Parameters": [["@B_java#util#Locale_E@", "Locale: A Java Locale object."]], "Throws": [["@B_org#xml#sax#SAXException_E@", "Throws an exception (using the previous or default locale) if the requested locale is not supported."]], "SeeAlso": ["@B_org#xml#sax#SAXException_E@", "@B_org#xml#sax#SAXParseException_E@"], "Permissions": [], "Description": "Allow an application to request a locale for errors and warnings. SAX parsers are not required to provide localisation for errors and warnings; if they cannot support the requested locale, however, they must throw a SAX exception. Applications may not request a locale change in the middle of a parse.", "history": "Added in API level 1 Deprecated in API level 9", "FullName": "public abstract void setLocale (Locale locale)"}, "setDocumentHandler(org.xml.sax.DocumentHandler)": {"Returns": [], "Parameters": [["@B_org#xml#sax#DocumentHandler_E@", "DocumentHandler: The document handler."]], "Throws": [], "SeeAlso": ["@B_org#xml#sax#DocumentHandler_E@", "@B_org#xml#sax#HandlerBase_E@"], "Permissions": [], "Description": "Allow an application to register a document event handler. If the application does not register a document handler, all document events reported by the SAX parser will be silently ignored (this is the default behaviour implemented by HandlerBase). Applications may register a new or different handler in the middle of a parse, and the SAX parser must begin using the new handler immediately.", "history": "Added in API level 1 Deprecated in API level 9", "FullName": "public abstract void setDocumentHandler (DocumentHandler handler)"}, "setErrorHandler(org.xml.sax.ErrorHandler)": {"Returns": [], "Parameters": [["@B_org#xml#sax#ErrorHandler_E@", "ErrorHandler: The error handler."]], "Throws": [], "SeeAlso": ["@B_org#xml#sax#ErrorHandler_E@", "@B_org#xml#sax#SAXException_E@", "@B_org#xml#sax#HandlerBase_E@"], "Permissions": [], "Description": "Allow an application to register an error event handler. If the application does not register an error event handler, all error events reported by the SAX parser will be silently ignored, except for fatalError, which will throw a SAXException (this is the default behaviour implemented by HandlerBase). Applications may register a new or different handler in the middle of a parse, and the SAX parser must begin using the new handler immediately.", "history": "Added in API level 1 Deprecated in API level 9", "FullName": "public abstract void setErrorHandler (ErrorHandler handler)"}, "parse(org.xml.sax.InputSource)": {"Returns": [], "Parameters": [["@B_org#xml#sax#InputSource_E@", "InputSource: The input source for the top-level of the XML document."]], "Throws": [["@B_org#xml#sax#SAXException_E@", "Any SAX exception, possibly wrapping another exception."], ["@B_java#io#IOException_E@", "An IO exception from the parser, possibly from a byte stream or character stream supplied by the application."]], "SeeAlso": ["@B_org#xml#sax#InputSource_E@", "@B_org#xml#sax#Parser#parse_E@", "@B_org#xml#sax#Parser#setEntityResolver_E@", "@B_org#xml#sax#Parser#setDTDHandler_E@", "@B_org#xml#sax#Parser#setDocumentHandler_E@", "@B_org#xml#sax#Parser#setErrorHandler_E@"], "Permissions": [], "Description": "Parse an XML document. The application can use this method to instruct the SAX parser to begin parsing an XML document from any valid input source (a character stream, a byte stream, or a URI). Applications may not invoke this method while a parse is in progress (they should create a new Parser instead for each additional XML document). Once a parse is complete, an application may reuse the same Parser object, possibly with a different input source.", "history": "Added in API level 1 Deprecated in API level 9", "FullName": "public abstract void parse (InputSource source)"}, "setEntityResolver(org.xml.sax.EntityResolver)": {"Returns": [], "Parameters": [["@B_org#xml#sax#EntityResolver_E@", "EntityResolver: The object for resolving entities."]], "Throws": [], "SeeAlso": ["@B_org#xml#sax#EntityResolver_E@", "@B_org#xml#sax#HandlerBase_E@"], "Permissions": [], "Description": "Allow an application to register a custom entity resolver. If the application does not register an entity resolver, the SAX parser will resolve system identifiers and open connections to entities itself (this is the default behaviour implemented in HandlerBase). Applications may register a new or different entity resolver in the middle of a parse, and the SAX parser must begin using the new resolver immediately.", "history": "Added in API level 1 Deprecated in API level 9", "FullName": "public abstract void setEntityResolver (EntityResolver resolver)"}, "parse(java.lang.String)": {"Returns": [], "Parameters": [["@B_java#lang#String_E@", "String: The system identifier (URI)."]], "Throws": [["@B_org#xml#sax#SAXException_E@", "Any SAX exception, possibly wrapping another exception."], ["@B_java#io#IOException_E@", "An IO exception from the parser, possibly from a byte stream or character stream supplied by the application."]], "SeeAlso": ["@B_org#xml#sax#Parser#parse_E@"], "Permissions": [], "Description": "Parse an XML document from a system identifier (URI). This method is a shortcut for the common case of reading a document from a system identifier. It is the exact equivalent of the following: If the system identifier is a URL, it must be fully resolved by the application before it is passed to the parser.", "history": "Added in API level 1 Deprecated in API level 9", "FullName": "public abstract void parse (String systemId)"}}, "Inheritance": [], "ClassName": "org.xml.sax.Parser", "ClassDesc": "This interface has been replaced by the SAX2 @B_org#xml#sax#XMLReader_E@ interface, which includes Namespace support. Basic interface for SAX (Simple API for XML) parsers. This was the main event supplier interface for SAX1; it has been replaced in SAX2 by @B_org#xml#sax#XMLReader_E@, which includes Namespace support and sophisticated configurability and extensibility. All SAX1 parsers must implement this basic interface: it allows applications to register handlers for different types of events and to initiate a parse from a URI, or a character stream. All SAX1 parsers must also implement a zero-argument constructor (though other constructors are also allowed). SAX1 parsers are reusable but not re-entrant: the application may reuse a parser object (possibly with a different input source) once the first parse has completed successfully, but it may not invoke the parse() methods recursively within a parse."}